{
  "disorders": [
    {
      "id": "alcohol_addiction",
      "name": {
        "en": "Alcohol Addiction",
        "ar": "إدمان الكحول"
      },
      "steps": [
        {
          "id": "alcohol_step_1",
          "step_number": 1,
          "description": {
            "en": "We admitted we were powerless over alcohol—that our lives had become unmanageable. Look, I know it’s hard to say this, but drinking has taken over your life. You’re not yourself anymore—your family’s hurting, your job’s slipping, and you’re stuck in a cycle. Admitting you can’t control alcohol is the first step to freedom.",
            "ar": "اعترفنا بأننا عاجزون عن التحكم في الكحول—وأن حياتنا أصبحت غير قابلة للإدارة. أعرف إنها صعبة، بس الشرب سيطر على حياتك. إنت مش زي ما كنت—عيلتك بتتأذى، شغلك بيضيع، وإنت محاصر في دايرة. لما تعترف إنك مش قادر تتحكم في الكحول، دي أول خطوة للحرية."
          },
          "relevance": {
            "en": "This step is crucial because denial often fuels addiction. Recognizing and admitting your powerlessness over alcohol breaks this destructive cycle, paving the way for seeking help and beginning the journey of recovery.",
            "ar": "هذه الخطوة حاسمة لأن الإنكار غالبًا ما يغذي الإدمان. إدراك وعجزك عن التحكم في الكحول يكسر هذه الدورة المدمرة، مما يمهد الطريق لطلب المساعدة وبدء رحلة التعافي."
          },
          "practical_suggestions": {
            "en": [
              "Attend an Alcoholics Anonymous (AA) meeting and listen to others' experiences.",
              "Confide in a trusted friend, family member, or therapist about your struggle and openly admit your inability to control alcohol.",
              "Document the negative impacts alcohol has had on your life, including relationships, work, and health."
            ],
            "ar": [
              "احضر اجتماعًا لمدمني الكحول المجهولين (AA) واستمع إلى تجارب الآخرين.",
              "صارح صديقًا موثوقًا به أو فردًا من العائلة أو معالجًا بشأن صراعك واعترف صراحة بعدم قدرتك على التحكم في الكحول.",
              "وثّق الآثار السلبية التي أحدثها الكحول في حياتك، بما في ذلك العلاقات والعمل والصحة."
            ]
          }
        },
        {
          "id": "alcohol_step_2",
          "step_number": 2,
          "description": {
            "en": "Came to believe that a Power greater than ourselves could restore us to sanity. You’ve admitted you’re stuck, and that’s a huge win. Now, it’s time to believe there’s something out there—whether it’s a higher power or the strength of community—that can guide you back to a clear mind and a stable life.",
            "ar": "جئنا لنؤمن بأن قوة أعظم منا يمكن أن تعيدنا إلى رشدنا. لقد اعترفت بأنك عالق، وهذا انتصار كبير. الآن، حان الوقت لتؤمن بأن هناك شيئًا ما—سواء كانت قوة عليا أو قوة المجتمع—يمكن أن يوجهك إلى عقل واضح وحياة مستقرة."
          },
          "relevance": {
            "en": "This step introduces the concept of hope and external support. Believing in a power greater than oneself (which can be a spiritual concept, communal, or even personal resilience) fosters optimism and provides a foundation for trusting the recovery process.",
            "ar": "هذه الخطوة تقدم مفهوم الأمل والدعم الخارجي. الإيمان بقوة أعظم من الذات (سواء كانت روحية، مجتمعية، أو حتى مرونة شخصية) يغذي التفاؤل ويوفر أساسًا للثقة في عملية التعافي."
          },
          "practical_suggestions": {
            "en": [
              "Explore different concepts of a 'Higher Power' that resonate with you, without rigid definitions.",
              "Spend time in nature, meditation, or prayer to connect with something larger than yourself.",
              "Read stories of recovery where individuals found strength and guidance from external sources."
            ],
            "ar": [
              "استكشف مفاهيم مختلفة لـ 'قوة عليا' تتناسب معك، دون تعريفات جامدة.",
              "اقضِ وقتًا في الطبيعة أو التأمل أو الصلاة للتواصل مع شيء أكبر منك.",
              "اقرأ قصص التعافي حيث وجد الأفراد القوة والتوجيه من مصادر خارجية."
            ]
          }
        },
        {
          "id": "alcohol_step_3",
          "step_number": 3,
          "description": {
            "en": "Made a decision to turn our will and our lives over to the care of God as we understood Him. You’ve opened up to the idea of a Higher Power. Now, it’s about making a conscious choice to trust that power, letting go of trying to control everything yourself, and allowing guidance to lead your recovery.",
            "ar": "اتخذنا قرارًا بتحويل إرادتنا وحياتنا إلى رعاية الله كما فهمناه. لقد انفتحت على فكرة القوة العليا. الآن، يتعلق الأمر باتخاذ قرار واعي بالثقة في تلك القوة، والتخلي عن محاولة التحكم في كل شيء بنفسك، والسماح للتوجيه بقيادة تعافيك."
          },
          "relevance": {
            "en": "This step marks a commitment to surrender and trust. By choosing to hand over control, individuals release the burden of self-reliance in recovery and open themselves to the wisdom and support of their chosen Higher Power or recovery program.",
            "ar": "تحدد هذه الخطوة التزامًا بالاستسلام والثقة. باختيار تسليم السيطرة، يحرر الأفراد عبء الاعتماد على الذات في التعافي ويفتحون أنفسهم لحكمة ودعم القوة العليا التي اختاروها أو برنامج التعافي."
          },
          "practical_suggestions": {
            "en": [
              "Write a personal prayer or statement expressing your willingness to turn over your will.",
              "Discuss this concept with your sponsor or a spiritual advisor.",
              "Identify areas in your life where you've tried to exert too much control and consider how surrendering might help."
            ],
            "ar": [
              "اكتب صلاة شخصية أو بيانًا يعبر عن استعدادك لتسليم إرادتك.",
              "ناقش هذا المفهوم مع مرشدك أو مستشارك الروحي.",
              "حدد المجالات في حياتك حيث حاولت ممارسة الكثير من السيطرة وفكر كيف يمكن للاستسلام أن يساعد."
            ]
          }
        },
        {
          "id": "alcohol_step_4",
          "step_number": 4,
          "description": {
            "en": "Made a searching and fearless moral inventory of ourselves. It’s tough, but it’s time to look deep inside. What are your fears, resentments, and shortcomings? Be honest with yourself, without judgment. This isn’t about self-blame, but about understanding what’s holding you back.",
            "ar": "قمنا بجرد أخلاقي صادق وشجاع لأنفسنا. الأمر صعب، لكن حان الوقت لتنظر في أعماقك. ما هي مخاوفك، استياءاتك، وعيوبك؟ كن صريحًا مع نفسك، بدون حكم. هذا ليس عن لوم الذات، ولكن عن فهم ما يعيقك."
          },
          "relevance": {
            "en": "This step promotes self-awareness and accountability. A thorough inventory helps individuals identify patterns of behavior, underlying issues, and character defects that contribute to their addiction, forming a basis for personal growth.",
            "ar": "هذه الخطوة تعزز الوعي الذاتي والمساءلة. الجرد الشامل يساعد الأفراد على تحديد أنماط السلوك، والمشكلات الأساسية، والعيوب الشخصية التي تساهم في إدمانهم، وتشكل أساسًا للنمو الشخصي."
          },
          "practical_suggestions": {
            "en": [
              "Write down a list of your resentments, fears, and past wrongs.",
              "Work with your sponsor or a trusted mentor to guide you through this process.",
              "Reflect on how your actions have impacted others and what role your character defects played."
            ],
            "ar": [
              "اكتب قائمة بالاستياءات والمخاوف والأخطاء السابقة.",
              "اعمل مع مرشدك أو معلم موثوق به لإرشادك خلال هذه العملية.",
              "تأمل كيف أثرت أفعالك على الآخرين وما هو الدور الذي لعبته عيوب شخصيتك."
            ]
          }
        },
        {
          "id": "alcohol_step_5",
          "step_number": 5,
          "description": {
            "en": "Admitted to God, to ourselves, and to another human being the exact nature of our wrongs. You’ve done the hard work of looking within. Now, it’s time to share that truth with someone you trust—your Higher Power, yourself, and another person. This act of vulnerability is incredibly healing.",
            "ar": "اعترفنا لله، ولأنفسنا، ولإنسان آخر بالطبيعة الدقيقة لأخطائنا. لقد قمت بالعمل الشاق بالنظر إلى الداخل. الآن، حان الوقت لمشاركة تلك الحقيقة مع شخص تثق به—قوتك العليا، نفسك، وشخص آخر. هذا العمل من الضعف الشديد هو شافٍ بشكل لا يصدق."
          },
          "relevance": {
            "en": "This step fosters humility and breaks the isolation often associated with addiction. Openly admitting past wrongs to a trusted individual facilitates emotional release, reduces shame, and deepens the commitment to recovery.",
            "ar": "تعزز هذه الخطوة التواضع وتكسر العزلة المرتبطة غالبًا بالإدمان. الاعتراف الصريح بالأخطاء الماضية لشخص موثوق به يسهل التحرر العاطفي، ويقلل من الخزي، ويعمق الالتزام بالتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Choose a trusted individual (sponsor, therapist, spiritual advisor) with whom to share your inventory.",
              "Practice honesty and vulnerability when discussing your past actions and feelings.",
              "Recognize that this step is about liberation, not judgment."
            ],
            "ar": [
              "اختر فردًا موثوقًا به (مرشد، معالج، مستشار روحي) لمشاركة جردك معه.",
              "مارس الصدق والضعف عند مناقشة أفعالك ومشاعرك السابقة.",
              "أدرك أن هذه الخطوة تتعلق بالتحرر، وليس الحكم."
            ]
          }
        },
        {
          "id": "alcohol_step_6",
          "step_number": 6,
          "description": {
            "en": "Were entirely ready to have God remove all these defects of character. You’ve faced your shortcomings. Now, you need to be completely willing to let go of them. This isn’t about instantly changing, but about being ready and open for change to happen, trusting that your Higher Power can help.",
            "ar": "كنا مستعدين تمامًا لأن يزيل الله كل هذه العيوب في الشخصية. لقد واجهت عيوبك. الآن، يجب أن تكون مستعدًا تمامًا للتخلي عنها. هذا ليس عن التغيير الفوري، ولكن عن الاستعداد والانفتاح لحدوث التغيير، مع الثقة بأن قوتك العليا يمكن أن تساعد."
          },
          "relevance": {
            "en": "This step cultivates willingness and acceptance. Being entirely ready to release character defects demonstrates a profound commitment to personal transformation and reliance on a Higher Power for growth.",
            "ar": "تنمي هذه الخطوة الاستعداد والقبول. أن تكون مستعدًا تمامًا للتخلي عن عيوب الشخصية يظهر التزامًا عميقًا بالتحول الشخصي والاعتماد على قوة عليا للنمو."
          },
          "practical_suggestions": {
            "en": [
              "Identify specific character defects you are ready to let go of.",
              "Engage in daily reflection or prayer, expressing your willingness for change.",
              "Visualize yourself living without these defects and experiencing freedom."
            ],
            "ar": [
              "حدد عيوب الشخصية المحددة التي أنت مستعد للتخلي عنها.",
              "انخرط في التأمل اليومي أو الصلاة، معبراً عن استعدادك للتغيير.",
              "تخيل نفسك تعيش بدون هذه العيوب وتختبر الحرية."
            ]
          }
        },
        {
          "id": "alcohol_step_7",
          "step_number": 7,
          "description": {
            "en": "Humbly asked Him to remove our shortcomings. You’ve identified your defects and are ready to let them go. Now, with humility, ask your Higher Power to remove them. This isn’t about magic; it’s about acknowledging you can’t do it alone and inviting spiritual help into your life.",
            "ar": "طلبنا منه بتواضع أن يزيل عيوبنا. لقد حددت عيوبك وأنت مستعد للتخلي عنها. الآن، بتواضع، اطلب من قوتك العليا أن تزيلها. هذا ليس عن السحر؛ إنه يتعلق بالاعتراف بأنك لا تستطيع القيام بذلك بمفردك ودعوة المساعدة الروحية إلى حياتك."
          },
          "relevance": {
            "en": "This step emphasizes humility and reliance on a Higher Power for spiritual growth. Humbly asking for the removal of shortcomings signifies a deeper level of surrender and trust in the recovery process.",
            "ar": "تؤكد هذه الخطوة على التواضع والاعتماد على قوة عليا للنمو الروحي. طلب إزالة العيوب بتواضع يدل على مستوى أعمق من الاستسلام والثقة في عملية التعافي."
          },
          "practical_suggestions": {
            "en": [
              "Formulate a specific prayer or affirmation requesting the removal of your shortcomings.",
              "Practice humility in your daily interactions and acknowledge your limitations.",
              "Focus on accepting help and guidance from your Higher Power and your support system."
            ],
            "ar": [
              "صغ دعاءً أو تأكيدًا محددًا يطلب إزالة عيوبك.",
              "مارس التواضع في تفاعلاتك اليومية واعترف بحدودك.",
              "ركز على قبول المساعدة والتوجيه من قوتك العليا ونظام دعمك."
            ]
          }
        },
        {
          "id": "alcohol_step_8",
          "step_number": 8,
          "description": {
            "en": "Made a list of all persons we had harmed, and became willing to make amends to them all. You’ve focused on yourself. Now, it’s time to think about those you’ve hurt. Make a list, and be ready in your heart to make things right with each one, even if it’s just in your mind for now.",
            "ar": "أعددنا قائمة بجميع الأشخاص الذين آذيناهم، وأصبحنا مستعدين لإصلاح أخطائنا معهم جميعًا. لقد ركزت على نفسك. الآن، حان الوقت للتفكير في أولئك الذين آذيتهم. قم بإعداد قائمة، وكن مستعدًا في قلبك لإصلاح الأمور مع كل واحد، حتى لو كان ذلك في ذهنك في الوقت الحالي."
          },
          "relevance": {
            "en": "This step fosters responsibility and prepares for reconciliation. Creating a list of those harmed demonstrates accountability and willingness to heal past wounds, laying the groundwork for making amends.",
            "ar": "تعزز هذه الخطوة المسؤولية وتعد للمصالحة. إنشاء قائمة بالمتضررين يظهر المساءلة والاستعداد لشفاء جروح الماضي، مما يمهد الطريق لإصلاح الأخطاء."
          },
          "practical_suggestions": {
            "en": [
              "Brainstorm and list every person you believe you have harmed, directly or indirectly.",
              "Consider the nature of the harm you caused (financial, emotional, physical).",
              "Discuss this list with your sponsor to prepare for future amends."
            ],
            "ar": [
              "فكر واعدد قائمة بكل شخص تعتقد أنك آذيته، بشكل مباشر أو غير مباشر.",
              "ضع في اعتبارك طبيعة الضرر الذي سببته (مالي، عاطفي، جسدي).",
              "ناقش هذه القائمة مع مرشدك لإعداد لإصلاح الأخطاء في المستقبل."
            ]
          }
        },
        {
          "id": "alcohol_step_9",
          "step_number": 9,
          "description": {
            "en": "Made direct amends to such people wherever possible, except when to do so would injure them or others. You’ve made your list and are ready. Now, actually reach out to those you’ve harmed and make things right. But be smart—if making amends would cause more harm, then don’t do it. Compassion comes first.",
            "ar": "قمنا بإصلاح أخطائنا مباشرة مع هؤلاء الأشخاص كلما أمكن ذلك، إلا إذا كان من شأن ذلك أن يؤذيهم أو يؤذي الآخرين. لقد أعددت قائمتك وأنت مستعد. الآن، تواصل فعليًا مع من آذيته وأصلح الأمور. لكن كن ذكيًا—إذا كان إصلاح الأخطاء سيسبب المزيد من الضرر، فلا تفعل ذلك. الرحمة تأتي أولاً."
          },
          "relevance": {
            "en": "This step facilitates healing and reconciliation. Making direct amends, when appropriate, allows individuals to take responsibility for past actions, repair relationships, and find inner peace, while also considering the well-being of others.",
            "ar": "تسهل هذه الخطوة الشفاء والمصالحة. إصلاح الأخطاء بشكل مباشر، عند الاقتضاء، يسمح للأفراد بتحمل المسؤولية عن الأفعال الماضية، وإصلاح العلاقات، وإيجاد السلام الداخلي، مع مراعاة رفاهية الآخرين أيضًا."
          },
          "practical_suggestions": {
            "en": [
              "Plan your amends carefully with your sponsor, considering the best approach for each person.",
              "Be sincere and specific in your apologies, without making excuses.",
              "Accept that some people may not be ready to accept your amends, and respect their boundaries."
            ],
            "ar": [
              "خطط لإصلاح أخطائك بعناية مع مرشدك، مع الأخذ في الاعتبار أفضل نهج لكل شخص.",
              "كن صادقًا ومحددًا في اعتذاراتك، دون اختلاق أعذار.",
              "اقبل أن بعض الأشخاص قد لا يكونوا مستعدين لقبول إصلاحاتك، واحترم حدودهم."
            ]
          }
        },
        {
          "id": "alcohol_step_10",
          "step_number": 10,
          "description": {
            "en": "Continued to take personal inventory and when we were wrong promptly admitted it. Recovery is an ongoing journey. Keep checking in with yourself. If you mess up, admit it quickly and fix it. This isn’t a one-time thing; it’s about living a life of honesty and continuous growth.",
            "ar": "واصلنا القيام بجرد شخصي، وعندما أخطأنا اعترفنا بذلك على الفور. التعافي رحلة مستمرة. استمر في فحص نفسك. إذا أخطأت، اعترف بذلك بسرعة وأصلحه. هذا ليس شيئًا لمرة واحدة؛ إنه يتعلق بالعيش حياة من الصدق والنمو المستمر."
          },
          "relevance": {
            "en": "This step emphasizes ongoing self-awareness and integrity. Regularly taking personal inventory and promptly admitting wrongs helps individuals maintain sobriety, prevent relapse, and continue personal development beyond the initial stages of recovery.",
            "ar": "تؤكد هذه الخطوة على الوعي الذاتي المستمر والنزاهة. يساعد الجرد الشخصي المنتظم والاعتراف الفوري بالأخطاء الأفراد على الحفاظ على الرصانة، ومنع الانتكاس، ومواصلة التطور الشخصي بعد المراحل الأولية للتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Engage in daily self-reflection or journaling to monitor your thoughts and actions.",
              "Be quick to admit mistakes and make amends as soon as you realize you've erred.",
              "Seek feedback from your sponsor or trusted friends about your behavior."
            ],
            "ar": [
              "انخرط في التأمل الذاتي اليومي أو تدوين اليوميات لمراقبة أفكارك وأفعالك.",
              "كن سريعًا في الاعتراف بالأخطاء وإصلاحها بمجرد أن تدرك أنك أخطأت.",
              "اطلب الملاحظات من مرشدك أو أصدقائك الموثوق بهم حول سلوكك."
            ]
          }
        },
        {
          "id": "alcohol_step_11",
          "step_number": 11,
          "description": {
            "en": "Sought through prayer and meditation to improve our conscious contact with God as we understood Him, praying only for knowledge of His will for us and the power to carry that out. You’ve come a long way. Now, deepen your spiritual connection. Through prayer and meditation, seek guidance, not just for what you want, but for what your Higher Power wants for you, and for the strength to follow that path.",
            "ar": "سعينا من خلال الصلاة والتأمل لتحسين اتصالنا الواعي بالله كما فهمناه، ونصلي فقط لمعرفة إرادته لنا والقوة لتنفيذ ذلك. لقد قطعت شوطًا طويلاً. الآن، عمّق اتصالك الروحي. من خلال الصلاة والتأمل، اطلب التوجيه، ليس فقط لما تريده، ولكن لما يريده لك قوتك العليا، والقوة لاتباع هذا الطريق."
          },
          "relevance": {
            "en": "This step fosters spiritual growth and inner peace. Regular prayer and meditation strengthen one's conscious connection with a Higher Power, providing guidance, serenity, and the strength to live in accordance with spiritual principles.",
            "ar": "تعزز هذه الخطوة النمو الروحي والسلام الداخلي. الصلاة والتأمل المنتظمان يقويان اتصال الفرد الواعي بقوة عليا، مما يوفر التوجيه والسكينة والقوة للعيش وفقًا للمبادئ الروحية."
          },
          "practical_suggestions": {
            "en": [
              "Establish a daily routine for prayer and meditation.",
              "Focus your prayers on seeking guidance and understanding, rather than specific outcomes.",
              "Explore different meditation techniques to find what resonates with you."
            ],
            "ar": [
              "ضع روتينًا يوميًا للصلاة والتأمل.",
              "ركز صلواتك على طلب التوجيه والفهم، بدلاً من النتائج المحددة.",
              "استكشف تقنيات التأمل المختلفة لتجد ما يناسبك."
            ]
          }
        },
        {
          "id": "alcohol_step_12",
          "step_number": 12,
          "description": {
            "en": "Having had a spiritual awakening as the result of these steps, we tried to carry this message to alcoholics, and to practice these principles in all our affairs. You’ve found sobriety and peace. Now, share your experience, strength, and hope with others still struggling. Live these principles—honesty, humility, service—in every part of your life, making recovery a way of being.",
            "ar": "بعد أن اختبرنا صحوة روحية نتيجة هذه الخطوات، حاولنا نقل هذه الرسالة لمدمني الكحول، وممارسة هذه المبادئ في كل شؤوننا. لقد وجدت الرصانة والسلام. الآن، شارك تجربتك وقوتك وأملك مع الآخرين الذين ما زالوا يكافحون. عش هذه المبادئ—الصدق، التواضع، الخدمة—في كل جزء من حياتك، مما يجعل التعافي طريقة حياة."
          },
          "relevance": {
            "en": "This step signifies a commitment to service and ongoing spiritual growth. Sharing one's recovery journey and practicing spiritual principles reinforces sobriety, fosters empathy, and contributes to the well-being of the wider community.",
            "ar": "تعتبر هذه الخطوة التزامًا بالخدمة والنمو الروحي المستمر. مشاركة رحلة التعافي وممارسة المبادئ الروحية يعزز الرصانة، وينمي التعاطف، ويساهم في رفاهية المجتمع الأوسع."
          },
          "practical_suggestions": {
            "en": [
              "Become a sponsor for a newcomer in recovery.",
              "Volunteer at a recovery-related organization or community group.",
              "Apply the principles of honesty, integrity, and compassion in all your daily interactions and decisions."
            ],
            "ar": [
              "كن مرشدًا لشخص جديد في التعافي.",
              "تطوع في منظمة أو مجموعة مجتمعية ذات صلة بالتعافي.",
              "طبق مبادئ الصدق والنزاهة والرحمة في جميع تفاعلاتك وقراراتك اليومية."
            ]
          }
        }
      ]
    },
    {
      "id": "anger_management",
      "name": {
        "en": "Anger Management",
        "ar": "إدارة الغضب"
      },
      "steps": [
        {
          "id": "anger_step_1",
          "step_number": 1,
          "description": {
            "en": "We admitted we were powerless over our anger—that our lives had become unmanageable. It’s hard to face, but your anger has taken over. It’s affecting your relationships, your peace of mind, and how you live. Admitting you can’t control it is the first brave step to taking back your life.",
            "ar": "اعترفنا بأننا عاجزون عن التحكم في غضبنا—وأن حياتنا أصبحت غير قابلة للإدارة. من الصعب مواجهة ذلك، لكن غضبك سيطر عليك. إنه يؤثر على علاقاتك، وراحتك النفسية، وكيف تعيش. الاعتراف بأنك لا تستطيع التحكم فيه هو أول خطوة شجاعة لاستعادة حياتك."
          },
          "relevance": {
            "en": "Recognizing powerlessness is crucial for anger management. It breaks the cycle of denial and opens the door to seeking effective strategies and support for controlling anger.",
            "ar": "الاعتراف بالعجز أمر بالغ الأهمية لإدارة الغضب. إنه يكسر حلقة الإنكار ويفتح الباب لطلب استراتيجيات ودعم فعال للتحكم في الغضب."
          },
          "practical_suggestions": {
            "en": [
              "Identify specific situations or triggers that lead to uncontrollable anger.",
              "Journal about past incidents where your anger became unmanageable and its consequences.",
              "Talk to a therapist or counselor specializing in anger management."
            ],
            "ar": [
              "حدد المواقف أو المحفزات المحددة التي تؤدي إلى الغضب الذي لا يمكن السيطرة عليه.",
              "دوّن في دفتر يومياتك عن الحوادث الماضية حيث أصبح غضبك لا يمكن السيطرة عليه وعواقبه.",
              "تحدث مع معالج أو مستشار متخصص في إدارة الغضب."
            ]
          }
        },
        {
          "id": "anger_step_2",
          "step_number": 2,
          "description": {
            "en": "Came to believe that a Power greater than ourselves could restore us to sanity. You’ve seen how anger warps your judgment. Now, believe that there’s a force—whether it’s inner strength, spiritual guidance, or the wisdom of others—that can bring you back to clarity and calm.",
            "ar": "جئنا لنؤمن بأن قوة أعظم منا يمكن أن تعيدنا إلى رشدنا. لقد رأيت كيف يشوه الغضب حكمك. الآن، آمن بأن هناك قوة—سواء كانت قوة داخلية، أو توجيهًا روحيًا، أو حكمة الآخرين—يمكن أن تعيدك إلى الوضوح والهدوء."
          },
          "relevance": {
            "en": "This step fosters hope and resilience. Believing in a 'Higher Power' (which can be a spiritual concept, inner strength, or a support community) provides a source of strength and optimism to navigate the challenges of anger management.",
            "ar": "تعزز هذه الخطوة الأمل والمرونة. الإيمان بـ 'قوة عليا' (يمكن أن تكون مفهومًا روحيًا، أو قوة داخلية، أو مجتمع دعم) يوفر مصدرًا للقوة والتفاؤل لمواجهة تحديات إدارة الغضب."
          },
          "practical_suggestions": {
            "en": [
              "Explore different spiritual or philosophical perspectives that offer guidance on emotional control.",
              "Engage in mindfulness or meditation practices to cultivate inner peace.",
              "Connect with a support group or mentor who has successfully managed their anger."
            ],
            "ar": [
              "استكشف وجهات نظر روحية أو فلسفية مختلفة تقدم إرشادًا حول التحكم العاطفي.",
              "انخرط في ممارسات اليقظة الذهنية أو التأمل لتنمية السلام الداخلي.",
              "تواصل مع مجموعة دعم أو مرشد نجح في إدارة غضبه."
            ]
          }
        },
        {
          "id": "anger_step_3",
          "step_number": 3,
          "description": {
            "en": "Made a decision to turn our will and our lives over to the care of Allah as we understood Him. You’re starting to trust in a greater power. Now, make the conscious decision to surrender your will, letting go of the need to control every situation with anger, and trusting Allah's guidance to lead you to inner peace.",
            "ar": "اتخذنا قرارًا بتحويل إرادتنا وحياتنا إلى رعاية الله كما فهمناه. لقد بدأت تثق في قوة أعظم. الآن، اتخذ القرار الواعي لتسليم إرادتك، والتخلي عن الحاجة إلى التحكم في كل موقف بالغضب، والثقة في توجيه الله ليقودك إلى السلام الداخلي."
          },
          "relevance": {
            "en": "This step involves surrender and trust. By choosing to submit one's will to a Higher Power, individuals release the burden of trying to control anger independently and open themselves to spiritual guidance and inner calm.",
            "ar": "تتضمن هذه الخطوة الاستسلام والثقة. باختيار الخضوع لإرادة قوة عليا، يحرر الأفراد عبء محاولة التحكم في الغضب بشكل مستقل ويفتحون أنفسهم للتوجيه الروحي والهدوء الداخلي."
          },
          "practical_suggestions": {
            "en": [
              "Practice daily prayers or supplications (Dua) asking for guidance in managing your anger.",
              "Reflect on situations where trying to control everything with anger led to negative outcomes.",
              "Focus on letting go of grudges and resentments, trusting in a larger plan."
            ],
            "ar": [
              "مارس الصلوات أو الأدعية اليومية طالبًا التوجيه في إدارة غضبك.",
              "تأمل في المواقف التي أدت فيها محاولة التحكم في كل شيء بالغضب إلى نتائج سلبية.",
              "ركز على التخلي عن الضغائن والاستياءات، واثقًا في خطة أكبر."
            ]
          }
        },
        {
          "id": "anger_step_4",
          "step_number": 4,
          "description": {
            "en": "Made a searching and fearless moral inventory of ourselves. This is about deep self-reflection. What triggers your anger? What are your character defects that contribute to it—pride, fear, control? Be honest, not judgmental. Understanding these roots is key to change.",
            "ar": "قمنا بجرد أخلاقي صادق وشجاع لأنفسنا. هذا يتعلق بالتأمل العميق للذات. ما الذي يحفز غضبك؟ ما هي عيوب شخصيتك التي تساهم في ذلك—الكبرياء، الخوف، السيطرة؟ كن صادقًا، لا حكميًا. فهم هذه الجذور هو مفتاح التغيير."
          },
          "relevance": {
            "en": "This step promotes self-awareness and accountability. A thorough inventory helps individuals identify the underlying causes and patterns of their anger, including character defects and triggers, which is essential for developing effective coping strategies.",
            "ar": "تعزز هذه الخطوة الوعي الذاتي والمساءلة. يساعد الجرد الشامل الأفراد على تحديد الأسباب الكامنة وأنماط غضبهم، بما في ذلك عيوب الشخصية والمحفزات، وهو أمر ضروري لتطوير استراتيجيات فعالة للتعامل."
          },
          "practical_suggestions": {
            "en": [
              "Keep an 'anger journal' to track triggers, reactions, and the consequences of your anger.",
              "Identify specific character traits (e.g., impatience, perfectionism) that might fuel your anger.",
              "Discuss your inventory with a trusted therapist or spiritual guide for insights."
            ],
            "ar": [
              "احتفظ بـ 'يوميات الغضب' لتتبع المحفزات وردود الفعل وعواقب غضبك.",
              "حدد سمات شخصية محددة (مثل عدم الصبر، الكمالية) التي قد تغذي غضبك.",
              "ناقش جردك مع معالج موثوق به أو مرشد روحي للحصول على رؤى."
            ]
          }
        },
        {
          "id": "anger_step_5",
          "step_number": 5,
          "description": {
            "en": "Admitted to Allah, to ourselves, and to another human being the exact nature of our wrongs. You’ve honestly looked at your anger. Now, share that truth. Confessing your anger issues and the harm they’ve caused to Allah, yourself, and a trusted person is a powerful step towards healing and freedom from shame.",
            "ar": "اعترفنا لله، ولأنفسنا، ولإنسان آخر بالطبيعة الدقيقة لأخطائنا. لقد نظرت بصدق إلى غضبك. الآن، شارك تلك الحقيقة. الاعتراف بمشاكل الغضب والأذى الذي سببته لله، ولنفسك، ولشخص موثوق به هو خطوة قوية نحو الشفاء والتحرر من العار."
          },
          "relevance": {
            "en": "This step builds humility and breaks isolation. Openly admitting the nature of one's anger and its consequences to a trusted individual (and a Higher Power) facilitates emotional release, reduces shame, and strengthens commitment to change.",
            "ar": "تبني هذه الخطوة التواضع وتكسر العزلة. الاعتراف الصريح بطبيعة غضب الفرد وعواقبه لشخص موثوق به (وقوة عليا) يسهل التحرر العاطفي، ويقلل من الخزي، ويعزز الالتزام بالتغيير."
          },
          "practical_suggestions": {
            "en": [
              "Choose a supportive and confidential person (e.g., therapist, spiritual leader, trusted friend) to share your anger inventory.",
              "Practice open and honest communication, without minimizing or justifying your past actions.",
              "Reflect on the sense of relief and liberation that comes with this confession."
            ],
            "ar": [
              "اختر شخصًا داعمًا وسريًا (على سبيل المثال، معالج، قائد روحي، صديق موثوق به) لمشاركة جرد غضبك.",
              "مارس التواصل الصريح والصادق، دون التقليل من شأن أفعالك الماضية أو تبريرها.",
              "تأمل في الشعور بالراحة والتحرر الذي يأتي مع هذا الاعتراف."
            ]
          }
        },
        {
          "id": "anger_step_6",
          "step_number": 6,
          "description": {
            "en": "Were entirely ready to have Allah remove all these defects of character. You’ve identified your anger-driven flaws. Now, cultivate a deep willingness to let go of them completely. This isn’t about immediate perfection, but about being truly open to Allah's help in transforming these aspects of your character.",
            "ar": "كنا مستعدين تمامًا لأن يزيل الله كل هذه العيوب في الشخصية. لقد حددت عيوبك التي يغذيها الغضب. الآن، نمِّ رغبة عميقة في التخلي عنها تمامًا. هذا لا يتعلق بالكمال الفوري، بل يتعلق بالانفتاح الحقيقي على مساعدة الله في تحويل هذه الجوانب من شخصيتك."
          },
          "relevance": {
            "en": "This step emphasizes willingness and readiness for change. Being entirely ready to have character defects (related to anger) removed demonstrates a profound commitment to spiritual and emotional growth, relying on a Higher Power for transformation.",
            "ar": "تؤكد هذه الخطوة على الاستعداد والجاهزية للتغيير. أن تكون مستعدًا تمامًا لإزالة عيوب الشخصية (المتعلقة بالغضب) يظهر التزامًا عميقًا بالنمو الروحي والعاطفي، معتمدًا على قوة عليا للتحول."
          },
          "practical_suggestions": {
            "en": [
              "Make a conscious decision daily to surrender your anger-related character defects to Allah.",
              "Engage in prayers that express your readiness for transformation.",
              "Visualize yourself responding to triggers with calmness and patience, rather than anger."
            ],
            "ar": [
              "اتخذ قرارًا واعيًا يوميًا بتسليم عيوب شخصيتك المتعلقة بالغضب إلى الله.",
              "انخرط في صلوات تعبر عن استعدادك للتحول.",
              "تخيل نفسك تستجيب للمحفزات بهدوء وصبر، بدلاً من الغضب."
            ]
          }
        },
        {
          "id": "anger_step_7",
          "step_number": 7,
          "description": {
            "en": "Humbly asked Him to remove our shortcomings. You’ve found the willingness. Now, with deep humility, ask Allah to remove the specific character defects that fuel your anger. This isn’t a passive request; it’s an active spiritual surrender, inviting divine intervention into your emotional life.",
            "ar": "طلبنا منه بتواضع أن يزيل عيوبنا. لقد وجدت الاستعداد. الآن، بتواضع عميق، اطلب من الله أن يزيل عيوب الشخصية المحددة التي تغذي غضبك. هذا ليس طلبًا سلبيًا؛ إنه استسلام روحي نشط، يدعو التدخل الإلهي إلى حياتك العاطفية."
          },
          "relevance": {
            "en": "This step fosters humility and spiritual dependence. Humbly asking a Higher Power to remove shortcomings related to anger signifies a deeper level of trust and a recognition that true change often requires spiritual assistance.",
            "ar": "تعزز هذه الخطوة التواضع والاعتماد الروحي. طلب إزالة العيوب المتعلقة بالغضب بتواضع من قوة عليا يدل على مستوى أعمق من الثقة والاعتراف بأن التغيير الحقيقي غالبًا ما يتطلب مساعدة روحية."
          },
          "practical_suggestions": {
            "en": [
              "Formulate specific prayers or supplications for the removal of pride, impatience, or other anger-related defects.",
              "Practice humility in your daily interactions, acknowledging your limitations and seeking guidance.",
              "Focus on actions that demonstrate humility, such as actively listening to others and admitting when you are wrong."
            ],
            "ar": [
              "صغ صلوات أو أدعية محددة لإزالة الكبرياء، عدم الصبر، أو غيرها من العيوب المتعلقة بالغضب.",
              "مارس التواضع في تفاعلاتك اليومية، معترفًا بحدودك وطالبًا التوجيه.",
              "ركز على الأفعال التي تدل على التواضع، مثل الاستماع النشط للآخرين والاعتراف عندما تكون مخطئًا."
            ]
          }
        },
        {
          "id": "anger_step_8",
          "step_number": 8,
          "description": {
            "en": "Made a list of all persons we had harmed, and became willing to make amends to them all. Your anger has likely hurt others. Now, reflect deeply and list everyone you’ve caused harm to, directly or indirectly. Cultivate a genuine willingness to make things right with each person on that list.",
            "ar": "أعددنا قائمة بجميع الأشخاص الذين آذيناهم، وأصبحنا مستعدين لإصلاح أخطائنا معهم جميعًا. من المرجح أن غضبك قد آذى الآخرين. الآن، تأمل بعمق وقم بإدراج كل شخص ألحقت به ضررًا، بشكل مباشر أو غير مباشر. نمِّ رغبة حقيقية في تصحيح الأمور مع كل شخص في تلك القائمة."
          },
          "relevance": {
            "en": "This step cultivates responsibility and prepares for reconciliation. Creating a comprehensive list of those harmed by one's anger demonstrates accountability and a crucial willingness to heal broken relationships.",
            "ar": "تعزز هذه الخطوة المسؤولية وتعد للمصالحة. إنشاء قائمة شاملة بالمتضررين من غضب الفرد يظهر المساءلة ورغبة حاسمة في شفاء العلاقات المتضررة."
          },
          "practical_suggestions": {
            "en": [
              "Take time to remember all instances where your anger caused harm, no matter how small.",
              "Consider the emotional, verbal, or physical harm you may have inflicted.",
              "Discuss this list with a trusted mentor or therapist to prepare for future amends."
            ],
            "ar": [
              "خذ وقتًا لتذكر جميع الحالات التي تسبب فيها غضبك ضررًا، مهما كانت صغيرة.",
              "ضع في اعتبارك الضرر العاطفي أو اللفظي أو الجسدي الذي ربما تكون قد ألحقته.",
              "ناقش هذه القائمة مع مرشد موثوق به أو معالج لإعداد لإصلاح الأخطاء في المستقبل."
            ]
          }
        },
        {
          "id": "anger_step_9",
          "step_number": 9,
          "description": {
            "en": "Made direct amends to such people wherever possible, except when to do so would injure them or others. You’ve identified those you’ve wronged and are willing to make amends. Now, bravely approach them. Offer sincere apologies and make amends where appropriate, always ensuring your actions do not cause further harm.",
            "ar": "قمنا بإصلاح أخطائنا مباشرة مع هؤلاء الأشخاص كلما أمكن ذلك، إلا إذا كان من شأن ذلك أن يؤذيهم أو يؤذي الآخرين. لقد حددت من ظلمته وأنت مستعد لإصلاح الأخطاء. الآن، اقترب منهم بشجاعة. قدم اعتذارات صادقة وأصلح الأخطاء عند الاقتضاء، مع التأكد دائمًا من أن أفعالك لا تسبب المزيد من الضرر."
          },
          "relevance": {
            "en": "This step facilitates healing and reconciliation. Making direct amends for anger-driven harm allows individuals to take responsibility, repair damaged relationships, and find inner peace, while also prioritizing the well-being and safety of others.",
            "ar": "تسهل هذه الخطوة الشفاء والمصالحة. إصلاح الأخطاء بشكل مباشر عن الضرر الناجم عن الغضب يسمح للأفراد بتحمل المسؤولية، وإصلاح العلاقات المتضررة، وإيجاد السلام الداخلي، مع إعطاء الأولوية لرفاهية وسلامة الآخرين."
          },
          "practical_suggestions": {
            "en": [
              "Plan your amends carefully, considering the best time, place, and words for each person.",
              "Focus on expressing genuine remorse and taking responsibility for your actions.",
              "Be prepared for different reactions and respect if someone is not ready to accept your amends."
            ],
            "ar": [
              "خطط لإصلاح أخطائك بعناية، مع الأخذ في الاعتبار أفضل وقت ومكان وكلمات لكل شخص.",
              "ركز على التعبير عن الندم الصادق وتحمل المسؤولية عن أفعالك.",
              "كن مستعدًا لردود فعل مختلفة واحترم إذا كان شخص ما غير مستعد لقبول إصلاحاتك."
            ]
          }
        },
        {
          "id": "anger_step_10",
          "step_number": 10,
          "description": {
            "en": "Continued to take personal inventory and when we were wrong promptly admitted it. Managing anger is a lifelong practice. Regularly check your actions and reactions. When you slip, acknowledge it immediately, reflect, and take corrective action. This ensures continuous growth and prevents old patterns from resurfacing.",
            "ar": "واصلنا القيام بجرد شخصي، وعندما أخطأنا اعترفنا بذلك على الفور. إدارة الغضب ممارسة تستمر مدى الحياة. تحقق بانتظام من أفعالك وردود أفعالك. عندما تخطئ، اعترف بذلك على الفور، وتأمل، واتخذ إجراءً تصحيحيًا. هذا يضمن النمو المستمر ويمنع الأنماط القديمة من الظهور مرة أخرى."
          },
          "relevance": {
            "en": "This step emphasizes ongoing self-awareness and accountability for anger management. Regular personal inventory and prompt admission of wrongs help individuals maintain emotional balance, prevent relapses into uncontrolled anger, and foster continuous personal development.",
            "ar": "تؤكد هذه الخطوة على الوعي الذاتي المستمر والنزاهة. يساعد الجرد الشخصي المنتظم والاعتراف الفوري بالأخطاء الأفراد على الحفاظ على التوازن العاطفي، ومنع الانتكاسات في الغضب غير المنضبط، وتعزيز التطور الشخصي المستمر."
          },
          "practical_suggestions": {
            "en": [
              "Dedicate a few minutes daily to reflect on your interactions and emotional responses.",
              "When you feel anger rising, pause and practice self-awareness to understand the trigger.",
              "If you react with anger, admit it to yourself and a trusted person, and plan how to handle it better next time."
            ],
            "ar": [
              "خصص بضع دقائق يوميًا للتأمل في تفاعلاتك واستجاباتك العاطفية.",
              "عندما تشعر بارتفاع الغضب، توقف مؤقتًا ومارس الوعي الذاتي لفهم المحفز.",
              "إذا تفاعلت بالغضب، اعترف بذلك لنفسك ولشخص موثوق به، وخطط لكيفية التعامل معه بشكل أفضل في المرة القادمة."
            ]
          }
        },
        {
          "id": "anger_step_11",
          "step_number": 11,
          "description": {
            "en": "Sought through prayer and meditation to improve our conscious contact with Allah as we understood Him, praying only for knowledge of His will for us and the power to carry that out. Deepen your spiritual connection. Through prayer and meditation, seek Allah’s guidance not just for what you desire, but for His will concerning your anger and for the strength to follow that divine path, cultivating patience and peace.",
            "ar": "سعينا من خلال الصلاة والتأمل لتحسين اتصالنا الواعي بالله كما فهمناه، ونصلي فقط لمعرفة إرادته لنا والقوة لتنفيذ ذلك. عمِّق اتصالك الروحي. من خلال الصلاة والتأمل، اطلب توجيه الله ليس فقط لما ترغب فيه، ولكن لإرادته فيما يتعلق بغضبك وللقوة لاتباع هذا المسار الإلهي، زارعًا الصبر والسلام."
          },
          "relevance": {
            "en": "This step fosters continuous spiritual growth and emotional regulation. Regular prayer and meditation strengthen one's conscious connection with a Higher Power, providing inner peace, wisdom, and the strength to respond to challenges with patience and understanding, rather than anger.",
            "ar": "تعزز هذه الخطوة النمو الروحي المستمر والتنظيم العاطفي. الصلاة والتأمل المنتظمان يقويان اتصال الفرد الواعي بقوة عليا، مما يوفر السلام الداخلي والحكمة والقوة للاستجابة للتحديات بالصبر والتفهم، بدلاً من الغضب."
          },
          "practical_suggestions": {
            "en": [
              "Integrate daily prayers and spiritual readings that focus on patience, forgiveness, and self-control.",
              "Practice mindfulness meditation to observe angry thoughts without reacting to them.",
              "Seek spiritual guidance from religious scholars or trusted spiritual mentors."
            ],
            "ar": [
              "ادمج الصلوات اليومية والقراءات الروحية التي تركز على الصبر، والغفران، والتحكم الذاتي.",
              "مارس تأمل اليقظة لملاحظة الأفكار الغاضبة دون الاستجابة لها.",
              "اطلب الإرشاد الروحي من العلماء الدينيين أو المرشدين الروحيين الموثوق بهم."
            ]
          }
        },
        {
          "id": "anger_step_12",
          "step_number": 12,
          "description": {
            "en": "Having had a spiritual awakening as the result of these steps, we tried to carry this message to others struggling with anger or aggression, and to practice these principles in all our affairs. You’ve found calm with Allah’s help. Now, share your story and live these principles every day. Help others find their peace and continue to practice patience, humility, and compassion in all aspects of your life.",
            "ar": "بعد أن اختبرنا صحوة روحية نتيجة هذه الخطوات، حاولنا نقل هذه الرسالة لغيرنا من اللي بيعانوا مع الغضب أو العدوانية، وممارسة هذه المبادئ في كل شؤوننا. إنت لقيت هدوء بمساعدة الله. دلوقتي، شارك قصتك وعيش المبادئ دي كل يوم. ساعد الآخرين يلاقوا سلامهم واستمر في ممارسة الصبر والتواضع والرحمة في كل جوانب حياتك."
          },
          "relevance": {
            "en": "This step is about helping others with anger issues and living a life guided by Allah’s principles to stay calm and peaceful. It reinforces one's own recovery by fostering empathy, service, and the continued application of spiritual principles in daily life.",
            "ar": "الخطوة دي عن مساعدة الناس اللي عندهم مشاكل غضب وإنك تعيش حياة بتهديها مبادئ الله عشان تبقى هادي وسلام. تعزز هذه الخطوة تعافي الفرد من خلال تنمية التعاطف، والخدمة، والتطبيق المستمر للمبادئ الروحية في الحياة اليومية."
          },
          "practical_suggestions": {
            "en": [
              "Share your recovery story at a support group to inspire others.",
              "Volunteer to support newcomers in anger management programs or counseling.",
              "Apply these principles (patience, humility, self-control, compassion) in all areas of your life, from family to work."
            ],
            "ar": [
              "شارك قصة تعافيك في مجموعة دعم عشان تلهم غيرك.",
              "تطوع عشان تساعد الناس الجدد في برامج إدارة الغضب أو الاستشارات.",
              "طبق المبادئ دي (الصبر، التواضع، التحكم بالنفس، الرحمة) في كل نواحي حياتك، من العائلة للعمل."
            ]
          }
        }
      ]
    },
    {
      "id": "drug_addiction",
      "name": {
        "en": "Drug Addiction",
        "ar": "إدمان المخدرات"
      },
      "steps": [
        {
          "id": "drug_step_1",
          "step_number": 1,
          "description": {
            "en": "We admitted we were powerless over drugs—that our lives had become unmanageable. I know it’s scary to admit, but drugs are running your life. You’re losing control—your health, your relationships, your peace. Saying you’re powerless is the first step to taking back your life.",
            "ar": "اعترفنا بأننا عاجزون عن التحكم في المخدرات—وأن حياتنا أصبحت غير قابلة للإدارة. أعرف إنه مخيف تعترف، بس المخدرات بتدير حياتك. إنت بتفقد السيطرة—صحتك، علاقاتك، راحتك. لما تقول إنك عاجز، دي أول خطوة عشان ترجع حياتك."
          },
          "relevance": {
            "en": "Drug addiction makes you feel trapped. Admitting powerlessness breaks the denial and lets you start seeking help.",
            "ar": "إدمان المخدرات بيخليك تحس إنك محاصر. الاعتراف بالعجز بيكسر الإنكار ويخليك تبدأ تدور على مساعدة."
          },
          "practical_suggestions": {
            "en": [
              "Write a list of how drugs have impacted your life negatively.",
              "Attend a Narcotics Anonymous meeting to connect with others.",
              "Tell a trusted person about your struggle to begin breaking the secrecy."
            ],
            "ar": [
              "اكتب قايمة بإزاي المخدرات أثرت على حياتك بشكل سلبي.",
              "حضر اجتماع لمدمني المخدرات المجهولين عشان تتواصل مع ناس زيك.",
              "احكي لواحد تثق فيه عن معاناتك عشان تبدأ تكسر حاجز السرية."
            ]
          }
        },
        {
          "id": "drug_step_2",
          "step_number": 2,
          "description": {
            "en": "Came to believe that faith in Allah could restore us to sanity. You’ve tried to stop using drugs before, haven’t you? It’s tough alone. This step is about trusting Allah to guide you out of this mess and back to a clear mind.",
            "ar": "آمنا بأن الإيمان بالله يمكنه أن يعيدنا إلى التعقل. حاولت تبطل المخدرات قبل كده، مش كده؟ صعب لو لوحدك. الخطوة دي عن إنك تثق إن الله هيهديك يخرجك من الفوضى دي ويرجعك لعقلك السليم."
          },
          "relevance": {
            "en": "Drugs cloud your thinking and decisions. Believing in Allah’s guidance gives you hope to find clarity and strength.",
            "ar": "المخدرات بتشوش تفكيرك وقراراتك. الإيمان بهداية الله بيديك أمل إنك تلاقي الوضوح والقوة."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily to Allah for strength to resist drugs.",
              "Read spiritual texts like the Quran to find peace and motivation.",
              "Reflect on times when faith helped you through tough moments."
            ],
            "ar": [
              "صلي كل يوم لله عشان يديك القوة تقاوم المخدرات.",
              "اقرأ نصوص دينية زي القرآن عشان تلاقي سلام وتحفيز.",
              "فكر في أوقات الإيمان ساعدك فيها في لحظات صعبة."
            ]
          }
        },
        {
          "id": "drug_step_3",
          "step_number": 3,
          "description": {
            "en": "Made a decision to turn our will and our lives over to the care of Allah. This isn’t about giving up—it’s about trusting Allah’s plan for you. Let go of trying to control your drug use and let His wisdom guide you.",
            "ar": "اتخذنا قرارًا بأن نسلم إرادتنا وحياتنا لرعاية الله. مش معناها إنك بتستسلم—دي عن إنك تثق في خطة الله ليك. سيب محاولات التحكم في المخدرات وخلّي حكمة الله تهديك."
          },
          "relevance": {
            "en": "Drug addiction thrives on chaos and control. Surrendering to Allah’s will helps you release that control and find a better path.",
            "ar": "إدمان المخدرات بيعيش على الفوضى والتحكم. لما تسلم نفسك لمشيئة الله، ده بيساعدك تتخلى عن التحكم ده وتلاقي طريق أحسن."
          },
          "practical_suggestions": {
            "en": [
              "Pray to Allah each morning to guide your choices throughout the day.",
              "Write a commitment to follow Allah’s guidance in your recovery.",
              "Find a quiet space to reflect on submitting to Allah’s will."
            ],
            "ar": [
              "صلي لله كل صبح عشان يهدي اختياراتك طول اليوم.",
              "اكتب التزام إنك هتمشي ورا هداية الله في تعافيك.",
              "دور على مكان هادي تفكر فيه إنك تسلم نفسك لمشيئة الله."
            ]
          }
        },
        {
          "id": "drug_step_4",
          "step_number": 4,
          "description": {
            "en": "Made a searching and fearless moral inventory of ourselves. Be honest with yourself. Write down how drugs have hurt you and others—every lie, every broken trust. It’s tough, but facing it helps you see what needs to change.",
            "ar": "عملنا جردًا أخلاقيًا دقيقًا وشجاعًا لأنفسنا. كن صادق مع نفسك. اكتب إزاي المخدرات ضرتك و ضر الناس—كل كدبة، كل ثقة اتكسرت. صعب، بس لما تواجه ده، بيساعدك تعرف إيه لازم يتغير."
          },
          "relevance": {
            "en": "This step forces you to confront the damage caused by drug addiction, giving you clarity and motivation to change.",
            "ar": "الخطوة دي بتخليك تواجه الأذى اللي سببه إدمان المخدرات، وبتديك وضوح وتحفيز عشان تتغير."
          },
          "practical_suggestions": {
            "en": [
              "Keep a journal to list specific incidents caused by drug use.",
              "Ask a trusted friend to help you reflect on your actions.",
              "Organize your inventory by areas: health, family, finances."
            ],
            "ar": [
              "احتفظ بدفتر تكتب فيه المواقف المحددة اللي حصلت بسبب المخدرات.",
              "اطلب من صاحب تثق فيه يساعدك تفكر في تصرفاتك.",
              "نظم الجرد بتاعك حسب المجالات: الصحة، العيلة، المال."
            ]
          }
        },
        {
          "id": "drug_step_5",
          "step_number": 5,
          "description": {
            "en": "Admitted to Allah, to ourselves, and to another human being the exact nature of our wrongs. Open up to someone you trust. Share the mistakes you wrote down. Telling Allah and another person lifts the guilt and helps you heal.",
            "ar": "اعترفنا لله، ولأنفسنا، ولشخص آخر بالطبيعة الدقيقة لأخطائنا. افتح قلبك لواحد تثق فيه. شارك الأخطاء اللي كتبتها. لما تحكي لله ولواحد تاني، ده بيخفف الذنب ويساعدك تشفى."
          },
          "relevance": {
            "en": "Drug addiction feeds on secrecy. Sharing your wrongs with Allah and someone else builds honesty and accountability.",
            "ar": "إدمان المخدرات بيتغذى على الأسرار. لما تشارك أخطاءك مع الله ومع حد تاني، ده بيبني الصدق والمسؤولية."
          },
          "practical_suggestions": {
            "en": [
              "Choose a sponsor or trusted person to share your inventory with.",
              "Pray to Allah for courage before opening up.",
              "Practice your confession to ensure it’s honest and clear."
            ],
            "ar": [
              "اختار مرشد أو حد تثق فيه عشان تشارك معاه الجرد بتاعك.",
              "صلي لله عشان يديك الشجاعة قبل ما تتكلم.",
              "تدرب على الاعتراف بتاعك عشان يكون صادق وواضح."
            ]
          }
        },
        {
          "id": "drug_step_6",
          "step_number": 6,
          "description": {
            "en": "Were entirely ready to have Allah remove all these defects of character. Drugs have brought out things like dishonesty or selfishness in you. This step is about being ready to let Allah take those flaws away.",
            "ar": "كنا مستعدين تمامًا لأن يزيل الله كل عيوب شخصيتنا. المخدرات طلعت حاجات زي عدم الصدق أو الأنانية فيك. الخطوة دي عن إنك تكون مستعد تخلي الله يزيل العيوب دي."
          },
          "relevance": {
            "en": "Drug addiction amplifies negative traits. Being ready to let Allah remove them is essential for lasting recovery.",
            "ar": "إدمان المخدرات بيزود الصفات السلبية. لما تكون مستعد تخلي الله يزيلها، ده ضروري للتعافي الدائم."
          },
          "practical_suggestions": {
            "en": [
              "Reflect on which traits fuel your drug use and pray for their removal.",
              "Write how your life would be better without these flaws.",
              "Talk to a religious mentor about how faith can help you change."
            ],
            "ar": [
              "فكر في الصفات اللي بتغذي إدمانك وصلي عشان تتخلص منها.",
              "اكتب إزاي حياتك هتبقى أحسن من غير العيوب دي.",
              "كلم مرشد ديني عن إزاي الإيمان يقدر يساعدك تتغير."
            ]
          }
        },
        {
          "id": "drug_step_7",
          "step_number": 7,
          "description": {
            "en": "Humbly asked Allah to remove our shortcomings. Now, pray with sincerity. Ask Allah to take away the flaws that keep you tied to drugs. Trust that He can help you change.",
            "ar": "طلبنا من الله بتواضع أن يزيل عيوبنا. دلوقتي، صلي بصدق. اطلب من الله يزيل العيوب اللي بتربطك بالمخدرات. ثق إنه قادر يساعدك تتغير."
          },
          "relevance": {
            "en": "This step strengthens your reliance on Allah to transform the behaviors that fuel drug addiction, supporting your recovery.",
            "ar": "الخطوة دي بتقوي اعتمادك على الله عشان يغير السلوكيات اللي بتغذي إدمان المخدرات، وبتدعم تعافيك."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily for Allah to remove your flaws and give you strength.",
              "Keep a gratitude journal to focus on Allah’s blessings.",
              "Attend a mosque to feel connected to your faith community."
            ],
            "ar": [
              "صلي كل يوم عشان الله يزيل عيوبك ويديك القوة.",
              "احتفظ بدفتر شكر تركز فيه على نعم الله.",
              "روح المسجد عشان تحس بقربك من مجتمع الإيمان."
            ]
          }
        },
        {
          "id": "drug_step_8",
          "step_number": 8,
          "description": {
            "en": "Made a list of all persons we had harmed, and became willing to make amends to them all. Think about everyone you’ve hurt because of drugs—family, friends, or others. Write their names and get ready to make things right.",
            "ar": "عملنا قائمة بكل الأشخاص اللي أذيناهم، وأصبحنا مستعدين لتعويضهم جميعًا. فكر في كل الناس اللي ضريتهم بسبب المخدرات—عيلتك، أصحابك، أو غيرهم. اكتب أساميهم واستعد تصلح الأمور."
          },
          "relevance": {
            "en": "Drug addiction often destroys trust. This step helps you take responsibility and prepare to rebuild relationships.",
            "ar": "إدمان المخدرات غالبًا بيدمر الثقة. الخطوة دي بتساعدك تتحمل المسؤولية وتستعد تبني العلاقات من جديد."
          },
          "practical_suggestions": {
            "en": [
              "List specific people you’ve wronged and what you did to them.",
              "Reflect on how your actions hurt them to build empathy.",
              "Discuss your list with a sponsor to plan your amends."
            ],
            "ar": [
              "اكتب قايمة بالناس اللي ظلمتهم وإنت عملتلهم إيه.",
              "فكر إزاي تصرفاتك ضرتهم عشان تبني تعاطف.",
              "ناقش القايمة مع مرشد عشان تخطط لتعويضاتك."
            ]
          }
        },
        {
          "id": "drug_step_9",
          "step_number": 9,
          "description": {
            "en": "Made direct amends to such people wherever possible, except when to do so would injure them or others. Go to those people and apologize sincerely. Fix what you can, but don’t cause more harm in the process.",
            "ar": "قدمنا تعويضات مباشرة لهؤلاء الأشخاص حيثما أمكن، إلا إذا كان ذلك سيؤذيهم أو غيرهم. روح للناس دي واعتذر بصدق. صلح اللي تقدر عليه، بس خلي بالك ما تسببش ضرر زيادة."
          },
          "relevance": {
            "en": "Making amends helps repair the damage caused by drug addiction and clears your conscience for recovery.",
            "ar": "الخطوة دي بتصلح الأذى اللي سببه إدمان المخدرات وبتنضف ضميرك عشان التعافي."
          },
          "practical_suggestions": {
            "en": [
              "Plan your apologies with sincerity and accountability in mind.",
              "Start with small amends to build confidence, like apologizing to a friend.",
              "Seek guidance from a mentor on sensitive amends."
            ],
            "ar": [
              "خطط لاعتذاراتك وخليك صادق ومسؤول.",
              "ابدأ بتعويضات صغيرة عشان تبني ثقتك، زي الاعتذار لصاحب.",
              "اطلب نصيحة من مرشد عن التعويضات الحساسة."
            ]
          }
        },
        {
          "id": "drug_step_10",
          "step_number": 10,
          "description": {
            "en": "Continued to take personal inventory and when we were wrong promptly admitted it. Check yourself every day. If you make a mistake, own it right away. This keeps you honest and on track.",
            "ar": "واصلنا جرد أنفسنا الشخصي، وعندما كنا مخطئين اعترفنا بذلك فورًا. راجع نفسك كل يوم. لو أخطأت، اعترف بالغلط على طول. ده بيخليك صادق ومستمر على الطريق الصح."
          },
          "relevance": {
            "en": "Drug addiction can return if you’re not vigilant. This step keeps you aware of your actions and helps you stay accountable.",
            "ar": "إدمان المخدرات ممكن يرجع لو مش واخد بالك. الخطوة دي بتحافظ على وعيك بتصرفاتك وبتساعدك تكون مسؤول."
          },
          "practical_suggestions": {
            "en": [
              "Set a daily time to reflect on your actions and choices.",
              "Track triggers that tempt you to use drugs in a journal.",
              "Practice quick apologies for small mistakes to build honesty."
            ],
            "ar": [
              "حدد وقت يومي عشان تراجع تصرفاتك وقراراتك.",
              "تابع المحفزات اللي بتغريك بالمخدرات في دفتر.",
              "تدرب على الاعتذار السريع عن الأخطاء الصغيرة عشان تبني الصدق."
            ]
          }
        },
        {
          "id": "drug_step_11",
          "step_number": 11,
          "description": {
            "en": "Sought through prayer and meditation to improve our conscious contact with Allah, praying only for knowledge of His will for us and the power to carry that out. Pray and reflect daily to stay close to Allah. Ask Him to guide you to stay drug-free.",
            "ar": "سعينا من خلال الصلاة والتأمل لتحسين اتصالنا الواعي بالله، داعين فقط لمعرفة مشيئته لنا والقوة لتنفيذها. صلي وفكر كل يوم عشان تبقى قريب من الله. اطلب منه يهديك عشان تفضل بعيد عن المخدرات."
          },
          "relevance": {
            "en": "This step strengthens your faith in Allah, helping you resist drug cravings and stay committed to recovery.",
            "ar": "الخطوة دي بتقوي إيمانك بالله، وبتساعدك تقاوم رغبتك في المخدرات وتفضل ملتزم بالتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Pray five times daily biztos your connection with Allah.",
              "Practice quiet reflection to focus on Allah’s guidance.",
              "Join a religious study group to deepen your faith."
            ],
            "ar": [
              "صلي خمس مرات يوميًا عشان تحافظ على اتصالك بالله.",
              "مارس التفكير الهادي عشان تركز على هداية الله.",
              "انضم لمجموعة دراسة دينية عشان تعمق إيمانك."
            ]
          }
        },
        {
          "id": "drug_step_12",
          "step_number": 12,
          "description": {
            "en": "Having had a spiritual awakening as the result of these steps, we tried to carry this message to others struggling with drugs, and to practice these principles in all our affairs. You’ve changed with Allah’s help. Now, share your story with others and live these principles daily.",
            "ar": "بعد أن اختبرنا صحوة روحية نتيجة هذه الخطوات، حاولنا نقل هذه الرسالة لغيرنا من مدمني المخدرات، وممارسة هذه المبادئ في كل شؤوننا. إنت اتغيرت بمساعدة الله. دلوقتي، شارك قصتك مع غيرك وعيش المبادئ دي كل يوم."
          },
          "relevance": {
            "en": "This step is about helping others with drug addiction and living a life guided by Allah’s principles to stay sober.",
            "ar": "الخطوة دي عن مساعدة الناس اللي عندها إدمان مخدرات وإنك تعيش حياة بتهديها مبادئ الله عشان تبقى متعافي."
          },
          "practical_suggestions": {
            "en": [
              "Share your recovery story at a support group to inspire others.",
              "Volunteer to support newcomers in recovery programs.",
              "Apply these principles (honesty, humility) in all areas of your life."
            ],
            "ar": [
              "شارك قصة تعافيك في مجموعة دعم عشان تلهم غيرك.",
              "تطوع عشان تساعد الناس الجدد في برامج التعافي.",
              "طبق المبادئ دي (الصدق، التواضع) في كل نواحي حياتك."
            ]
          }
        }
      ]
    },
    {
      "id": "gambling_addiction",
      "name": {
        "en": "Gambling Addiction",
        "ar": "إدمان القمار"
      },
      "steps": [
        {
          "id": "gambling_step_1",
          "step_number": 1,
          "description": {
            "en": "We admitted we were powerless over gambling—that our lives had become unmanageable. Look, gambling’s taken over, hasn’t it? You’re chasing losses, hiding debts, and your life’s falling apart. Admitting you can’t control it is the first step to getting free.",
            "ar": "اعترفنا بأننا عاجزون عن التحكم في القمار—وأن حياتنا أصبحت غير قابلة للإدارة. شوف، القمار سيطر عليك، مش كده؟ بتحاول تلحق خسايرك، بتخبي ديونك، وحياتك بتتهاوى. لما تعترف إنك مش قادر تتحكم فيه، دي أول خطوة عشان تتحرر."
          },
          "relevance": {
            "en": "Gambling addiction feeds on denial and the hope of winning. Admitting powerlessness helps you stop the cycle and seek help.",
            "ar": "إدمان القمار بيتغذى على الإنكار وأمل الفوز. الاعتراف بالعجز بيساعدك توقف الدايرة دي وتدور على مساعدة."
          },
          "practical_suggestions": {
            "en": [
              "Write down how gambling has affected your finances, relationships, and mental health.",
              "Join a Gamblers Anonymous meeting to connect with others.",
              "Tell a trusted person about your gambling problem to break the secrecy."
            ],
            "ar": [
              "اكتب إزاي القمار أثر على فلوسك، علاقاتك، وصحتك النفسية.",
              "انضم لاجتماع مدمني القمار المجهولين عشان تتواصل مع ناس زيك.",
              "احكي لواحد تثق فيه عن مشكلة القمار بتاعتك عشان تكسر السرية."
            ]
          }
        },
        {
          "id": "gambling_step_2",
          "step_number": 2,
          "description": {
            "en": "Came to believe that faith in Allah could restore us to sanity. You’ve tried to stop gambling, but the urge keeps pulling you back. This step is about trusting Allah to guide you out of this chaos and back to a balanced life.",
            "ar": "آمنا بأن الإيمان بالله يمكنه أن يعيدنا إلى التعقل. حاولت تبطل القمار، بس الرغبة بترجعك. الخطوة دي عن إنك تثق إن الله هيهديك يخرجك من الفوضى دي ويرجعك لحياة متوازنة."
          },
          "relevance": {
            "en": "Gambling addiction creates chaos in your mind and life. Believing in Allah’s guidance offers hope and a path to stability.",
            "ar": "إدمان القمار بيخلق فوضى في عقلك وحياتك. الإيمان بهداية الله بيديك أمل وطريق للاستقرار."
          },
          "practical_suggestions": {
            "en": [
              "Pray to Allah daily for strength to resist gambling urges.",
              "Read the Quran to find inspiration and calm your mind.",
              "Reflect on moments when faith helped you make better choices."
            ],
            "ar": [
              "صلي لله كل يوم عشان يديك القوة تقاوم رغبتك في القمار.",
              "اقرأ القرآن عشان تلاقي إلهام وتهدي عقلك.",
              "فكر في لحظات الإيمان ساعدتك فيها تاخد قرارات أحسن."
            ]
          }
        },
        {
          "id": "gambling_step_3",
          "step_number": 3,
          "description": {
            "en": "Made a decision to turn our will and our lives over to the care of Allah. This isn’t about giving up—it’s about trusting Allah’s plan to lead you away from gambling and toward a better life.",
            "ar": "اتخذنا قرارًا بأن نسلم إرادتنا وحياتنا لرعاية الله. مش معناها إنك بتستسلم—دي عن إنك تثق في خطة الله إنه يبعدك عن القمار ويوديك لحياة أحسن."
          },
          "relevance": {
            "en": "Gambling addiction thrives on the need to control outcomes. Surrendering to Allah’s will helps you let go and follow a healthier path.",
            "ar": "إدمان القمار بيعيش على الحاجة للتحكم في النتايج. لما تسلم نفسك لمشيئة الله، ده بيساعدك تتخلى عن ده وتمشي في طريق أصح."
          },
          "practical_suggestions": {
            "en": [
              "Pray each morning to Allah to guide your decisions.",
              "Write a commitment to follow Allah’s path in your recovery.",
              "Reflect in a quiet space on submitting to Allah’s will."
            ],
            "ar": [
              "صلي كل صبح لله عشان يهدي قراراتك.",
              "اكتب التزام إنك هتمشي في طريق الله في تعافيك.",
              "فكر في مكان هادي عن تسليم نفسك لمشيئة الله."
            ]
          }
        },
        {
          "id": "gambling_step_4",
          "step_number": 4,
          "description": {
            "en": "Made a searching and fearless moral inventory of ourselves. Sit down and face the truth. Write down how gambling has hurt you and others—debts, lies, broken relationships. It’s hard, but it shows you what needs to change.",
            "ar": "عملنا جردًا أخلاقيًا دقيقًا وشجاعًا لأنفسنا. اقعد وواجه الحقيقة. اكتب إزاي القمار ضرك و ضر الناس—ديون، كدب، علاقات اتكسرت. صعب، بس بيوريك إيه لازم يتغير."
          },
          "relevance": {
            "en": "This step helps you see the full damage of gambling addiction, motivating you to take action and change your behavior.",
            "ar": "الخطوة دي بتساعدك تشوف الأذى الكامل لإدمان القمار، وبتحفزك تتحرك وتغير سلوكك."
          },
          "practical_suggestions": {
            "en": [
              "List specific incidents caused by gambling and their consequences.",
              "Ask a trusted friend to help you reflect on your actions.",
              "Organize your inventory by areas: finances, family, emotions."
            ],
            "ar": [
              "اكتب المواقف المحددة اللي حصلت بسبب القمار ونتايجها.",
              "اطلب من صاحب تثق فيه يساعدك تفكر في تصرفاتك.",
              "نظم الجرد بتاعك حسب المجالات: المال، العيلة، المشاعر."
            ]
          }
        },
        {
          "id": "gambling_step_5",
          "step_number": 5,
          "description": {
            "en": "Admitted to Allah, to ourselves, and to another human being the exact nature of our wrongs. Open up to someone you trust. Share the mistakes you wrote down. Telling Allah and another person helps you let go of the shame.",
            "ar": "اعترفنا لله، ولأنفسنا، ولشخص آخر بالطبيعة الدقيقة لأخطائنا. افتح قلبك لواحد تثق فيه. شارك الأخطاء اللي كتبتها. لما تحكي لله ولواحد تاني، ده بيساعدك تتخلص من العار."
          },
          "relevance": {
            "en": "Gambling addiction thrives on secrecy. Sharing your wrongs with Allah and someone else builds honesty and accountability.",
            "ar": "إدمان القمار بيعيش على الأسرار. لما تشارك أخطاءك مع الله ومع حد تاني، ده بيبني الصدق والمسؤولية."
          },
          "practical_suggestions": {
            "en": [
              "Choose a sponsor or trusted person to share your inventory with.",
              "Pray to Allah for courage before sharing your story.",
              "Practice what you’ll say to keep it clear and honest."
            ],
            "ar": [
              "اختار مرشد أو حد تثق فيه عشان تشارك معاه الجرد بتاعك.",
              "صلي لله عشان يديك الشجاعة قبل ما تحكي قصتك.",
              "تدرب على اللي هتقوله عشان يكون واضح وصادق."
            ]
          }
        },
        {
          "id": "gambling_step_6",
          "step_number": 6,
          "description": {
            "en": "Were entirely ready to have Allah remove all these defects of character. Gambling has brought out flaws like greed or dishonesty. This step is about being ready to let Allah take those away so you can live better.",
            "ar": "كنا مستعدين تمامًا لأن يزيل الله كل عيوب شخصيتنا. القمار طلع عيوب زي الطمع أو عدم الصدق. الخطوة دي عن إنك تكون مستعد تخلي الله يزيل العيوب دي عشان تعيش أحسن."
          },
          "relevance": {
            "en": "Gambling addiction amplifies negative traits. Being ready to let Allah remove them is key to personal growth and recovery.",
            "ar": "إدمان القمار بيزود الصفات السلبية. لما تكون مستعد تخلي الله يزيلها، ده مفتاح للتطور الشخصي والتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Reflect on traits like greed that fuel your gambling and pray for their removal.",
              "Write how your life would improve without these flaws.",
              "Talk to a religious mentor about how faith can help you change."
            ],
            "ar": [
              "فكر في الصفات زي الطمع اللي بتغذي قمارك وصلي عشان تتخلص منها.",
              "اكتب إزاي حياتك هتتحسن من غير العيوب دي.",
              "كلم مرشد ديني عن إزاي الإيمان يقدر يساعدك تتغير."
            ]
          }
        },
        {
          "id": "gambling_step_7",
          "step_number": 7,
          "description": {
            "en": "Humbly asked Allah to remove our shortcomings. Now, pray with humility. Ask Allah to take away the flaws that keep you tied to gambling. Trust that He can guide you to change.",
            "ar": "طلبنا من الله بتواضع أن يزيل عيوبنا. دلوقتي، صلي بتواضع. اطلب من الله يزيل العيوب اللي بتربطك بالقمار. ثق إنه قادر يهديك للتغيير."
          },
          "relevance": {
            "en": "This step deepens your reliance on Allah to transform the behaviors that fuel gambling addiction, supporting your recovery.",
            "ar": "الخطوة دي بتعمق اعتمادك على الله عشان يغير السلوكيات اللي بتغذي إدمان القمار، وبتدعم تعافيك."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily for Allah to remove your flaws and give you strength.",
              "Keep a gratitude journal to focus on Allah’s blessings.",
              "Attend a mosque to feel connected to your faith community."
            ],
            "ar": [
              "صلي كل يوم عشان الله يزيل عيوبك ويديك القوة.",
              "احتفظ بدفتر شكر تركز فيه على نعم الله.",
              "روح المسجد عشان تحس بقربك من مجتمع الإيمان."
            ]
          }
        },
        {
          "id": "gambling_step_8",
          "step_number": 8,
          "description": {
            "en": "Made a list of all persons we had harmed, and became willing to make amends to them all. Think about everyone you’ve hurt because of gambling—family, friends, creditors. Write their names and get ready to fix things.",
            "ar": "عملنا قائمة بكل الأشخاص اللي أذيناهم، وأصبحنا مستعدين لتعويضهم جميعًا. فكر في كل الناس اللي ضريتهم بسبب القمار—عيلتك، أصحابك، اللي إنت مديونلهم. اكتب أساميهم واستعد تصلح الأمور."
          },
          "relevance": {
            "en": "Gambling addiction damages relationships and trust. This step helps you take responsibility and prepare to rebuild those connections.",
            "ar": "إدمان القمار بيدمر العلاقات والثقة. الخطوة دي بتساعدك تتحمل المسؤولية وتستعد تبني العلاقات دي من جديد."
          },
          "practical_suggestions": {
            "en": [
              "List specific people you’ve wronged and what you did to them.",
              "Reflect on how your actions hurt them to build empathy.",
              "Discuss your list with a sponsor to plan your amends."
            ],
            "ar": [
              "اكتب قايمة بالناس اللي ظلمتهم وإنت عملتلهم إيه.",
              "فكر إزاي تصرفاتك ضرتهم عشان تبني تعاطف.",
              "ناقش القايمة مع مرشد عشان تخطط لتعويضاتك."
            ]
          }
        },
        {
          "id": "gambling_step_9",
          "step_number": 9,
          "description": {
            "en": "Made direct amends to such people wherever possible, except when to do so would injure them or others. Go to those people and apologize sincerely. Fix what you can, like paying back debts, but don’t cause more harm.",
            "ar": "قدمنا تعويضات مباشرة لهؤلاء الأشخاص حيثما أمكن، إلا إذا كان ذلك سيؤذيهم أو غيرهم. روح للناس دي واعتذر بصدق. صلح اللي تقدر عليه، زي إنك ترد ديون، بس خلي بالك ما تسببش ضرر زيادة."
          },
          "relevance": {
            "en": "Making amends repairs the damage caused by gambling addiction and helps you move forward with a clear conscience.",
            "ar": "الخطوة دي بتصلح الأذى اللي سببه إدمان القمار وبتساعدك تكمل وإنت ضميرك مرتاح."
          },
          "practical_suggestions": {
            "en": [
              "Plan your apologies with sincerity and accountability.",
              "Start with small amends, like apologizing to a friend, to build confidence.",
              "Seek guidance from a mentor on sensitive amends, like financial debts."
            ],
            "ar": [
              "خطط لاعتذاراتك وخليك صادق ومسؤول.",
              "ابدأ بتعويضات صغيرة، زي الاعتذار لصاحب، عشان تبني ثقتك.",
              "اطلب نصيحة من مرشد عن التعويضات الحساسة، زي الديون المالية."
            ]
          }
        },
        {
          "id": "gambling_step_10",
          "step_number": 10,
          "description": {
            "en": "Continued to take personal inventory and when we were wrong promptly admitted it. Keep checking yourself every day. If you slip up, admit it right away. This keeps you honest and on the right path.",
            "ar": "واصلنا جرد أنفسنا الشخصي، وعندما كنا مخطئين اعترفنا بذلك فورًا. خليك دايمًا تراجع نفسك كل يوم. لو غلطت، اعترف بالغلط على طول. ده بيخليك صادق ومستمر على الطريق الصح."
          },
          "relevance": {
            "en": "Gambling addiction can return if you’re not vigilant. This step ensures you stay aware of your actions and correct mistakes quickly.",
            "ar": "إدمان القمار ممكن يرجع لو مش واخد بالك. الخطوة دي بتضمن إنك تفضل واعي بتصرفاتك وتصلح الأخطاء بسرعة."
          },
          "practical_suggestions": {
            "en": [
              "Set a daily reminder to reflect on your actions and choices.",
              "Track triggers that tempt you to gamble in a journal.",
              "Practice quick apologies for small mistakes to build honesty."
            ],
            "ar": [
              "حط تذكير يومي عشان تراجع تصرفاتك وقراراتك.",
              "تابع المحفزات اللي بتغريك بالقمار في دفتر.",
              "تدرب على الاعتذار السريع عن الأخطاء الصغيرة عشان تبني الصدق."
            ]
          }
        },
        {
          "id": "gambling_step_11",
          "step_number": 11,
          "description": {
            "en": "Sought through prayer and meditation to improve our conscious contact with Allah, praying only for knowledge of His will for us and the power to carry that out. Pray and reflect daily to stay close to Allah. Ask Him to guide you to stay free from gambling.",
            "ar": "سعينا من خلال الصلاة والتأمل لتحسين اتصالنا الواعي بالله، داعين فقط لمعرفة مشيئته لنا والقوة لتنفيذها. صلي وفكر كل يوم عشان تبقى قريب من الله. اطلب منه يهديك عشان تفضل بعيد عن القمار."
          },
          "relevance": {
            "en": "This step strengthens your faith in Allah, helping you resist gambling urges and stay committed to recovery.",
            "ar": "الخطوة دي بتقوي إيمانك بالله، وبتساعدك تقاوم رغبتك في القمار وتفضل ملتزم بالتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Pray five times daily to maintain your connection with Allah.",
              "Practice quiet reflection to focus on Allah’s guidance.",
              "Join a religious study group to deepen your faith."
            ],
            "ar": [
              "صلي خمس مرات يوميًا عشان تحافظ على اتصالك بالله.",
              "مارس التفكير الهادي عشان تركز على هداية الله.",
              "انضم لمجموعة دراسة دينية عشان تعمق إيمانك."
            ]
          }
        },
        {
          "id": "gambling_step_12",
          "step_number": 12,
          "description": {
            "en": "Having had a spiritual awakening as the result of these steps, we tried to carry this message to others struggling with gambling, and to practice these principles in all our affairs. You’ve changed with Allah’s help. Now, share your story and live these principles every day.",
            "ar": "بعد أن اختبرنا صحوة روحية نتيجة هذه الخطوات، حاولنا نقل هذه الرسالة لغيرنا من مدمني القمار، وممارسة هذه المبادئ في كل شؤوننا. إنت اتغيرت بمساعدة الله. دلوقتي، شارك قصتك وعيش المبادئ دي كل يوم."
          },
          "relevance": {
            "en": "This step is about helping others with gambling addiction and living a life guided by Allah’s principles to stay free from gambling.",
            "ar": "الخطوة دي عن مساعدة الناس اللي عندها إدمان قمار وإنك تعيش حياة بتهديها مبادئ الله عشان تبقى بعيد عن القمار."
          },
          "practical_suggestions": {
            "en": [
              "Share your recovery story at a support group to inspire others.",
              "Volunteer to support newcomers in recovery programs.",
              "Apply these principles (honesty, humility) in all areas of your life."
            ],
            "ar": [
              "شارك قصة تعافيك في مجموعة دعم عشان تلهم غيرك.",
              "تطوع عشان تساعد الناس الجدد في برامج التعافي.",
              "طبق المبادئ دي (الصدق، التواضع) في كل نواحي حياتك."
            ]
          }
        }
      ]
    },
    {
      "id": "food_addiction",
      "name": {
        "en": "Food Addiction",
        "ar": "إدمان الطعام"
      },
      "steps": [
        {
          "id": "food_step_1",
          "step_number": 1,
          "description": {
            "en": "We admitted we were powerless over food—that our lives had become unmanageable. I know it’s tough to say, but food’s controlling you, isn’t it? Whether it’s binge eating, purging, or starving yourself, it’s messing with your health, your mood, and your life. Admitting you can’t control it alone is the first step to healing.",
            "ar": "اعترفنا بأننا عاجزون عن التحكم في الطعام—وأن حياتنا أصبحت غير قابلة للإدارة. أعرف إنها صعبة، بس الطعام بيسيطر عليك، مش كده؟ سواء كنت بتاكل بنهم، بتتخلص من الأكل، أو بتمنع نفسك منه، ده بيأثر على صحتك، مزاجك، وحياتك. لما تعترف إنك مش قادر تتحكم لوحدك، دي أول خطوة للشفاء."
          },
          "relevance": {
            "en": "Food addiction, whether binge eating, bulimia, or anorexia, thrives on denial. Admitting powerlessness breaks that cycle and opens the door to recovery.",
            "ar": "إدمان الطعام، سواء الأكل بنهم، الشره العصبي، أو فقدان الشهية، بيعيش على الإنكار. الاعتراف بالعجز بيكسر الدايرة دي ويفتح الباب للتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Write down how your eating habits (bingeing, purging, or restricting) have affected your life.",
              "Join a support group like Overeaters Anonymous to connect with others.",
              "Talk to a trusted friend or family member about your struggles with food."
            ],
            "ar": [
              "اكتب إزاي عاداتك في الأكل (الأكل بنهم، التخلص من الأكل، أو منع نفسك) أثرت على حياتك.",
              "انضم لمجموعة دعم زي الأكل المفرط المجهولين عشان تتواصل مع ناس زيك.",
              "كلم صاحب أو حد من عيلتك تثق فيه عن مشاكلك مع الأكل."
            ]
          }
        },
        {
          "id": "food_step_2",
          "step_number": 2,
          "description": {
            "en": "Came to believe that faith in Allah could restore us to sanity. You’ve tried to control your eating before, and it’s been a struggle, right? This step is about trusting that Allah can guide you to a healthier relationship with food and a clearer mind.",
            "ar": "آمنا بأن الإيمان بالله يمكنه أن يعيدنا إلى التعقل. حاولت تتحكم في أكلك قبل كده، وكان صعب، مش كده؟ الخطوة دي عن إنك تثق إن الله يقدر يهديك لعلاقة أصح مع الأكل وعقل أوضح."
          },
          "relevance": {
            "en": "Food addiction disrupts your physical and mental balance. Believing in Allah’s guidance gives you hope to find peace and control.",
            "ar": "إدمان الطعام بيخلّي توازنك البدني والنفسي يضيع. الإيمان بهداية الله بيديك أمل إنك تلاقي السلام والسيطرة."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily to Allah for strength to make healthier food choices.",
              "Read spiritual texts like the Quran to find calm and inspiration.",
              "Reflect on moments when faith helped you feel in control."
            ],
            "ar": [
              "صلي كل يوم لله عشان يديك القوة تختار أكل أصح.",
              "اقرأ نصوص دينية زي القرآن عشان تلاقي هدوء وإلهام.",
              "فكر في لحظات الإيمان ساعدتك فيها تحس إنك مسيطر."
            ]
          }
        },
        {
          "id": "food_step_3",
          "step_number": 3,
          "description": {
            "en": "Made a decision to turn our will and our lives over to the care of Allah. This isn’t about giving up—it’s about trusting Allah’s plan to guide you away from unhealthy eating habits and toward a balanced life.",
            "ar": "اتخذنا قرارًا بأن نسلم إرادتنا وحياتنا لرعاية الله. مش معناها إنك بتستسلم—دي عن إنك تثق في خطة الله إنه يبعدك عن عادات الأكل الغلط ويوديك لحياة متوازنة."
          },
          "relevance": {
            "en": "Food addiction often comes from trying to control emotions through eating. Surrendering to Allah’s will helps you let go and find healthier ways to cope.",
            "ar": "إدمان الطعام غالبًا بيجي من محاولة التحكم في المشاعر عن طريق الأكل. لما تسلم نفسك لمشيئة الله، ده بيساعدك تتخلى عن ده وتلاقي طرق أصح تتعامل بيها."
          },
          "practical_suggestions": {
            "en": [
              "Pray each morning to Allah to guide your eating choices.",
              "Write a commitment to follow Allah’s guidance in your recovery.",
              "Find a quiet space to reflect on submitting to Allah’s will."
            ],
            "ar": [
              "صلي كل صبح لله عشان يهدي اختياراتك في الأكل.",
              "اكتب التزام إنك هتمشي ورا هداية الله في تعافيك.",
              "دور على مكان هادي تفكر فيه عن تسليم نفسك لمشيئة الله."
            ]
          }
        },
        {
          "id": "food_step_4",
          "step_number": 4,
          "description": {
            "en": "Made a searching and fearless moral inventory of ourselves. Sit down and be honest. Write down how your eating habits have hurt you and others—your health, your relationships, your self-esteem. It’s tough, but it shows you what needs fixing.",
            "ar": "عملنا جردًا أخلاقيًا دقيقًا وشجاعًا لأنفسنا. اقعد وكن صادق. اكتب إزاي عاداتك في الأكل ضرتك و ضر الناس—صحتك، علاقاتك، ثقتك بنفسك. صعب، بس بيوريك إيه لازم يتصلح."
          },
          "relevance": {
            "en": "This step helps you face the damage caused by food addiction, motivating you to change your relationship with food.",
            "ar": "الخطوة دي بتساعدك تواجه الأذى اللي سببه إدمان الطعام، وبتحفزك تغير علاقتك بالأكل."
          },
          "practical_suggestions": {
            "en": [
              "Journal about specific incidents caused by your eating habits and their impact.",
              "Ask a trusted person to help you reflect on your actions without judgment.",
              "Organize your inventory by areas: health, relationships, emotions."
            ],
            "ar": [
              "اكتب في دفتر عن المواقف المحددة اللي حصلت بسبب عاداتك في الأكل وتأثيرها.",
              "اطلب من حد تثق فيه يساعدك تفكر في تصرفاتك من غير حكم.",
              "نظم الجرد بتاعك حسب المجالات: الصحة، العلاقات، المشاعر."
            ]
          }
        },
        {
          "id": "food_step_5",
          "step_number": 5,
          "description": {
            "en": "Admitted to Allah, to ourselves, and to another human being the exact nature of our wrongs. Open up to someone you trust. Share the mistakes you wrote down about your eating habits. Telling Allah and another person lifts the shame and helps you heal.",
            "ar": "اعترفنا لله، ولأنفسنا، ولشخص آخر بالطبيعة الدقيقة لأخطائنا. افتح قلبك لواحد تثق فيه. شارك الأخطاء اللي كتبتها عن عاداتك في الأكل. لما تحكي لله ولواحد تاني، ده بيخفف العار ويساعدك تشفى."
          },
          "relevance": {
            "en": "Food addiction often involves guilt and secrecy. Sharing your wrongs with Allah and someone else builds honesty and accountability.",
            "ar": "إدمان الطعام غالبًا بيجي مع الذنب والأسرار. لما تشارك أخطاءك مع الله ومع حد تاني، ده بيبني الصدق والمسؤولية."
          },
          "practical_suggestions": {
            "en": [
              "Choose a sponsor or trusted friend to share your inventory with.",
              "Pray to Allah for courage before opening up.",
              "Practice what you’ll say to keep it honest and clear."
            ],
            "ar": [
              "اختار مرشد أو صاحب تثق فيه عشان تشارك معاه الجرد بتاعك.",
              "صلي لله عشان يديك الشجاعة قبل ما تتكلم.",
              "تدرب على اللي هتقوله عشان يكون صادق وواضح."
            ]
          }
        },
        {
          "id": "food_step_6",
          "step_number": 6,
          "description": {
            "en": "Were entirely ready to have Allah remove all these defects of character. Your eating habits might come from flaws like low self-esteem or emotional avoidance. This step is about being ready to let Allah take those away so you can live healthier.",
            "ar": "كنا مستعدين تمامًا لأن يزيل الله كل عيوب شخصيتنا. عاداتك في الأكل ممكن تكون جاية من عيوب زي قلة الثقة بالنفس أو الهروب من المشاعر. الخطوة دي عن إنك تكون مستعد تخلي الله يزيل العيوب دي عشان تعيش بصحة أحسن."
          },
          "relevance": {
            "en": "Food addiction amplifies emotional flaws. Being ready to let Allah remove them is key to building a healthier relationship with food.",
            "ar": "إدمان الطعام بيزود العيوب العاطفية. لما تكون مستعد تخلي الله يزيلها، ده مفتاح لبناء علاقة أصح بالأكل."
          },
          "practical_suggestions": {
            "en": [
              "Reflect on emotional triggers (like stress) that lead to unhealthy eating and pray for their removal.",
              "Write how your life would improve without these flaws.",
              "Talk to a religious mentor about how faith can help you change."
            ],
            "ar": [
              "فكر في المحفزات العاطفية (زي التوتر) اللي بتوديك للأكل الغلط وصلي عشان تتخلص منها.",
              "اكتب إزاي حياتك هتتحسن من غير العيوب دي.",
              "كلم مرشد ديني عن إزاي الإيمان يقدر يساعدك تتغير."
            ]
          }
        },
        {
          "id": "food_step_7",
          "step_number": 7,
          "description": {
            "en": "Humbly asked Allah to remove our shortcomings. Now, pray with sincerity. Ask Allah to take away the flaws that drive your unhealthy eating habits. Trust that He can help you change.",
            "ar": "طلبنا من الله بتواضع أن يزيل عيوبنا. دلوقتي، صلي بصدق. اطلب من الله يزيل العيوب اللي بتدفعك لعادات أكل غلط. ثق إنه قادر يساعدك تتغير."
          },
          "relevance": {
            "en": "This step deepens your reliance on Allah to transform the behaviors that fuel food addiction, supporting your recovery.",
            "ar": "الخطوة دي بتعمق اعتمادك على الله عشان يغير السلوكيات اللي بتغذي إدمان الطعام، وبتدعم تعافيك."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily for Allah to remove your flaws and guide your eating habits.",
              "Keep a gratitude journal to focus on Allah’s blessings.",
              "Attend a mosque to feel connected to your faith community."
            ],
            "ar": [
              "صلي كل يوم عشان الله يزيل عيوبك ويهدي عاداتك في الأكل.",
              "احتفظ بدفتر شكر تركز فيه على نعم الله.",
              "روح المسجد عشان تحس بقربك من مجتمع الإيمان."
            ]
          }
        },
        {
          "id": "food_step_8",
          "step_number": 8,
          "description": {
            "en": "Made a list of all persons we had harmed, and became willing to make amends to them all. Think about everyone you’ve hurt because of your eating habits—maybe you’ve pushed away family or neglected responsibilities. Write their names and get ready to fix things.",
            "ar": "عملنا قائمة بكل الأشخاص اللي أذيناهم، وأصبحنا مستعدين لتعويضهم جميعًا. فكر في كل الناس اللي ضريتهم بسبب عاداتك في الأكل—يمكن بعدت عن عيلتك أو أهملت مسؤولياتك. اكتب أساميهم واستعد تصلح الأمور."
          },
          "relevance": {
            "en": "Food addiction can strain relationships and responsibilities. This step helps you take responsibility and prepare to rebuild trust.",
            "ar": "إدمان الطعام ممكن يرهق العلاقات والمسؤوليات. الخطوة دي بتساعدك تتحمل المسؤولية وتستعد تبني الثقة من جديد."
          },
          "practical_suggestions": {
            "en": [
              "List specific people you’ve wronged and how your eating habits affected them.",
              "Reflect on how your actions hurt them to build empathy.",
              "Discuss your list with a sponsor to plan your amends."
            ],
            "ar": [
              "اكتب قايمة بالناس اللي ظلمتهم وإزاي عاداتك في الأكل أثرت عليهم.",
              "فكر إزاي تصرفاتك ضرتهم عشان تبني تعاطف.",
              "ناقش القايمة مع مرشد عشان تخطط لتعويضاتك."
            ]
          }
        },
        {
          "id": "food_step_9",
          "step_number": 9,
          "description": {
            "en": "Made direct amends to such people wherever possible, except when to do so would injure them or others. Go to those people and apologize sincerely. Fix what you can, like rebuilding trust, but don’t cause more harm.",
            "ar": "قدمنا تعويضات مباشرة لهؤلاء الأشخاص حيثما أمكن، إلا إذا كان ذلك سيؤذيهم أو غيرهم. روح للناس دي واعتذر بصدق. صلح اللي تقدر عليه، زي إنك تبني الثقة من جديد، بس خلي بالك ما تسببش ضرر زيادة."
          },
          "relevance": {
            "en": "Making amends repairs relationships damaged by food addiction and helps you move forward with a clear conscience.",
            "ar": "الخطوة دي بتصلح العلاقات اللي اتضررت بسبب إدمان الطعام وبتساعدك تكمل وإنت ضميرك مرتاح."
          },
          "practical_suggestions": {
            "en": [
              "Plan your apologies with sincerity and accountability.",
              "Start with small amends, like apologizing to a family member, to build confidence.",
              "Seek guidance from a mentor on sensitive amends."
            ],
            "ar": [
              "خطط لاعتذاراتك وخليك صادق ومسؤول.",
              "ابدأ بتعويضات صغيرة، زي الاعتذار لعيلتك، عشان تبني ثقتك.",
              "اطلب نصيحة من مرشد عن التعويضات الحساسة."
            ]
          }
        },
        {
          "id": "food_step_10",
          "step_number": 10,
          "description": {
            "en": "Continued to take personal inventory and when we were wrong promptly admitted it. Keep checking yourself every day. If you slip back into unhealthy eating, admit it right away. This keeps you honest and on track.",
            "ar": "واصلنا جرد أنفسنا الشخصي، وعندما كنا مخطئين اعترفنا بذلك فورًا. خليك دايمًا تراجع نفسك كل يوم. لو رجعت لعادات أكل غلط، اعترف على طول. ده بيخليك صادق ومستمر على الطريق الصح."
          },
          "relevance": {
            "en": "Food addiction can creep back if you’re not vigilant. This step ensures you stay aware of your eating habits and correct mistakes quickly.",
            "ar": "إدمان الطعام ممكن يرجع لو مش واخد بالك. الخطوة دي بتضمن إنك تفضل واعي بعاداتك في الأكل وتصلح الأخطاء بسرعة."
          },
          "practical_suggestions": {
            "en": [
              "Set a daily reminder to reflect on your eating choices.",
              "Track emotional triggers that lead to unhealthy eating in a journal.",
              "Practice quick apologies for small mistakes to build honesty."
            ],
            "ar": [
              "حط تذكير يومي عشان تراجع اختياراتك في الأكل.",
              "تابع المحفزات العاطفية اللي بتوديك للأكل الغلط في دفتر.",
              "تدرب على الاعتذار السريع عن الأخطاء الصغيرة عشان تبني الصدق."
            ]
          }
        },
        {
          "id": "food_step_11",
          "step_number": 11,
          "description": {
            "en": "Sought through prayer and meditation to improve our conscious contact with Allah, praying only for knowledge of His will for us and the power to carry that out. Pray and reflect daily to stay close to Allah. Ask Him to guide you to healthy eating habits.",
            "ar": "سعينا من خلال الصلاة والتأمل لتحسين اتصالنا الواعي بالله، داعين فقط لمعرفة مشيئته لنا والقوة لتنفيذها. صلي وفكر كل يوم عشان تبقى قريب من الله. اطلب منه يهديك لعادات أكل صحية."
          },
          "relevance": {
            "en": "This step strengthens your faith in Allah, helping you resist unhealthy eating urges and stay committed to recovery.",
            "ar": "الخطوة دي بتقوي إيمانك بالله، وبتساعدك تقاوم رغبتك في الأكل الغلط وتفضل ملتزم بالتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Pray five times daily to maintain your connection with Allah.",
              "Practice quiet reflection to focus on Allah’s guidance for your eating habits.",
              "Join a religious study group to deepen your faith."
            ],
            "ar": [
              "صلي خمس مرات يوميًا عشان تحافظ على اتصالك بالله.",
              "مارس التفكير الهادي عشان تركز على هداية الله لعاداتك في الأكل.",
              "انضم لمجموعة دراسة دينية عشان تعمق إيمانك."
            ]
          }
        },
        {
          "id": "food_step_12",
          "step_number": 12,
          "description": {
            "en": "Having had a spiritual awakening as the result of these steps, we tried to carry this message to others struggling with food, and to practice these principles in all our affairs. You’ve changed with Allah’s help. Now, share your story and live these principles every day.",
            "ar": "بعد أن اختبرنا صحوة روحية نتيجة هذه الخطوات، حاولنا نقل هذه الرسالة لغيرنا من اللي بيعانوا مع الأكل، وممارسة هذه المبادئ في كل شؤوننا. إنت اتغيرت بمساعدة الله. دلوقتي، شارك قصتك وعيش المبادئ دي كل يوم."
          },
          "relevance": {
            "en": "This step is about helping others with food addiction and living a life guided by Allah’s principles to stay healthy.",
            "ar": "الخطوة دي عن مساعدة الناس اللي عندهم إدمان طعام وإنك تعيش حياة بتهديها مبادئ الله عشان تبقى بصحة."
          },
          "practical_suggestions": {
            "en": [
              "Share your recovery story at a support group to inspire others.",
              "Volunteer to support newcomers in recovery programs.",
              "Apply these principles (honesty, humility) in all areas of your life."
            ],
            "ar": [
              "شارك قصة تعافيك في مجموعة دعم عشان تلهم غيرك.",
              "تطوع عشان تساعد الناس الجدد في برامج التعافي.",
              "طبق المبادئ دي (الصدق، التواضع) في كل نواحي حياتك."
            ]
          }
        }
      ]
    },
    {
      "id": "nicotine_addiction",
      "name": {
        "en": "Nicotine Addiction",
        "ar": "إدمان النيكوتين"
      },
      "steps": [
        {
          "id": "nicotine_step_1",
          "step_number": 1,
          "description": {
            "en": "We admitted we were powerless over nicotine—that our lives had become unmanageable. Look, smoking or vaping is running your life, isn’t it? You’re planning your day around it, and it’s hurting your health and peace. Admitting you can’t control it is the first step to freedom.",
            "ar": "اعترفنا بأننا عاجزون عن التحكم في النيكوتين—وأن حياتنا أصبحت غير قابلة للإدارة. شوف، التدخين أو الفيب بيدير حياتك، مش كده؟ بتخطط يومك حواليه، وده بيضر صحتك وراحتك. لما تعترف إنك مش قادر تتحكم فيه، دي أول خطوة للحرية."
          },
          "relevance": {
            "en": "Nicotine addiction traps you in a cycle of dependency. Admitting powerlessness breaks the denial and opens the door to recovery.",
            "ar": "إدمان النيكوتين بيحاصرك في دايرة الاعتماد. الاعتراف بالعجز بيكسر الإنكار ويفتح الباب للتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Write down how nicotine has affected your health, finances, and relationships.",
              "Join a support group like Nicotine Anonymous to connect with others.",
              "Tell a trusted person about your struggle with smoking or vaping."
            ],
            "ar": [
              "اكتب إزاي النيكوتين أثر على صحتك، فلوسك، وعلاقاتك.",
              "انضم لمجموعة دعم زي مدمني النيكوتين المجهولين عشان تتواصل مع ناس زيك.",
              "كلم حد تثق فيه عن معاناتك مع التدخين أو الفيب."
            ]
          }
        },
        {
          "id": "nicotine_step_2",
          "step_number": 2,
          "description": {
            "en": "Came to believe that faith in Allah could restore us to sanity. You’ve tried quitting smoking before, and it’s been tough, right? This step is about trusting Allah to guide you away from nicotine and toward a clearer, healthier life.",
            "ar": "آمنا بأن الإيمان بالله يمكنه أن يعيدنا إلى التعقل. حاولت تبطل التدخين قبل كده، وكان صعب، مش كده؟ الخطوة دي عن إنك تثق إن الله يقدر يهديك بعيد عن النيكوتين ونحو حياة أوضح وأصح."
          },
          "relevance": {
            "en": "Nicotine addiction clouds your health and mind. Believing in Allah’s guidance gives you hope to find strength and clarity.",
            "ar": "إدمان النيكوتين بيشوش على صحتك وعقلك. الإيمان بهداية الله بيديك أمل إنك تلاقي القوة والوضوح."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily to Allah for strength to resist nicotine cravings.",
              "Read the Quran to find peace and motivation to stay smoke-free.",
              "Reflect on times when faith helped you overcome challenges."
            ],
            "ar": [
              "صلي كل يوم لله عشان يديك القوة تقاوم رغبتك في النيكوتين.",
              "اقرأ القرآن عشان تلاقي سلام وتحفيز تبقى بعيد عن التدخين.",
              "فكر في أوقات الإيمان ساعدك فيها تتغلب على تحديات."
            ]
          }
        },
        {
          "id": "nicotine_step_3",
          "step_number": 3,
          "description": {
            "en": "Made a decision to turn our will and our lives over to the care of Allah. This isn’t about giving up—it’s about trusting Allah’s plan to lead you away from nicotine and toward a healthier life.",
            "ar": "اتخذنا قرارًا بأن نسلم إرادتنا وحياتنا لرعاية الله. مش معناها إنك بتستسلم—دي عن إنك تثق في خطة الله إنه يبعدك عن النيكوتين ويوديك لحياة أصح."
          },
          "relevance": {
            "en": "Nicotine addiction thrives on the need to cope through smoking. Surrendering to Allah’s will helps you let go and find healthier ways to manage stress.",
            "ar": "إدمان النيكوتين بيعيش على الحاجة للتعامل مع التوتر عن طريق التدخين. لما تسلم نفسك لمشيئة الله، ده بيساعدك تتخلى عن ده وتلاقي طرق أصح تتعامل بيها مع التوتر."
          },
          "practical_suggestions": {
            "en": [
              "Pray each morning to Allah to guide your choices away from nicotine.",
              "Write a commitment to follow Allah’s guidance in your recovery.",
              "Find a quiet space to reflect on submitting to Allah’s will."
            ],
            "ar": [
              "صلي كل صبح لله عشان يهدي اختياراتك بعيد عن النيكوتين.",
              "اكتب التزام إنك هتمشي ورا هداية الله في تعافيك.",
              "دور على مكان هادي تفكر فيه عن تسليم نفسك لمشيئة الله."
            ]
          }
        },
        {
          "id": "nicotine_step_4",
          "step_number": 4,
          "description": {
            "en": "Made a searching and fearless moral inventory of ourselves. Be honest with yourself. Write down how nicotine has hurt you and others—your health, your finances, maybe even your relationships. It’s hard, but it shows you what needs to change.",
            "ar": "عملنا جردًا أخلاقيًا دقيقًا وشجاعًا لأنفسنا. كن صادق مع نفسك. اكتب إزاي النيكوتين ضرك و ضر الناس—صحتك، فلوسك، يمكن حتى علاقاتك. صعب، بس بيوريك إيه لازم يتغير."
          },
          "relevance": {
            "en": "This step helps you face the damage caused by nicotine addiction, motivating you to change your habits.",
            "ar": "الخطوة دي بتساعدك تواجه الأذى اللي سببه إدمان النيكوتين، وبتحفزك تغير عاداتك."
          },
          "practical_suggestions": {
            "en": [
              "Journal about specific ways nicotine has impacted your life.",
              "Ask a trusted friend to help you reflect on your actions.",
              "Organize your inventory by areas: health, finances, relationships."
            ],
            "ar": [
              "اكتب في دفتر عن الطرق المحددة اللي النيكوتين أثر بيها على حياتك.",
              "اطلب من صاحب تثق فيه يساعدك تفكر في تصرفاتك.",
              "نظم الجرد بتاعك حسب المجالات: الصحة، الفلوس، العلاقات."
            ]
          }
        },
        {
          "id": "nicotine_step_5",
          "step_number": 5,
          "description": {
            "en": "Admitted to Allah, to ourselves, and to another human being the exact nature of our wrongs. Open up to someone you trust. Share the mistakes you wrote down about your smoking habits. Telling Allah and another person lifts the guilt and helps you heal.",
            "ar": "اعترفنا لله، ولأنفسنا، ولشخص آخر بالطبيعة الدقيقة لأخطائنا. افتح قلبك لواحد تثق فيه. شارك الأخطاء اللي كتبتها عن عاداتك في التدخين. لما تحكي لله ولواحد تاني، ده بيخفف الذنب ويساعدك تشفى."
          },
          "relevance": {
            "en": "Nicotine addiction often involves hiding your struggle. Sharing your wrongs with Allah and someone else builds honesty and accountability.",
            "ar": "إدمان النيكوتين غالبًا بيجي مع إخفاء معاناتك. لما تشارك أخطاءك مع الله ومع حد تاني، ده بيبني الصدق والمسؤولية."
          },
          "practical_suggestions": {
            "en": [
              "Choose a sponsor or trusted friend to share your inventory with.",
              "Pray to Allah for courage before opening up.",
              "Practice what you’ll say to keep it honest and clear."
            ],
            "ar": [
              "اختار مرشد أو صاحب تثق فيه عشان تشارك معاه الجرد بتاعك.",
              "صلي لله عشان يديك الشجاعة قبل ما تتكلم.",
              "تدرب على اللي هتقوله عشان يكون صادق وواضح."
            ]
          }
        },
        {
          "id": "nicotine_step_6",
          "step_number": 6,
          "description": {
            "en": "Were entirely ready to have Allah remove all these defects of character. Smoking might come from flaws like stress or avoidance. This step is about being ready to let Allah take those away so you can live healthier.",
            "ar": "كنا مستعدين تمامًا لأن يزيل الله كل عيوب شخصيتنا. التدخين ممكن يكون جاي من عيوب زي التوتر أو الهروب. الخطوة دي عن إنك تكون مستعد تخلي الله يزيل العيوب دي عشان تعيش بصحة أحسن."
          },
          "relevance": {
            "en": "Nicotine addiction amplifies coping flaws. Being ready to let Allah remove them is key to quitting and staying healthy.",
            "ar": "إدمان النيكوتين بيزود عيوب التعامل مع المشاكل. لما تكون مستعد تخلي الله يزيلها، ده مفتاح للإقلاع عن التدخين والبقاء بصحة."
          },
          "practical_suggestions": {
            "en": [
              "Reflect on triggers like stress that lead to smoking and pray for their removal.",
              "Write how your life would improve without these flaws.",
              "Talk to a religious mentor about how faith can help you change."
            ],
            "ar": [
              "فكر في المحفزات زي التوتر اللي بتوديك للتدخين وصلي عشان تتخلص منها.",
              "اكتب إزاي حياتك هتتحسن من غير العيوب دي.",
              "كلم مرشد ديني عن إزاي الإيمان يقدر يساعدك تتغير."
            ]
          }
        },
        {
          "id": "nicotine_step_7",
          "step_number": 7,
          "description": {
            "en": "Humbly asked Allah to remove our shortcomings. Now, pray with sincerity. Ask Allah to take away the flaws that drive your smoking. Trust that He can help you change.",
            "ar": "طلبنا من الله بتواضع أن يزيل عيوبنا. دلوقتي، صلي بصدق. اطلب من الله يزيل العيوب اللي بتدفعك للتدخين. ثق إنه قادر يساعدك تتغير."
          },
          "relevance": {
            "en": "This step deepens your reliance on Allah to transform the behaviors that fuel nicotine addiction, supporting your recovery.",
            "ar": "الخطوة دي بتعمق اعتمادك على الله عشان يغير السلوكيات اللي بتغذي إدمان النيكوتين، وبتدعم تعافيك."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily for Allah to remove your flaws and guide you to quit smoking.",
              "Keep a gratitude journal to focus on Allah’s blessings.",
              "Attend a mosque to feel connected to your faith community."
            ],
            "ar": [
              "صلي كل يوم عشان الله يزيل عيوبك ويهديك تبطل التدخين.",
              "احتفظ بدفتر شكر تركز فيه على نعم الله.",
              "روح المسجد عشان تحس بقربك من مجتمع الإيمان."
            ]
          }
        },
        {
          "id": "nicotine_step_8",
          "step_number": 8,
          "description": {
            "en": "Made a list of all persons we had harmed, and became willing to make amends to them all. Think about everyone you’ve hurt because of your smoking—maybe family worried about your health or neglected responsibilities. Write their names and get ready to fix things.",
            "ar": "عملنا قائمة بكل الأشخاص اللي أذيناهم، وأصبحنا مستعدين لتعويضهم جميعًا. فكر في كل الناس اللي ضريتهم بسبب التدخين—يمكن عيلتك قلقانة على صحتك أو أهملت مسؤولياتك. اكتب أساميهم واستعد تصلح الأمور."
          },
          "relevance": {
            "en": "Nicotine addiction can strain relationships and responsibilities. This step helps you take responsibility and prepare to rebuild trust.",
            "ar": "إدمان النيكوتين ممكن يرهق العلاقات والمسؤوليات. الخطوة دي بتساعدك تتحمل المسؤولية وتستعد تبني الثقة من جديد."
          },
          "practical_suggestions": {
            "en": [
              "List specific people you’ve wronged and how smoking affected them.",
              "Reflect on how your actions hurt them to build empathy.",
              "Discuss your list with a sponsor to plan your amends."
            ],
            "ar": [
              "اكتب قايمة بالناس اللي ظلمتهم وإزاي التدخين أثر عليهم.",
              "فكر إزاي تصرفاتك ضرتهم عشان تبني تعاطف.",
              "ناقش القايمة مع مرشد عشان تخطط لتعويضاتك."
            ]
          }
        },
        {
          "id": "nicotine_step_9",
          "step_number": 9,
          "description": {
            "en": "Made direct amends to such people wherever possible, except when to do so would injure them or others. Go to those people and apologize sincerely. Fix what you can, like reassuring family about your health, but don’t cause more harm.",
            "ar": "قدمنا تعويضات مباشرة لهؤلاء الأشخاص حيثما أمكن، إلا إذا كان ذلك سيؤذيهم أو غيرهم. روح للناس دي واعتذر بصدق. صلح اللي تقدر عليه، زي إنك تطمن عيلتك عن صحتك، بس خلي بالك ما تسببش ضرر زيادة."
          },
          "relevance": {
            "en": "Making amends repairs relationships damaged by nicotine addiction and helps you move forward with a clear conscience.",
            "ar": "الخطوة دي بتصلح العلاقات اللي اتضررت بسبب إدمان النيكوتين وبتساعدك تكمل وإنت ضميرك مرتاح."
          },
          "practical_suggestions": {
            "en": [
              "Plan your apologies with sincerity and accountability.",
              "Start with small amends, like apologizing to a family member, to build confidence.",
              "Seek guidance from a mentor on sensitive amends."
            ],
            "ar": [
              "خطط لاعتذاراتك وخليك صادق ومسؤول.",
              "ابدأ بتعويضات صغيرة، زي الاعتذار لعيلتك، عشان تبني ثقتك.",
              "اطلب نصيحة من مرشد عن التعويضات الحساسة."
            ]
          }
        },
        {
          "id": "nicotine_step_10",
          "step_number": 10,
          "description": {
            "en": "Continued to take personal inventory and when we were wrong promptly admitted it. Keep checking yourself every day. If you slip back into smoking, admit it right away. This keeps you honest and on track.",
            "ar": "واصلنا جرد أنفسنا الشخصي، وعندما كنا مخطئين اعترفنا بذلك فورًا. خليك دايمًا تراجع نفسك كل يوم. لو رجعت للتدخين، اعترف على طول. ده بيخليك صادق ومستمر على الطريق الصح."
          },
          "relevance": {
            "en": "Nicotine addiction can creep back if you’re not vigilant. This step ensures you stay aware of your habits and correct mistakes quickly.",
            "ar": "إدمان النيكوتين ممكن يرجع لو مش واخد بالك. الخطوة دي بتضمن إنك تفضل واعي بعاداتك وتصلح الأخطاء بسرعة."
          },
          "practical_suggestions": {
            "en": [
              "Set a daily reminder to reflect on your smoking habits.",
              "Track triggers that tempt you to smoke in a journal.",
              "Practice quick apologies for small mistakes to build honesty."
            ],
            "ar": [
              "حط تذكير يومي عشان تراجع عاداتك في التدخين.",
              "تابع المحفزات اللي بتغريك بالتدخين في دفتر.",
              "تدرب على الاعتذار السريع عن الأخطاء الصغيرة عشان تبني الصدق."
            ]
          }
        },
        {
          "id": "nicotine_step_11",
          "step_number": 11,
          "description": {
            "en": "Sought through prayer and meditation to improve our conscious contact with Allah, praying only for knowledge of His will for us and the power to carry that out. Pray and reflect daily to stay close to Allah. Ask Him to guide you to stay smoke-free.",
            "ar": "سعينا من خلال الصلاة والتأمل لتحسين اتصالنا الواعي بالله، داعين فقط لمعرفة مشيئته لنا والقوة لتنفيذها. صلي وفكر كل يوم عشان تبقى قريب من الله. اطلب منه يهديك عشان تفضل بعيد عن التدخين."
          },
          "relevance": {
            "en": "This step strengthens your faith in Allah, helping you resist nicotine cravings and stay committed to recovery.",
            "ar": "الخطوة دي بتقوي إيمانك بالله، وبتساعدك تقاوم رغبتك في النيكوتين وتفضل ملتزم بالتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Pray five times daily to maintain your connection with Allah.",
              "Practice quiet reflection to focus on Allah’s guidance.",
              "Join a religious study group to deepen your faith."
            ],
            "ar": [
              "صلي خمس مرات يوميًا عشان تحافظ على اتصالك بالله.",
              "مارس التفكير الهادي عشان تركز على هداية الله.",
              "انضم لمجموعة دراسة دينية عشان تعمق إيمانك."
            ]
          }
        },
        {
          "id": "nicotine_step_12",
          "step_number": 12,
          "description": {
            "en": "Having had a spiritual awakening as the result of these steps, we tried to carry this message to others struggling with nicotine, and to practice these principles in all our affairs. You’ve changed with Allah’s help. Now, share your story and live these principles every day.",
            "ar": "بعد أن اختبرنا صحوة روحية نتيجة هذه الخطوات، حاولنا نقل هذه الرسالة لغيرنا من اللي بيعانوا مع النيكوتين، وممارسة هذه المبادئ في كل شؤوننا. إنت اتغيرت بمساعدة الله. دلوقتي، شارك قصتك وعيش المبادئ دي كل يوم."
          },
          "relevance": {
            "en": "This step is about helping others with nicotine addiction and living a life guided by Allah’s principles to stay smoke-free.",
            "ar": "الخطوة دي عن مساعدة الناس اللي عندهم إدمان نيكوتين وإنك تعيش حياة بتهديها مبادئ الله عشان تبقى بعيد عن التدخين."
          },
          "practical_suggestions": {
            "en": [
              "Share your recovery story at a support group to inspire others.",
              "Volunteer to support newcomers in recovery programs.",
              "Apply these principles (honesty, humility) in all areas of your life."
            ],
            "ar": [
              "شارك قصة تعافيك في مجموعة دعم عشان تلهم غيرك.",
              "تطوع عشان تساعد الناس الجدد في برامج التعافي.",
              "طبق المبادئ دي (الصدق، التواضع) في كل نواحي حياتك."
            ]
          }
        }
      ]
    },
    {
      "id": "shopping_addiction",
      "name": {
        "en": "Shopping Addiction",
        "ar": "إدمان التسوق"
      },
      "steps": [
        {
          "id": "shopping_step_1",
          "step_number": 1,
          "description": {
            "en": "We admitted we were powerless over shopping—that our lives had become unmanageable. Look, shopping’s taken over, hasn’t it? You’re spending money you don’t have, hiding purchases, and it’s stressing you out. Admitting you can’t control it is the first step to freedom.",
            "ar": "اعترفنا بأننا عاجزون عن التحكم في التسوق—وأن حياتنا أصبحت غير قابلة للإدارة. شوف، التسوق سيطر عليك، مش كده؟ بتصرف فلوس مش معاك، بتخبي الحاجات اللي بتشتريها، وده بيوترك. لما تعترف إنك مش قادر تتحكم فيه، دي أول خطوة للحرية."
          },
          "relevance": {
            "en": "Shopping addiction thrives on denial and instant gratification. Admitting powerlessness breaks that cycle and opens the door to recovery.",
            "ar": "إدمان التسوق بيعيش على الإنكار والإشباع السريع. الاعتراف بالعجز بيكسر الدايرة دي ويفتح الباب للتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Write down how shopping has affected your finances, relationships, and stress levels.",
              "Join a support group like Debtors Anonymous to connect with others.",
              "Tell a trusted person about your struggle with overspending."
            ],
            "ar": [
              "اكتب إزاي التسوق أثر على فلوسك، علاقاتك، ومستوى التوتر عندك.",
              "انضم لمجموعة دعم زي مدينين مجهولين عشان تتواصل مع ناس زيك.",
              "كلم حد تثق فيه عن معاناتك مع الإنفاق الزايد."
            ]
          }
        },
        {
          "id": "shopping_step_2",
          "step_number": 2,
          "description": {
            "en": "Came to believe that faith in Allah could restore us to sanity. You’ve tried to stop overspending, but the urge keeps coming back, right? This step is about trusting Allah to guide you to a balanced financial and emotional life.",
            "ar": "آمنا بأن الإيمان بالله يمكنه أن يعيدنا إلى التعقل. حاولت تبطل الإنفاق الزايد، بس الرغبة بترجع، مش كده؟ الخطوة دي عن إنك تثق إن الله يقدر يهديك لحياة مالية وعاطفية متوازنة."
          },
          "relevance": {
            "en": "Shopping addiction creates financial and emotional chaos. Believing in Allah’s guidance offers hope to find balance and control.",
            "ar": "إدمان التسوق بيخلق فوضى مالية وعاطفية. الإيمان بهداية الله بيديك أمل إنك تلاقي التوازن والسيطرة."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily to Allah for strength to resist shopping urges.",
              "Read the Quran to find inspiration for financial discipline.",
              "Reflect on moments when faith helped you make better financial choices."
            ],
            "ar": [
              "صلي كل يوم لله عشان يديك القوة تقاوم رغبتك في التسوق.",
              "اقرأ القرآن عشان تلاقي إلهام للانضباط المالي.",
              "فكر في لحظات الإيمان ساعدتك فيها تاخد قرارات مالية أحسن."
            ]
          }
        },
        {
          "id": "shopping_step_3",
          "step_number": 3,
          "description": {
            "en": "Made a decision to turn our will and our lives over to the care of Allah. This isn’t about giving up—it’s about trusting Allah’s plan to lead you away from overspending and toward financial peace.",
            "ar": "اتخذنا قرارًا بأن نسلم إرادتنا وحياتنا لرعاية الله. مش معناها إنك بتستسلم—دي عن إنك تثق في خطة الله إنه يبعدك عن الإنفاق الزايد ويوديك لسلام مالي."
          },
          "relevance": {
            "en": "Shopping addiction thrives on seeking control through spending. Surrendering to Allah’s will helps you let go and find healthier ways to cope.",
            "ar": "إدمان التسوق بيعيش على السعي للتحكم عن طريق الإنفاق. لما تسلم نفسك لمشيئة الله، ده بيساعدك تتخلى عن ده وتلاقي طرق أصح تتعامل بيها."
          },
          "practical_suggestions": {
            "en": [
              "Pray each morning to Allah to guide your financial decisions.",
              "Write a commitment to follow Allah’s guidance in your recovery.",
              "Find a quiet space to reflect on submitting to Allah’s will."
            ],
            "ar": [
              "صلي كل صبح لله عشان يهدي قراراتك المالية.",
              "اكتب التزام إنك هتمشي ورا هداية الله في تعافيك.",
              "دور على مكان هادي تفكر فيه عن تسليم نفسك لمشيئة الله."
            ]
          }
        },
        {
          "id": "shopping_step_4",
          "step_number": 4,
          "description": {
            "en": "Made a searching and fearless moral inventory of ourselves. Be honest with yourself. Write down how overspending has hurt you and others—debts, stress, broken trust. It’s tough, but it shows you what needs to change.",
            "ar": "عملنا جردًا أخلاقيًا دقيقًا وشجاعًا لأنفسنا. كن صادق مع نفسك. اكتب إزاي الإنفاق الزايد ضرك و ضر الناس—ديون، توتر، ثقة مكسورة. صعب، بس بيوريك إيه لازم يتغير."
          },
          "relevance": {
            "en": "This step helps you face the damage caused by shopping addiction, motivating you to change your spending habits.",
            "ar": "الخطوة دي بتساعدك تواجه الأذى اللي سببه إدمان التسوق، وبتحفزك تغير عاداتك في الإنفاق."
          },
          "practical_suggestions": {
            "en": [
              "Journal about specific incidents caused by overspending and their consequences.",
              "Ask a trusted friend to help you reflect on your actions.",
              "Organize your inventory by areas: finances, relationships, emotions."
            ],
            "ar": [
              "اكتب في دفتر عن المواقف المحددة اللي حصلت بسبب الإنفاق الزايد ونتايجها.",
              "اطلب من صاحب تثق فيه يساعدك تفكر في تصرفاتك.",
              "نظم الجرد بتاعك حسب المجالات: الفلوس، العلاقات، المشاعر."
            ]
          }
        },
        {
          "id": "shopping_step_5",
          "step_number": 5,
          "description": {
            "en": "Admitted to Allah, to ourselves, and to another human being the exact nature of our wrongs. Open up to someone you trust. Share the mistakes you wrote down about your spending habits. Telling Allah and another person lifts the shame and helps you heal.",
            "ar": "اعترفنا لله، ولأنفسنا، ولشخص آخر بالطبيعة الدقيقة لأخطائنا. افتح قلبك لواحد تثق فيه. شارك الأخطاء اللي كتبتها عن عاداتك في الإنفاق. لما تحكي لله ولواحد تاني، ده بيخفف العار ويساعدك تشفى."
          },
          "relevance": {
            "en": "Shopping addiction thrives on secrecy. Sharing your wrongs with Allah and someone else builds honesty and accountability.",
            "ar": "إدمان التسوق بيعيش على الأسرار. لما تشارك أخطاءك مع الله ومع حد تاني، ده بيبني الصدق والمسؤولية."
          },
          "practical_suggestions": {
            "en": [
              "Choose a sponsor or trusted friend to share your inventory with.",
              "Pray to Allah for courage before opening up.",
              "Practice what you’ll say to keep it honest and clear."
            ],
            "ar": [
              "اختار مرشد أو صاحب تثق فيه عشان تشارك معاه الجرد بتاعك.",
              "صلي لله عشان يديك الشجاعة قبل ما تتكلم.",
              "تدرب على اللي هتقوله عشان يكون صادق وواضح."
            ]
          }
        },
        {
          "id": "shopping_step_6",
          "step_number": 6,
          "description": {
            "en": "Were entirely ready to have Allah remove all these defects of character. Overspending might come from flaws like seeking validation or avoiding emotions. This step is about being ready to let Allah take those away so you can live better.",
            "ar": "كنا مستعدين تمامًا لأن يزيل الله كل عيوب شخصيتنا. الإنفاق الزايد ممكن يكون جاي من عيوب زي البحث عن القبول أو الهروب من المشاعر. الخطوة دي عن إنك تكون مستعد تخلي الله يزيل العيوب دي عشان تعيش أحسن."
          },
          "relevance": {
            "en": "Shopping addiction amplifies emotional flaws. Being ready to let Allah remove them is key to financial and emotional recovery.",
            "ar": "إدمان التسوق بيزود العيوب العاطفية. لما تكون مستعد تخلي الله يزيلها، ده مفتاح للتعافي المالي والعاطفي."
          },
          "practical_suggestions": {
            "en": [
              "Reflect on emotional triggers like loneliness that lead to shopping and pray for their removal.",
              "Write how your life would improve without these flaws.",
              "Talk to a religious mentor about how faith can help you change."
            ],
            "ar": [
              "فكر في المحفزات العاطفية زي الوحدة اللي بتوديك للتسوق وصلي عشان تتخلص منها.",
              "اكتب إزاي حياتك هتتحسن من غير العيوب دي.",
              "كلم مرشد ديني عن إزاي الإيمان يقدر يساعدك تتغير."
            ]
          }
        },
        {
          "id": "shopping_step_7",
          "step_number": 7,
          "description": {
            "en": "Humbly asked Allah to remove our shortcomings. Now, pray with sincerity. Ask Allah to take away the flaws that drive your overspending. Trust that He can help you change.",
            "ar": "طلبنا من الله بتواضع أن يزيل عيوبنا. دلوقتي، صلي بصدق. اطلب من الله يزيل العيوب اللي بتدفعك للإنفاق الزايد. ثق إنه قادر يساعدك تتغير."
          },
          "relevance": {
            "en": "This step deepens your reliance on Allah to transform the behaviors that fuel shopping addiction, supporting your recovery.",
            "ar": "الخطوة دي بتعمق اعتمادك على الله عشان يغير السلوكيات اللي بتغذي إدمان التسوق، وبتدعم تعافيك."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily for Allah to remove your flaws and guide your spending habits.",
              "Keep a gratitude journal to focus on Allah’s blessings.",
              "Attend a mosque to feel connected to your faith community."
            ],
            "ar": [
              "صلي كل يوم عشان الله يزيل عيوبك ويهدي عاداتك في الإنفاق.",
              "احتفظ بدفتر شكر تركز فيه على نعم الله.",
              "روح المسجد عشان تحس بقربك من مجتمع الإيمان."
            ]
          }
        },
        {
          "id": "shopping_step_8",
          "step_number": 8,
          "description": {
            "en": "Made a list of all persons we had harmed, and became willing to make amends to them all. Think about everyone you’ve hurt because of your overspending—family, friends, creditors. Write their names and get ready to fix things.",
            "ar": "عملنا قائمة بكل الأشخاص اللي أذيناهم، وأصبحنا مستعدين لتعويضهم جميعًا. فكر في كل الناس اللي ضريتهم بسبب الإنفاق الزايد—عيلتك، أصحابك، اللي إنت مديونلهم. اكتب أساميهم واستعد تصلح الأمور."
          },
          "relevance": {
            "en": "Shopping addiction damages relationships and trust. This step helps you take responsibility and prepare to rebuild those connections.",
            "ar": "إدمان التسوق بيدمر العلاقات والثقة. الخطوة دي بتساعدك تتحمل المسؤولية وتستعد تبني العلاقات دي من جديد."
          },
          "practical_suggestions": {
            "en": [
              "List specific people you’ve wronged and how your spending affected them.",
              "Reflect on how your actions hurt them to build empathy.",
              "Discuss your list with a sponsor to plan your amends."
            ],
            "ar": [
              "اكتب قايمة بالناس اللي ظلمتهم وإزاي إنفاقك أثر عليهم.",
              "فكر إزاي تصرفاتك ضرتهم عشان تبني تعاطف.",
              "ناقش القايمة مع مرشد عشان تخطط لتعويضاتك."
            ]
          }
        },
        {
          "id": "shopping_step_9",
          "step_number": 9,
          "description": {
            "en": "Made direct amends to such people wherever possible, except when to do so would injure them or others. Go to those people and apologize sincerely. Fix what you can, like paying back debts, but don’t cause more harm.",
            "ar": "قدمنا تعويضات مباشرة لهؤلاء الأشخاص حيثما أمكن، إلا إذا كان ذلك سيؤذيهم أو غيرهم. روح للناس دي واعتذر بصدق. صلح اللي تقدر عليه، زي إنك ترد ديون، بس خلي بالك ما تسببش ضرر زيادة."
          },
          "relevance": {
            "en": "Making amends repairs the damage caused by shopping addiction and helps you move forward with a clear conscience.",
            "ar": "الخطوة دي بتصلح الأذى اللي سببه إدمان التسوق وبتساعدك تكمل وإنت ضميرك مرتاح."
          },
          "practical_suggestions": {
            "en": [
              "Plan your apologies with sincerity and accountability.",
              "Start with small amends, like apologizing to a friend, to build confidence.",
              "Seek guidance from a mentor on sensitive amends, like financial debts."
            ],
            "ar": [
              "خطط لاعتذاراتك وخليك صادق ومسؤول.",
              "ابدأ بتعويضات صغيرة، زي الاعتذار لصاحب، عشان تبني ثقتك.",
              "اطلب نصيحة من مرشد عن التعويضات الحساسة، زي الديون المالية."
            ]
          }
        },
        {
          "id": "shopping_step_10",
          "step_number": 10,
          "description": {
            "en": "Continued to take personal inventory and when we were wrong promptly admitted it. Keep checking yourself every day. If you slip back into overspending, admit it right away. This keeps you honest and on track.",
            "ar": "واصلنا جرد أنفسنا الشخصي، وعندما كنا مخطئين اعترفنا بذلك فورًا. خليك دايمًا تراجع نفسك كل يوم. لو رجعت للإنفاق الزايد، اعترف على طول. ده بيخليك صادق ومستمر على الطريق الصح."
          },
          "relevance": {
            "en": "Shopping addiction can return if you’re not vigilant. This step ensures you stay aware of your spending habits and correct mistakes quickly.",
            "ar": "إدمان التسوق ممكن يرجع لو مش واخد بالك. الخطوة دي بتضمن إنك تفضل واعي بعاداتك في الإنفاق وتصلح الأخطاء بسرعة."
          },
          "practical_suggestions": {
            "en": [
              "Set a daily reminder to reflect on your spending choices.",
              "Track triggers that tempt you to shop in a journal.",
              "Practice quick apologies for small mistakes to build honesty."
            ],
            "ar": [
              "حط تذكير يومي عشان تراجع اختياراتك في الإنفاق.",
              "تابع المحفزات اللي بتغريك بالتسوق في دفتر.",
              "تدرب على الاعتذار السريع عن الأخطاء الصغيرة عشان تبني الصدق."
            ]
          }
        },
        {
          "id": "shopping_step_11",
          "step_number": 11,
          "description": {
            "en": "Sought through prayer and meditation to improve our conscious contact with Allah, praying only for knowledge of His will for us and the power to carry that out. Pray and reflect daily to stay close to Allah. Ask Him to guide you to healthy spending habits.",
            "ar": "سعينا من خلال الصلاة والتأمل لتحسين اتصالنا الواعي بالله، داعين فقط لمعرفة مشيئته لنا والقوة لتنفيذها. صلي وفكر كل يوم عشان تبقى قريب من الله. اطلب منه يهديك لعادات إنفاق صحية."
          },
          "relevance": {
            "en": "This step strengthens your faith in Allah, helping you resist overspending urges and stay committed to recovery.",
            "ar": "الخطوة دي بتقوي إيمانك بالله، وبتساعدك تقاوم رغبتك في الإنفاق الزايد وتفضل ملتزم بالتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Pray five times daily to maintain your connection with Allah.",
              "Practice quiet reflection to focus on Allah’s guidance for your spending.",
              "Join a religious study group to deepen your faith."
            ],
            "ar": [
              "صلي خمس مرات يوميًا عشان تحافظ على اتصالك بالله.",
              "مارس التفكير الهادي عشان تركز على هداية الله لإنفاقك.",
              "انضم لمجموعة دراسة دينية عشان تعمق إيمانك."
            ]
          }
        },
        {
          "id": "shopping_step_12",
          "step_number": 12,
          "description": {
            "en": "Having had a spiritual awakening as the result of these steps, we tried to carry this message to others struggling with shopping, and to practice these principles in all our affairs. You’ve changed with Allah’s help. Now, share your story and live these principles every day.",
            "ar": "بعد أن اختبرنا صحوة روحية نتيجة هذه الخطوات، حاولنا نقل هذه الرسالة لغيرنا من اللي بيعانوا مع التسوق، وممارسة هذه المبادئ في كل شؤوننا. إنت اتغيرت بمساعدة الله. دلوقتي، شارك قصتك وعيش المبادئ دي كل يوم."
          },
          "relevance": {
            "en": "This step is about helping others with shopping addiction and living a life guided by Allah’s principles to stay financially balanced.",
            "ar": "الخطوة دي عن مساعدة الناس اللي عندهم إدمان تسوق وإنك تعيش حياة بتهديها مبادئ الله عشان تبقى متوازن ماليًا."
          },
          "practical_suggestions": {
            "en": [
              "Share your recovery story at a support group to inspire others.",
              "Volunteer to support newcomers in recovery programs.",
              "Apply these principles (honesty, humility) in all areas of your life."
            ],
            "ar": [
              "شارك قصة تعافيك في مجموعة دعم عشان تلهم غيرك.",
              "تطوع عشان تساعد الناس الجدد في برامج التعافي.",
              "طبق المبادئ دي (الصدق، التواضع) في كل نواحي حياتك."
            ]
          }
        }
      ]
    },
    {
      "id": "work_addiction",
      "name": {
        "en": "Work Addiction",
        "ar": "إدمان العمل"
      },
      "steps": [
        {
          "id": "work_step_1",
          "step_number": 1,
          "description": {
            "en": "We admitted we were powerless over work—that our lives had become unmanageable. Look, work’s taken over your life, hasn’t it? You’re always at the office or thinking about it, and it’s hurting your health, family, and peace. Admitting you can’t control it is the first step to balance.",
            "ar": "اعترفنا بأننا عاجزون عن التحكم في العمل—وأن حياتنا أصبحت غير قابلة للإدارة. شوف، العمل سيطر على حياتك، مش كده؟ دايمًا في المكتب أو بتفكر فيه، وده بيضر صحتك، عيلتك، وراحتك. لما تعترف إنك مش قادر تتحكم فيه، دي أول خطوة للتوازن."
          },
          "relevance": {
            "en": "Work addiction thrives on the need to prove yourself through overworking. Admitting powerlessness breaks the cycle and opens the door to recovery.",
            "ar": "إدمان العمل بيعيش على الحاجة إنك تثبت نفسك من خلال العمل الزايد. الاعتراف بالعجز بيكسر الدايرة دي ويفتح الباب للتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Write down how overworking has affected your health, relationships, and personal time.",
              "Join a support group like Workaholics Anonymous to connect with others.",
              "Tell a trusted person about your struggle with work obsession."
            ],
            "ar": [
              "اكتب إزاي العمل الزايد أثر على صحتك، علاقاتك، ووقتك الشخصي.",
              "انضم لمجموعة دعم زي مدمني العمل المجهولين عشان تتواصل مع ناس زيك.",
              "كلم حد تثق فيه عن معاناتك مع هوس العمل."
            ]
          }
        },
        {
          "id": "work_step_2",
          "step_number": 2,
          "description": {
            "en": "Came to believe that faith in Allah could restore us to sanity. You’ve tried to cut back on work, but the urge to keep going is strong, right? This step is about trusting Allah to guide you to a balanced life where work doesn’t define you.",
            "ar": "آمنا بأن الإيمان بالله يمكنه أن يعيدنا إلى التعقل. حاولت تقلل العمل، بس الرغبة إنك تكمل قوية، مش كده؟ الخطوة دي عن إنك تثق إن الله يقدر يهديك لحياة متوازنة ما تكونش العمل هو اللي بيحددك."
          },
          "relevance": {
            "en": "Work addiction disrupts your balance and identity. Believing in Allah’s guidance gives you hope to find peace and purpose beyond work.",
            "ar": "إدمان العمل بيخلّي توازنك وهويتك يضيعوا. الإيمان بهداية الله بيديك أمل إنك تلاقي السلام والهدف خارج العمل."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily to Allah for strength to prioritize balance over work.",
              "Read the Quran to find inspiration for a meaningful life.",
              "Reflect on moments when faith helped you find calm outside of work."
            ],
            "ar": [
              "صلي كل يوم لله عشان يديك القوة تعطي أولوية للتوازن على العمل.",
              "اقرأ القرآن عشان تلاقي إلهام لحياة ليها معنى.",
              "فكر في لحظات الإيمان ساعدتك فيها تلاقي الهدوء برا العمل."
            ]
          }
        },
        {
          "id": "work_step_3",
          "step_number": 3,
          "description": {
            "en": "Made a decision to turn our will and our lives over to the care of Allah. This isn’t about quitting your job—it’s about trusting Allah’s plan to guide you to a healthier balance between work and life.",
            "ar": "اتخذنا قرارًا بأن نسلم إرادتنا وحياتنا لرعاية الله. مش معناها إنك تبطل شغلك—دي عن إنك تثق في خطة الله إنه يهديك لتوازن أصح بين العمل والحياة."
          },
          "relevance": {
            "en": "Work addiction comes from seeking validation through work. Surrendering to Allah’s will helps you find healthier ways to feel fulfilled.",
            "ar": "إدمان العمل بيجي من البحث عن القبول من خلال العمل. لما تسلم نفسك لمشيئة الله، ده بيساعدك تلاقي طرق أصح تحس فيها بالإشباع."
          },
          "practical_suggestions": {
            "en": [
              "Pray each morning to Allah to guide your work-life balance.",
              "Write a commitment to follow Allah’s guidance in your recovery.",
              "Find a quiet space to reflect on submitting to Allah’s will."
            ],
            "ar": [
              "صلي كل صبح لله عشان يهدي توازنك بين العمل والحياة.",
              "اكتب التزام إنك هتمشي ورا هداية الله في تعافيك.",
              "دور على مكان هادي تفكر فيه عن تسليم نفسك لمشيئة الله."
            ]
          }
        },
        {
          "id": "work_step_4",
          "step_number": 4,
          "description": {
            "en": "Made a searching and fearless moral inventory of ourselves. Be honest. Write down how overworking has hurt you and others—your health, your family, your friendships. It’s tough, but it shows you what needs fixing.",
            "ar": "عملنا جردًا أخلاقيًا دقيقًا وشجاعًا لأنفسنا. كن صادق. اكتب إزاي العمل الزايد ضرك وضر الناس—صحتك، عيلتك، أصحابك. صعب، بس بيوريك إيه لازم يتصلح."
          },
          "relevance": {
            "en": "This step helps you face the damage caused by work addiction, motivating you to prioritize balance and relationships.",
            "ar": "الخطوة دي بتساعدك تواجه الأذى اللي سببه إدمان العمل، وبتحفزك تعطي أولوية للتوازن والعلاقات."
          },
          "practical_suggestions": {
            "en": [
              "Journal about specific ways overworking has impacted your life.",
              "Ask a trusted friend to help you reflect on your actions without judgment.",
              "Organize your inventory by areas: health, relationships, personal time."
            ],
            "ar": [
              "اكتب في دفتر عن الطرق المحددة اللي العمل الزايد أثر بيها على حياتك.",
              "اطلب من صاحب تثق فيه يساعدك تفكر في تصرفاتك من غير حكم.",
              "نظم الجرد بتاعك حسب المجالات: الصحة، العلاقات، الوقت الشخصي."
            ]
          }
        },
        {
          "id": "work_step_5",
          "step_number": 5,
          "description": {
            "en": "Admitted to Allah, to ourselves, and to another human being the exact nature of our wrongs. Open up to someone you trust. Share the mistakes you wrote down about your work habits. Telling Allah and another person lifts the guilt and helps you heal.",
            "ar": "اعترفنا لله، ولأنفسنا، ولشخص آخر بالطبيعة الدقيقة لأخطائنا. افتح قلبك لواحد تثق فيه. شارك الأخطاء اللي كتبتها عن عاداتك في العمل. لما تحكي لله ولواحد تاني، ده بيخفف الذنب ويساعدك تشفى."
          },
          "relevance": {
            "en": "Work addiction often involves neglecting others. Sharing your wrongs with Allah and someone else builds honesty and accountability.",
            "ar": "إدمان العمل غالبًا بيجي مع إهمال الناس التانيين. لما تشارك أخطاءك مع الله ومع حد تاني، ده بيبني الصدق والمسؤولية."
          },
          "practical_suggestions": {
            "en": [
              "Choose a sponsor or trusted friend to share your inventory with.",
              "Pray to Allah for courage before opening up.",
              "Practice what you’ll say to keep it honest and clear."
            ],
            "ar": [
              "اختار مرشد أو صاحب تثق فيه عشان تشارك معاه الجرد بتاعك.",
              "صلي لله عشان يديك الشجاعة قبل ما تتكلم.",
              "تدرب على اللي هتقوله عشان يكون صادق وواضح."
            ]
          }
        },
        {
          "id": "work_step_6",
          "step_number": 6,
          "description": {
            "en": "Were entirely ready to have Allah remove all these defects of character. Overworking might come from flaws like perfectionism or fear of failure. This step is about being ready to let Allah take those away so you can live a balanced life.",
            "ar": "كنا مستعدين تمامًا لأن يزيل الله كل عيوب شخصيتنا. العمل الزايد ممكن يكون جاي من عيوب زي الكمالية أو الخوف من الفشل. الخطوة دي عن إنك تكون مستعد تخلي الله يزيل العيوب دي عشان تعيش حياة متوازنة."
          },
          "relevance": {
            "en": "Work addiction amplifies flaws that drive overworking. Being ready to let Allah remove them is key to finding balance.",
            "ar": "إدمان العمل بيزود العيوب اللي بتدفعك للعمل الزايد. لما تكون مستعد تخلي الله يزيلها، ده مفتاح لإيجاد التوازن."
          },
          "practical_suggestions": {
            "en": [
              "Reflect on triggers like stress that lead to overworking and pray for their removal.",
              "Write how your life would improve with better balance.",
              "Talk to a religious mentor about how faith can help you change."
            ],
            "ar": [
              "فكر في المحفزات زي التوتر اللي بتوديك للعمل الزايد وصلي عشان تتخلص منها.",
              "اكتب إزاي حياتك هتتحسن مع توازن أحسن.",
              "كلم مرشد ديني عن إزاي الإيمان يقدر يساعدك تتغير."
            ]
          }
        },
        {
          "id": "work_step_7",
          "step_number": 7,
          "description": {
            "en": "Humbly asked Allah to remove our shortcomings. Now, pray with sincerity. Ask Allah to take away the flaws that drive your overworking. Trust that He can help you find balance.",
            "ar": "طلبنا من الله بتواضع أن يزيل عيوبنا. دلوقتي، صلي بصدق. اطلب من الله يزيل العيوب اللي بتدفعك للعمل الزايد. ثق إنه قادر يساعدك تلاقي التوازن."
          },
          "relevance": {
            "en": "This step deepens your reliance on Allah to transform the behaviors that fuel work addiction, supporting your recovery.",
            "ar": "الخطوة دي بتعمق اعتمادك على الله عشان يغير السلوكيات اللي بتغذي إدمان العمل، وبتدعم تعافيك."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily for Allah to remove your flaws and guide your work habits.",
              "Keep a gratitude journal to focus on Allah’s blessings beyond work.",
              "Attend a mosque to feel connected to your faith community."
            ],
            "ar": [
              "صلي كل يوم عشان الله يزيل عيوبك ويهدي عاداتك في العمل.",
              "احتفظ بدفتر شكر تركز فيه على نعم الله برا العمل.",
              "روح المسجد عشان تحس بقربك من مجتمع الإيمان."
            ]
          }
        },
        {
          "id": "work_step_8",
          "step_number": 8,
          "description": {
            "en": "Made a list of all persons we had harmed, and became willing to make amends to them all. Think about everyone you’ve hurt because of your work obsession—maybe family you’ve neglected or friends you’ve ignored. Write their names and get ready to fix things.",
            "ar": "عملنا قائمة بكل الأشخاص اللي أذيناهم، وأصبحنا مستعدين لتعويضهم جميعًا. فكر في كل الناس اللي ضريتهم بسبب هوسك بالعمل—يمكن عيلتك اللي أهملتها أو أصحابك اللي تجاهلتهم. اكتب أساميهم واستعد تصلح الأمور."
          },
          "relevance": {
            "en": "Work addiction strains relationships by prioritizing work over people. This step helps you take responsibility and prepare to rebuild trust.",
            "ar": "إدمان العمل بيرهق العلاقات لأنك بتعطي أولوية للعمل على الناس. الخطوة دي بتساعدك تتحمل المسؤولية وتستعد تبني الثقة من جديد."
          },
          "practical_suggestions": {
            "en": [
              "List specific people you’ve wronged and how your work habits affected them.",
              "Reflect on how your actions hurt them to build empathy.",
              "Discuss your list with a sponsor to plan your amends."
            ],
            "ar": [
              "اكتب قايمة بالناس اللي ظلمتهم وإزاي عاداتك في العمل أثرت عليهم.",
              "فكر إزاي تصرفاتك ضرتهم عشان تبني تعاطف.",
              "ناقش القايمة مع مرشد عشان تخطط لتعويضاتك."
            ]
          }
        },
        {
          "id": "work_step_9",
          "step_number": 9,
          "description": {
            "en": "Made direct amends to such people wherever possible, except when to do so would injure them or others. Go to those people and apologize sincerely. Fix what you can, like spending more time with family, but don’t cause more harm.",
            "ar": "قدمنا تعويضات مباشرة لهؤلاء الأشخاص حيثما أمكن، إلا إذا كان ذلك سيؤذيهم أو غيرهم. روح للناس دي واعتذر بصدق. صلح اللي تقدر عليه، زي إنك تقضي وقت أكتر مع عيلتك، بس خلي بالك ما تسببش ضرر زيادة."
          },
          "relevance": {
            "en": "Making amends repairs relationships damaged by work addiction and helps you move forward with a clear conscience.",
            "ar": "الخطوة دي بتصلح العلاقات اللي اتضررت بسبب إدمان العمل وبتساعدك تكمل وإنت ضميرك مرتاح."
          },
          "practical_suggestions": {
            "en": [
              "Plan your apologies with sincerity and accountability.",
              "Start with small amends, like apologizing to a family member, to build confidence.",
              "Seek guidance from a mentor on sensitive amends."
            ],
            "ar": [
              "خطط لاعتذاراتك وخليك صادق ومسؤول.",
              "ابدأ بتعويضات صغيرة، زي الاعتذار لعيلتك، عشان تبني ثقتك.",
              "اطلب نصيحة من مرشد عن التعويضات الحساسة."
            ]
          }
        },
        {
          "id": "work_step_10",
          "step_number": 10,
          "description": {
            "en": "Continued to take personal inventory and when we were wrong promptly admitted it. Keep checking yourself every day. If you slip back into overworking, admit it right away. This keeps you honest and on track.",
            "ar": "واصلنا جرد أنفسنا الشخصي، وعندما كنا مخطئين اعترفنا بذلك فورًا. خليك دايمًا تراجع نفسك كل يوم. لو رجعت للعمل الزايد، اعترف على طول. ده بيخليك صادق ومستمر على الطريق الصح."
          },
          "relevance": {
            "en": "Work addiction can creep back if you’re not vigilant. This step ensures you stay aware of your work habits and correct mistakes quickly.",
            "ar": "إدمان العمل ممكن يرجع لو مش واخد بالك. الخطوة دي بتضمن إنك تفضل واعي بعاداتك في العمل وتصلح الأخطاء بسرعة."
          },
          "practical_suggestions": {
            "en": [
              "Set a daily reminder to reflect on your work-life balance.",
              "Track triggers that lead to overworking in a journal.",
              "Practice quick apologies for small mistakes to build honesty."
            ],
            "ar": [
              "حط تذكير يومي عشان تراجع توازنك بين العمل والحياة.",
              "تابع المحفزات اللي بتوديك للعمل الزايد في دفتر.",
              "تدرب على الاعتذار السريع عن الأخطاء الصغيرة عشان تبني الصدق."
            ]
          }
        },
        {
          "id": "work_step_11",
          "step_number": 11,
          "description": {
            "en": "Sought through prayer and meditation to improve our conscious contact with Allah, praying only for knowledge of His will for us and the power to carry that out. Pray and reflect daily to stay close to Allah. Ask Him to guide you to a balanced life.",
            "ar": "سعينا من خلال الصلاة والتأمل لتحسين اتصالنا الواعي بالله، داعين فقط لمعرفة مشيئته لنا والقوة لتنفيذها. صلي وفكر كل يوم عشان تبقى قريب من الله. اطلب منه يهديك لحياة متوازنة."
          },
          "relevance": {
            "en": "This step strengthens your faith in Allah, helping you resist the urge to overwork and stay committed to recovery.",
            "ar": "الخطوة دي بتقوي إيمانك بالله، وبتساعدك تقاوم رغبتك في العمل الزايد وتفضل ملتزم بالتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Pray five times daily to maintain your connection with Allah.",
              "Practice quiet reflection to focus on Allah’s guidance for balance.",
              "Join a religious study group to deepen your faith."
            ],
            "ar": [
              "صلي خمس مرات يوميًا عشان تحافظ على اتصالك بالله.",
              "مارس التفكير الهادي عشان تركز على هداية الله للتوازن.",
              "انضم لمجموعة دراسة دينية عشان تعمق إيمانك."
            ]
          }
        },
        {
          "id": "work_step_12",
          "step_number": 12,
          "description": {
            "en": "Having had a spiritual awakening as the result of these steps, we tried to carry this message to others struggling with work addiction, and to practice these principles in all our affairs. You’ve changed with Allah’s help. Now, share your story and live these principles every day.",
            "ar": "بعد أن اختبرنا صحوة روحية نتيجة هذه الخطوات، حاولنا نقل هذه الرسالة لغيرنا من اللي بيعانوا مع إدمان العمل، وممارسة هذه المبادئ في كل شؤوننا. إنت اتغيرت بمساعدة الله. دلوقتي، شارك قصتك وعيش المبادئ دي كل يوم."
          },
          "relevance": {
            "en": "This step is about helping others with work addiction and living a life guided by Allah’s principles to stay balanced.",
            "ar": "الخطوة دي عن مساعدة الناس اللي عندهم إدمان عمل وإنك تعيش حياة بتهديها مبادئ الله عشان تبقى متوازن."
          },
          "practical_suggestions": {
            "en": [
              "Share your recovery story at a support group to inspire others.",
              "Volunteer to support newcomers in recovery programs.",
              "Apply these principles (honesty, humility) in all areas of your life."
            ],
            "ar": [
              "شارك قصة تعافيك في مجموعة دعم عشان تلهم غيرك.",
              "تطوع عشان تساعد الناس الجدد في برامج التعافي.",
              "طبق المبادئ دي (الصدق، التواضع) في كل نواحي حياتك."
            ]
          }
        }
      ]
    },
    {
      "id": "internet_gaming_addiction",
      "name": {
        "en": "Internet/Gaming Addiction",
        "ar": "إدمان الإنترنت أو الألعاب الإلكترونية"
      },
      "steps": [
        {
          "id": "internet_gaming_step_1",
          "step_number": 1,
          "description": {
            "en": "We admitted we were powerless over the internet or gaming—that our lives had become unmanageable. The screen’s controlling you, isn’t it? Hours slip away, and it’s affecting your work, relationships, and health. Admitting you can’t control it is the first step to freedom.",
            "ar": "اعترفنا بأننا عاجزون عن التحكم في الإنترنت أو الألعاب—وأن حياتنا أصبحت غير قابلة للإدارة. الشاشة بتسيطر عليك، مش كده؟ الساعات بتعدي، وده بيأثر على شغلك، علاقاتك، وصحتك. لما تعترف إنك مش قادر تتحكم فيه، دي أول خطوة للحرية."
          },
          "relevance": {
            "en": "Internet/gaming addiction traps you in a cycle of escapism. Admitting powerlessness breaks the denial and opens the door to recovery.",
            "ar": "إدمان الإنترنت أو الألعاب بيحاصرك في دايرة الهروب. الاعتراف بالعجز بيكسر الإنكار ويفتح الباب للتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Write down how internet or gaming use has affected your life and responsibilities.",
              "Join a support group like Online Gamers Anonymous to connect with others.",
              "Tell a trusted person about your struggle with screen time."
            ],
            "ar": [
              "اكتب إزاي استخدام الإنترنت أو الألعاب أثر على حياتك ومسؤولياتك.",
              "انضم لمجموعة دعم زي مدمني الألعاب أونلاين المجهولين عشان تتواصل مع ناس زيك.",
              "كلم حد تثق فيه عن معاناتك مع وقت الشاشة."
            ]
          }
        },
        {
          "id": "internet_gaming_step_2",
          "step_number": 2,
          "description": {
            "en": "Came to believe that faith in Allah could restore us to sanity. You’ve tried cutting back on screen time, but the pull is strong, right? This step is about trusting Allah to guide you to a life where the internet doesn’t control you.",
            "ar": "آمنا بأن الإيمان بالله يمكنه أن يعيدنا إلى التعقل. حاولت تقلل وقت الشاشة، بس الجذب قوي، مش كده؟ الخطوة دي عن إنك تثق إن الله يقدر يهديك لحياة ما يكونش الإنترنت هو اللي بيسيطر عليك."
          },
          "relevance": {
            "en": "Internet/gaming addiction isolates you and clouds your priorities. Believing in Allah’s guidance gives you hope to reconnect with reality.",
            "ar": "إدمان الإنترنت أو الألعاب بيعزلك وبيشوش على أولوياتك. الإيمان بهداية الله بيديك أمل إنك ترجع تتواصل مع الواقع."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily to Allah for strength to limit screen time.",
              "Read the Quran to find inspiration for real-world connections.",
              "Reflect on moments when faith helped you focus on what matters."
            ],
            "ar": [
              "صلي كل يوم لله عشان يديك القوة تقلل وقت الشاشة.",
              "اقرأ القرآن عشان تلاقي إلهام للتواصل مع العالم الحقيقي.",
              "فكر في لحظات الإيمان ساعدتك فيها تركز على اللي يهم."
            ]
          }
        },
        {
          "id": "internet_gaming_step_3",
          "step_number": 3,
          "description": {
            "en": "Made a decision to turn our will and our lives over to the care of Allah. This isn’t about abandoning the internet—it’s about trusting Allah’s plan to guide you to a healthier balance with technology.",
            "ar": "اتخذنا قرارًا بأن نسلم إرادتنا وحياتنا لرعاية الله. مش معناها إنك تبطل الإنترنت—دي عن إنك تثق في خطة الله إنه يهديك لتوازن أصح مع التكنولوجيا."
          },
          "relevance": {
            "en": "Internet/gaming addiction feeds on escapism. Surrendering to Allah’s will helps you find healthier ways to cope and connect.",
            "ar": "إدمان الإنترنت أو الألعاب بيتغذى على الهروب. لما تسلم نفسك لمشيئة الله، ده بيساعدك تلاقي طرق أصح تتعامل وتتواصل بيها."
          },
          "practical_suggestions": {
            "en": [
              "Pray each morning to Allah to guide your technology use.",
              "Write a commitment to follow Allah’s guidance in your recovery.",
              "Find a quiet space to reflect on submitting to Allah’s will."
            ],
            "ar": [
              "صلي كل صبح لله عشان يهدي استخدامك للتكنولوجيا.",
              "اكتب التزام إنك هتمشي ورا هداية الله في تعافيك.",
              "دور على مكان هادي تفكر فيه عن تسليم نفسك لمشيئة الله."
            ]
          }
        },
        {
          "id": "internet_gaming_step_4",
          "step_number": 4,
          "description": {
            "en": "Made a searching and fearless moral inventory of ourselves. Be honest. Write down how excessive screen time has hurt you and others—your relationships, work, or health. It’s tough, but it shows you what needs to change.",
            "ar": "عملنا جردًا أخلاقيًا دقيقًا وشجاعًا لأنفسنا. كن صادق. اكتب إزاي وقت الشاشة الزايد ضرك و ضر الناس—علاقاتك، شغلك، أو صحتك. صعب، بس بيوريك إيه لازم يتغير."
          },
          "relevance": {
            "en": "This step helps you face the damage caused by internet/gaming addiction, motivating you to regain control of your time.",
            "ar": "الخطوة دي بتساعدك تواجه الأذى اللي سببه إدمان الإنترنت أو الألعاب، وبتحفزك ترجع تسيطر على وقتك."
          },
          "practical_suggestions": {
            "en": [
              "Journal about specific ways excessive screen time has impacted your life.",
              "Ask a trusted friend to help you reflect on your actions.",
              "Organize your inventory by areas: relationships, work, health."
            ],
            "ar": [
              "اكتب في دفتر عن الطرق المحددة اللي وقت الشاشة الزايد أثر بيها على حياتك.",
              "اطلب من صاحب تثق فيه يساعدك تفكر في تصرفاتك.",
              "نظم الجرد بتاعك حسب المجالات: العلاقات، الشغل، الصحة."
            ]
          }
        },
        {
          "id": "internet_gaming_step_5",
          "step_number": 5,
          "description": {
            "en": "Admitted to Allah, to ourselves, and to another human being the exact nature of our wrongs. Open up to someone you trust. Share the mistakes you wrote down about your internet or gaming habits. Telling Allah and another person lifts the shame and helps you heal.",
            "ar": "اعترفنا لله، ولأنفسنا، ولشخص آخر بالطبيعة الدقيقة لأخطائنا. افتح قلبك لواحد تثق فيه. شارك الأخطاء اللي كتبتها عن عاداتك في الإنترنت أو الألعاب. لما تحكي لله ولواحد تاني، ده بيخفف العار ويساعدك تشفى."
          },
          "relevance": {
            "en": "Internet/gaming addiction often involves secrecy and isolation. Sharing your wrongs with Allah and someone else builds honesty and connection.",
            "ar": "إدمان الإنترنت أو الألعاب غالبًا بيجي مع الأسرار والعزلة. لما تشارك أخطاءك مع الله ومع حد تاني، ده بيبني الصدق والتواصل."
          },
          "practical_suggestions": {
            "en": [
              "Choose a sponsor or trusted friend to share your inventory with.",
              "Pray to Allah for courage before opening up.",
              "Practice what you’ll say to keep it honest and clear."
            ],
            "ar": [
              "اختار مرشد أو صاحب تثق فيه عشان تشارك معاه الجرد بتاعك.",
              "صلي لله عشان يديك الشجاعة قبل ما تتكلم.",
              "تدرب على اللي هتقوله عشان يكون صادق وواضح."
            ]
          }
        },
        {
          "id": "internet_gaming_step_6",
          "step_number": 6,
          "description": {
            "en": "Were entirely ready to have Allah remove all these defects of character. Excessive screen time might come from flaws like avoidance or seeking escape. This step is about being ready to let Allah take those away so you can live a fuller life.",
            "ar": "كنا مستعدين تمامًا لأن يزيل الله كل عيوب شخصيتنا. وقت الشاشة الزايد ممكن يكون جاي من عيوب زي الهروب أو البحث عن التشتت. الخطوة دي عن إنك تكون مستعد تخلي الله يزيل العيوب دي عشان تعيش حياة أكمل."
          },
          "relevance": {
            "en": "Internet/gaming addiction amplifies escapist tendencies. Being ready to let Allah remove them is key to reconnecting with reality.",
            "ar": "إدمان الإنترنت أو الألعاب بيزود ميول الهروب. لما تكون مستعد تخلي الله يزيلها، ده مفتاح عشان ترجع تتواصل مع الواقع."
          },
          "practical_suggestions": {
            "en": [
              "Reflect on triggers like boredom that lead to excessive screen time and pray for their removal.",
              "Write how your life would improve with less internet use.",
              "Talk to a religious mentor about how faith can help you change."
            ],
            "ar": [
              "فكر في المحفزات زي الملل اللي بتوديك لوقت شاشة زايد وصلي عشان تتخلص منها.",
              "اكتب إزاي حياتك هتتحسن مع استخدام إنترنت أقل.",
              "كلم مرشد ديني عن إزاي الإيمان يقدر يساعدك تتغير."
            ]
          }
        },
        {
          "id": "internet_gaming_step_7",
          "step_number": 7,
          "description": {
            "en": "Humbly asked Allah to remove our shortcomings. Now, pray with sincerity. Ask Allah to take away the flaws that drive your excessive screen time. Trust that He can help you change.",
            "ar": "طلبنا من الله بتواضع أن يزيل عيوبنا. دلوقتي، صلي بصدق. اطلب من الله يزيل العيوب اللي بتدفعك لوقت الشاشة الزايد. ثق إنه قادر يساعدك تتغير."
          },
          "relevance": {
            "en": "This step deepens your reliance on Allah to transform the behaviors that fuel internet/gaming addiction, supporting your recovery.",
            "ar": "الخطوة دي بتعمق اعتمادك على الله عشان يغير السلوكيات اللي بتغذي إدمان الإنترنت أو الألعاب، وبتدعم تعافيك."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily for Allah to remove your flaws and guide your screen habits.",
              "Keep a gratitude journal to focus on Allah’s blessings beyond screens.",
              "Attend a mosque to feel connected to your faith community."
            ],
            "ar": [
              "صلي كل يوم عشان الله يزيل عيوبك ويهدي عاداتك مع الشاشة.",
              "احتفظ بدفتر شكر تركز فيه على نعم الله برا الشاشات.",
              "روح المسجد عشان تحس بقربك من مجتمع الإيمان."
            ]
          }
        },
        {
          "id": "internet_gaming_step_8",
          "step_number": 8,
          "description": {
            "en": "Made a list of all persons we had harmed, and became willing to make amends to them all. Think about everyone you’ve hurt because of your screen time—family you’ve ignored or responsibilities you’ve neglected. Write their names and get ready to fix things.",
            "ar": "عملنا قائمة بكل الأشخاص اللي أذيناهم، وأصبحنا مستعدين لتعويضهم جميعًا. فكر في كل الناس اللي ضريتهم بسبب وقت الشاشة—عيلتك اللي تجاهلتها أو مسؤولياتك اللي أهملتها. اكتب أساميهم واستعد تصلح الأمور."
          },
          "relevance": {
            "en": "Internet/gaming addiction isolates you from others. This step helps you take responsibility and prepare to rebuild relationships.",
            "ar": "إدمان الإنترنت أو الألعاب بيعزلك عن الناس. الخطوة دي بتساعدك تتحمل المسؤولية وتستعد تبني العلاقات من جديد."
          },
          "practical_suggestions": {
            "en": [
              "List specific people you’ve wronged and how your screen time affected them.",
              "Reflect on how your actions hurt them to build empathy.",
              "Discuss your list with a sponsor to plan your amends."
            ],
            "ar": [
              "اكتب قايمة بالناس اللي ظلمتهم وإزاي وقت الشاشة أثر عليهم.",
              "فكر إزاي تصرفاتك ضرتهم عشان تبني تعاطف.",
              "ناقش القايمة مع مرشد عشان تخطط لتعويضاتك."
            ]
          }
        },
        {
          "id": "internet_gaming_step_9",
          "step_number": 9,
          "description": {
            "en": "Made direct amends to such people wherever possible, except when to do so would injure them or others. Go to those people and apologize sincerely. Fix what you can, like spending time with family, but don’t cause more harm.",
            "ar": "قدمنا تعويضات مباشرة لهؤلاء الأشخاص حيثما أمكن، إلا إذا كان ذلك سيؤذيهم أو غيرهم. روح للناس دي واعتذر بصدق. صلح اللي تقدر عليه، زي إنك تقضي وقت مع عيلتك، بس خلي بالك ما تسببش ضرر زيادة."
          },
          "relevance": {
            "en": "Making amends repairs relationships damaged by internet/gaming addiction and helps you move forward with a clear conscience.",
            "ar": "الخطوة دي بتصلح العلاقات اللي اتضررت بسبب إدمان الإنترنت أو الألعاب وبتساعدك تكمل وإنت ضميرك مرتاح."
          },
          "practical_suggestions": {
            "en": [
              "Plan your apologies with sincerity and accountability.",
              "Start with small amends, like apologizing to a family member, to build confidence.",
              "Seek guidance from a mentor on sensitive amends."
            ],
            "ar": [
              "خطط لاعتذاراتك وخليك صادق ومسؤول.",
              "ابدأ بتعويضات صغيرة، زي الاعتذار لعيلتك، عشان تبني ثقتك.",
              "اطلب نصيحة من مرشد عن التعويضات الحساسة."
            ]
          }
        },
        {
          "id": "internet_gaming_step_10",
          "step_number": 10,
          "description": {
            "en": "Continued to take personal inventory and when we were wrong promptly admitted it. Keep checking yourself every day. If you slip back into excessive screen time, admit it right away. This keeps you honest and on track.",
            "ar": "واصلنا جرد أنفسنا الشخصي، وعندما كنا مخطئين اعترفنا بذلك فورًا. خليك دايمًا تراجع نفسك كل يوم. لو رجعت لوقت شاشة زايد، اعترف على طول. ده بيخليك صادق ومستمر على الطريق الصح."
          },
          "relevance": {
            "en": "Internet/gaming addiction can return if you’re not vigilant. This step ensures you stay aware of your screen habits and correct mistakes quickly.",
            "ar": "إدمان الإنترنت أو الألعاب ممكن يرجع لو مش واخد بالك. الخطوة دي بتضمن إنك تفضل واعي بعاداتك مع الشاشة وتصلح الأخطاء بسرعة."
          },
          "practical_suggestions": {
            "en": [
              "Set a daily reminder to reflect on your screen time.",
              "Track triggers that lead to excessive internet use in a journal.",
              "Practice quick apologies for small mistakes to build honesty."
            ],
            "ar": [
              "حط تذكير يومي عشان تراجع وقت الشاشة بتاعك.",
              "تابع المحفزات اللي بتوديك لاستخدام إنترنت زايد في دفتر.",
              "تدرب على الاعتذار السريع عن الأخطاء الصغيرة عشان تبني الصدق."
            ]
          }
        },
        {
          "id": "internet_gaming_step_11",
          "step_number": 11,
          "description": {
            "en": "Sought through prayer and meditation to improve our conscious contact with Allah, praying only for knowledge of His will for us and the power to carry that out. Pray and reflect daily to stay close to Allah. Ask Him to guide you to healthy screen habits.",
            "ar": "سعينا من خلال الصلاة والتأمل لتحسين اتصالنا الواعي بالله، داعين فقط لمعرفة مشيئته لنا والقوة لتنفيذها. صلي وفكر كل يوم عشان تبقى قريب من الله. اطلب منه يهديك لعادات شاشة صحية."
          },
          "relevance": {
            "en": "This step strengthens your faith in Allah, helping you resist excessive screen time and stay committed to recovery.",
            "ar": "الخطوة دي بتقوي إيمانك بالله، وبتساعدك تقاوم وقت الشاشة الزايد وتفضل ملتزم بالتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Pray five times daily to maintain your connection with Allah.",
              "Practice quiet reflection to focus on Allah’s guidance for screen use.",
              "Join a religious study group to deepen your faith."
            ],
            "ar": [
              "صلي خمس مرات يوميًا عشان تحافظ على اتصالك بالله.",
              "مارس التفكير الهادي عشان تركز على هداية الله لاستخدام الشاشة.",
              "انضم لمجموعة دراسة دينية عشان تعمق إيمانك."
            ]
          }
        },
        {
          "id": "internet_gaming_step_12",
          "step_number": 12,
          "description": {
            "en": "Having had a spiritual awakening as the result of these steps, we tried to carry this message to others struggling with internet or gaming addiction, and to practice these principles in all our affairs. You’ve changed with Allah’s help. Now, share your story and live these principles every day.",
            "ar": "بعد أن اختبرنا صحوة روحية نتيجة هذه الخطوات، حاولنا نقل هذه الرسالة لغيرنا من اللي بيعانوا مع إدمان الإنترنت أو الألعاب، وممارسة هذه المبادئ في كل شؤوننا. إنت اتغيرت بمساعدة الله. دلوقتي، شارك قصتك وعيش المبادئ دي كل يوم."
          },
          "relevance": {
            "en": "This step is about helping others with internet/gaming addiction and living a life guided by Allah’s principles to stay balanced.",
            "ar": "الخطوة دي عن مساعدة الناس اللي عندهم إدمان إنترنت أو ألعاب وإنك تعيش حياة بتهديها مبادئ الله عشان تبقى متوازن."
          },
          "practical_suggestions": {
            "en": [
              "Share your recovery story at a support group to inspire others.",
              "Volunteer to support newcomers in recovery programs.",
              "Apply these principles (honesty, humility) in all areas of your life."
            ],
            "ar": [
              "شارك قصة تعافيك في مجموعة دعم عشان تلهم غيرك.",
              "تطوع عشان تساعد الناس الجدد في برامج التعافي.",
              "طبق المبادئ دي (الصدق، التواضع) في كل نواحي حياتك."
            ]
          }
        }
      ]
    },
    {
      "id": "depression_addiction",
      "name": {
        "en": "Depression Related to Addiction",
        "ar": "الاكتئاب المرتبط بالإدمان"
      },
      "steps": [
        {
          "id": "depression_addiction_step_1",
          "step_number": 1,
          "description": {
            "en": "We admitted we were powerless over our depression and addiction—that our lives had become unmanageable. It feels heavy, doesn’t it? The sadness and the addiction feed each other, making everything harder. Admitting you can’t control it alone is the first step to healing.",
            "ar": "اعترفنا بأننا عاجزون عن التحكم في اكتئابنا وإدماننا—وأن حياتنا أصبحت غير قابلة للإدارة. إحساس تقيل، مش كده؟ الحزن والإدمان بيغذوا بعض، وبيخلوا كل حاجة أصعب. لما تعترف إنك مش قادر تتحكم لوحدك، دي أول خطوة للشفاء."
          },
          "relevance": {
            "en": "Depression and addiction create a vicious cycle. Admitting powerlessness breaks the denial and opens the door to recovery.",
            "ar": "الاكتئاب والإدمان بيعملوا دايرة شريرة. الاعتراف بالعجز بيكسر الإنكار ويفتح الباب للتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Write down how depression and addiction have affected your life and relationships.",
              "Join a support group like Emotions Anonymous to connect with others.",
              "Tell a trusted person about your struggles with sadness and addiction."
            ],
            "ar": [
              "اكتب إزاي الاكتئاب والإدمان أثروا على حياتك وعلاقاتك.",
              "انضم لمجموعة دعم زي العواطف المجهولين عشان تتواصل مع ناس زيك.",
              "كلم حد تثق فيه عن معاناتك مع الحزن والإدمان."
            ]
          }
        },
        {
          "id": "depression_addiction_step_2",
          "step_number": 2,
          "description": {
            "en": "Came to believe that faith in Allah could restore us to sanity. You’ve tried to shake off the sadness and addiction, but it’s tough, right? This step is about trusting Allah to guide you to a lighter, healthier life.",
            "ar": "آمنا بأن الإيمان بالله يمكنه أن يعيدنا إلى التعقل. حاولت تتخلص من الحزن والإدمان، بس صعب، مش كده؟ الخطوة دي عن إنك تثق إن الله يقدر يهديك لحياة أخف وأصح."
          },
          "relevance": {
            "en": "Depression and addiction cloud your hope and clarity. Believing in Allah’s guidance offers a path to emotional and spiritual recovery.",
            "ar": "الاكتئاب والإدمان بيشوشوا على أملك ووضوحك. الإيمان بهداية الله بيديك طريق للتعافي العاطفي والروحي."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily to Allah for strength to face your sadness and addiction.",
              "Read the Quran to find comfort and inspiration.",
              "Reflect on moments when faith lifted your spirits."
            ],
            "ar": [
              "صلي كل يوم لله عشان يديك القوة تواجه حزنك وإدمانك.",
              "اقرأ القرآن عشان تلاقي راحة وإلهام.",
              "فكر في لحظات الإيمان رفعت فيها معنوياتك."
            ]
          }
        },
        {
          "id": "depression_addiction_step_3",
          "step_number": 3,
          "description": {
            "en": "Made a decision to turn our will and our lives over to the care of Allah. This isn’t about giving up—it’s about trusting Allah’s plan to guide you through the darkness of depression and addiction to a better place.",
            "ar": "اتخذنا قرارًا بأن نسلم إرادتنا وحياتنا لرعاية الله. مش معناها إنك بتستسلم—دي عن إنك تثق في خطة الله إنه يهديك من ظلمة الاكتئاب والإدمان لمكان أحسن."
          },
          "relevance": {
            "en": "Depression and addiction thrive on despair. Surrendering to Allah’s will helps you find hope and healthier ways to cope.",
            "ar": "الاكتئاب والإدمان بيعيشوا على اليأس. لما تسلم نفسك لمشيئة الله، ده بيساعدك تلاقي أمل وطرق أصح تتعامل بيها."
          },
          "practical_suggestions": {
            "en": [
              "Pray each morning to Allah to guide you through your struggles.",
              "Write a commitment to follow Allah’s guidance in your recovery.",
              "Find a quiet space to reflect on submitting to Allah’s will."
            ],
            "ar": [
              "صلي كل صبح لله عشان يهديك في معاناتك.",
              "اكتب التزام إنك هتمشي ورا هداية الله في تعافيك.",
              "دور على مكان هادي تفكر فيه عن تسليم نفسك لمشيئة الله."
            ]
          }
        },
        {
          "id": "depression_addiction_step_4",
          "step_number": 4,
          "description": {
            "en": "Made a searching and fearless moral inventory of ourselves. Be honest with yourself. Write down how your depression and addiction have hurt you and others—your relationships, your responsibilities, your self-worth. It’s heavy, but it shows you what needs healing.",
            "ar": "عملنا جردًا أخلاقيًا دقيقًا وشجاعًا لأنفسنا. كن صادق مع نفسك. اكتب إزاي اكتئابك وإدمانك ضرك و ضر الناس—علاقاتك، مسؤولياتك، قيمتك بنفسك. تقيل، بس بيوريك إيه لازم يتشافى."
          },
          "relevance": {
            "en": "This step helps you face the damage caused by depression and addiction, motivating you to seek healing and change.",
            "ar": "الخطوة دي بتساعدك تواجه الأذى اللي سببه الاكتئاب والإدمان، وبتحفزك تدور على الشفاء والتغيير."
          },
          "practical_suggestions": {
            "en": [
              "Journal about specific ways depression and addiction have impacted your life.",
              "Ask a trusted friend to help you reflect on your actions without judgment.",
              "Organize your inventory by areas: relationships, responsibilities, emotions."
            ],
            "ar": [
              "اكتب في دفتر عن الطرق المحددة اللي الاكتئاب والإدمان أثروا بيها على حياتك.",
              "اطلب من صاحب تثق فيه يساعدك تفكر في تصرفاتك من غير حكم.",
              "نظم الجرد بتاعك حسب المجالات: العلاقات، المسؤوليات، المشاعر."
            ]
          }
        },
        {
          "id": "depression_addiction_step_5",
          "step_number": 5,
          "description": {
            "en": "Admitted to Allah, to ourselves, and to another human being the exact nature of our wrongs. Open up to someone you trust. Share the mistakes you wrote down about your depression and addiction. Telling Allah and another person lifts the shame and helps you heal.",
            "ar": "اعترفنا لله، ولأنفسنا، ولشخص آخر بالطبيعة الدقيقة لأخطائنا. افتح قلبك لواحد تثق فيه. شارك الأخطاء اللي كتبتها عن اكتئابك وإدمانك. لما تحكي لله ولواحد تاني، ده بيخفف العار ويساعدك تشفى."
          },
          "relevance": {
            "en": "Depression and addiction often involve guilt and isolation. Sharing your wrongs with Allah and someone else builds honesty and connection.",
            "ar": "الاكتئاب والإدمان غالبًا بيجوا مع الذنب والعزلة. لما تشارك أخطاءك مع الله ومع حد تاني، ده بيبني الصدق والتواصل."
          },
          "practical_suggestions": {
            "en": [
              "Choose a sponsor or trusted friend to share your inventory with.",
              "Pray to Allah for courage before opening up.",
              "Practice what you’ll say to keep it honest and clear."
            ],
            "ar": [
              "اختار مرشد أو صاحب تثق فيه عشان تشارك معاه الجرد بتاعك.",
              "صلي لله عشان يديك الشجاعة قبل ما تتكلم.",
              "تدرب على اللي هتقوله عشان يكون صادق وواضح."
            ]
          }
        },
        {
          "id": "depression_addiction_step_6",
          "step_number": 6,
          "description": {
            "en": "Were entirely ready to have Allah remove all these defects of character. Your depression and addiction might come from flaws like hopelessness or avoidance. This step is about being ready to let Allah take those away so you can find peace.",
            "ar": "كنا مستعدين تمامًا لأن يزيل الله كل عيوب شخصيتنا. اكتئابك وإدمانك ممكن يكونوا جايين من عيوب زي اليأس أو الهروب. الخطوة دي عن إنك تكون مستعد تخلي الله يزيل العيوب دي عشان تلاقي السلام."
          },
          "relevance": {
            "en": "Depression and addiction amplify negative traits. Being ready to let Allah remove them is key to emotional and spiritual healing.",
            "ar": "الاكتئاب والإدمان بيزودوا الصفات السلبية. لما تكون مستعد تخلي الله يزيلها، ده مفتاح للشفاء العاطفي والروحي."
          },
          "practical_suggestions": {
            "en": [
              "Reflect on emotional triggers like hopelessness that fuel your struggles and pray for their removal.",
              "Write how your life would improve without these flaws.",
              "Talk to a religious mentor about how faith can help you change."
            ],
            "ar": [
              "فكر في المحفزات العاطفية زي اليأس اللي بتغذي معاناتك وصلي عشان تتخلص منها.",
              "اكتب إزاي حياتك هتتحسن من غير العيوب دي.",
              "كلم مرشد ديني عن إزاي الإيمان يقدر يساعدك تتغير."
            ]
          }
        },
        {
          "id": "depression_addiction_step_7",
          "step_number": 7,
          "description": {
            "en": "Humbly asked Allah to remove our shortcomings. Now, pray with sincerity. Ask Allah to take away the flaws that drive your depression and addiction. Trust that He can help you heal.",
            "ar": "طلبنا من الله بتواضع أن يزيل عيوبنا. دلوقتي، صلي بصدق. اطلب من الله يزيل العيوب اللي بتدفعك لاكتئابك وإدمانك. ثق إنه قادر يساعدك تشفى."
          },
          "relevance": {
            "en": "This step deepens your reliance on Allah to transform the behaviors that fuel depression and addiction, supporting your recovery.",
            "ar": "الخطوة دي بتعمق اعتمادك على الله عشان يغير السلوكيات اللي بتغذي الاكتئاب والإدمان، وبتدعم تعافيك."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily for Allah to remove your flaws and guide your emotional healing.",
              "Keep a gratitude journal to focus on Allah’s blessings.",
              "Attend a mosque to feel connected to your faith community."
            ],
            "ar": [
              "صلي كل يوم عشان الله يزيل عيوبك ويهدي شفاءك العاطفي.",
              "احتفظ بدفتر شكر تركز فيه على نعم الله.",
              "روح المسجد عشان تحس بقربك من مجتمع الإيمان."
            ]
          }
        },
        {
          "id": "depression_addiction_step_8",
          "step_number": 8,
          "description": {
            "en": "Made a list of all persons we had harmed, and became willing to make amends to them all. Think about everyone you’ve hurt because of your depression and addiction—maybe family you’ve pushed away or responsibilities you’ve neglected. Write their names and get ready to fix things.",
            "ar": "عملنا قائمة بكل الأشخاص اللي أذيناهم، وأصبحنا مستعدين لتعويضهم جميعًا. فكر في كل الناس اللي ضريتهم بسبب اكتئابك وإدمانك—يمكن عيلتك اللي بعدت عنها أو مسؤولياتك اللي أهملتها. اكتب أساميهم واستعد تصلح الأمور."
          },
          "relevance": {
            "en": "Depression and addiction can strain relationships. This step helps you take responsibility and prepare to rebuild trust.",
            "ar": "الاكتئاب والإدمان بيرهقوا العلاقات. الخطوة دي بتساعدك تتحمل المسؤولية وتستعد تبني الثقة من جديد."
          },
          "practical_suggestions": {
            "en": [
              "List specific people you’ve wronged and how your struggles affected them.",
              "Reflect on how your actions hurt them to build empathy.",
              "Discuss your list with a sponsor to plan your amends."
            ],
            "ar": [
              "اكتب قايمة بالناس اللي ظلمتهم وإزاي معاناتك أثرت عليهم.",
              "فكر إزاي تصرفاتك ضرتهم عشان تبني تعاطف.",
              "ناقش القايمة مع مرشد عشان تخطط لتعويضاتك."
            ]
          }
        },
        {
          "id": "depression_addiction_step_9",
          "step_number": 9,
          "description": {
            "en": "Made direct amends to such people wherever possible, except when to do so would injure them or others. Go to those people and apologize sincerely. Fix what you can, like reconnecting with family, but don’t cause more harm.",
            "ar": "قدمنا تعويضات مباشرة لهؤلاء الأشخاص حيثما أمكن، إلا إذا كان ذلك سيؤذيهم أو غيرهم. روح للناس دي واعتذر بصدق. صلح اللي تقدر عليه، زي إنك ترجع تتواصل مع عيلتك، بس خلي بالك ما تسببش ضرر زيادة."
          },
          "relevance": {
            "en": "Making amends repairs relationships damaged by depression and addiction and helps you move forward with a clear conscience.",
            "ar": "الخطوة دي بتصلح العلاقات اللي اتضررت بسبب الاكتئاب والإدمان وبتساعدك تكمل وإنت ضميرك مرتاح."
          },
          "practical_suggestions": {
            "en": [
              "Plan your apologies with sincerity and accountability.",
              "Start with small amends, like apologizing to a friend, to build confidence.",
              "Seek guidance from a mentor on sensitive amends."
            ],
            "ar": [
              "خطط لاعتذاراتك وخليك صادق ومسؤول.",
              "ابدأ بتعويضات صغيرة، زي الاعتذار لصاحب، عشان تبني ثقتك.",
              "اطلب نصيحة من مرشد عن التعويضات الحساسة."
            ]
          }
        },
        {
          "id": "depression_addiction_step_10",
          "step_number": 10,
          "description": {
            "en": "Continued to take personal inventory and when we were wrong promptly admitted it. Keep checking yourself every day. If you slip back into depressive or addictive behaviors, admit it right away. This keeps you honest and on track.",
            "ar": "واصلنا جرد أنفسنا الشخصي، وعندما كنا مخطئين اعترفنا بذلك فورًا. خليك دايمًا تراجع نفسك كل يوم. لو رجعت لسلوكيات اكتئابية أو إدمانية، اعترف على طول. ده بيخليك صادق ومستمر على الطريق الصح."
          },
          "relevance": {
            "en": "Depression and addiction can resurface if you’re not vigilant. This step ensures you stay aware of your behaviors and correct mistakes quickly.",
            "ar": "الاكتئاب والإدمان ممكن يرجعوا لو مش واخد بالك. الخطوة دي بتضمن إنك تفضل واعي بسلوكياتك وتصلح الأخطاء بسرعة."
          },
          "practical_suggestions": {
            "en": [
              "Set a daily reminder to reflect on your emotional and addictive behaviors.",
              "Track triggers that lead to depression or addiction in a journal.",
              "Practice quick apologies for small mistakes to build honesty."
            ],
            "ar": [
              "حط تذكير يومي عشان تراجع سلوكياتك العاطفية والإدمانية.",
              "تابع المحفزات اللي بتوديك للاكتئاب أو الإدمان في دفتر.",
              "تدرب على الاعتذار السريع عن الأخطاء الصغيرة عشان تبني الصدق."
            ]
          }
        },
        {
          "id": "depression_addiction_step_11",
          "step_number": 11,
          "description": {
            "en": "Sought through prayer and meditation to improve our conscious contact with Allah, praying only for knowledge of His will for us and the power to carry that out. Pray and reflect daily to stay close to Allah. Ask Him to guide you to emotional stability.",
            "ar": "سعينا من خلال الصلاة والتأمل لتحسين اتصالنا الواعي بالله، داعين فقط لمعرفة مشيئته لنا والقوة لتنفيذها. صلي وفكر كل يوم عشان تبقى قريب من الله. اطلب منه يهديك للاستقرار العاطفي."
          },
          "relevance": {
            "en": "This step strengthens your faith in Allah, helping you resist depressive and addictive urges and stay committed to recovery.",
            "ar": "الخطوة دي بتقوي إيمانك بالله، وبتساعدك تقاوم رغبتك في الاكتئاب والإدمان وتفضل ملتزم بالتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Pray five times daily to maintain your connection with Allah.",
              "Practice quiet reflection to focus on Allah’s guidance for emotional health.",
              "Join a religious study group to deepen your faith."
            ],
            "ar": [
              "صلي خمس مرات يوميًا عشان تحافظ على اتصالك بالله.",
              "مارس التفكير الهادي عشان تركز على هداية الله لصحتك العاطفية.",
              "انضم لمجموعة دراسة دينية عشان تعمق إيمانك."
            ]
          }
        },
        {
          "id": "depression_addiction_step_12",
          "step_number": 12,
          "description": {
            "en": "Having had a spiritual awakening as the result of these steps, we tried to carry this message to others struggling with depression and addiction, and to practice these principles in all our affairs. You’ve changed with Allah’s help. Now, share your story and live these principles every day.",
            "ar": "بعد أن اختبرنا صحوة روحية نتيجة هذه الخطوات، حاولنا نقل هذه الرسالة لغيرنا من اللي بيعانوا مع الاكتئاب والإدمان، وممارسة هذه المبادئ في كل شؤوننا. إنت اتغيرت بمساعدة الله. دلوقتي، شارك قصتك وعيش المبادئ دي كل يوم."
          },
          "relevance": {
            "en": "This step is about helping others with depression and addiction and living a life guided by Allah’s principles to stay emotionally balanced.",
            "ar": "الخطوة دي عن مساعدة الناس اللي عندهم اكتئاب وإدمان وإنك تعيش حياة بتهديها مبادئ الله عشان تبقى متوازن عاطفيًا."
          },
          "practical_suggestions": {
            "en": [
              "Share your recovery story at a support group to inspire others.",
              "Volunteer to support newcomers in recovery programs.",
              "Apply these principles (honesty, humility) in all areas of your life."
            ],
            "ar": [
              "شارك قصة تعافيك في مجموعة دعم عشان تلهم غيرك.",
              "تطوع عشان تساعد الناس الجدد في برامج التعافي.",
              "طبق المبادئ دي (الصدق، التواضع) في كل نواحي حياتك."
            ]
          }
        }
      ]
    },
    {
      "id": "anxiety_addiction",
      "name": {
        "en": "Anxiety Related to Addiction",
        "ar": "القلق المرتبط بالإدمان"
      },
      "steps": [
        {
          "id": "anxiety_addiction_step_1",
          "step_number": 1,
          "description": {
            "en": "We admitted we were powerless over our anxiety and addiction—that our lives had become unmanageable. The worry and the addiction are overwhelming, aren’t they? They feed off each other, making life feel chaotic. Admitting you can’t control it alone is the first step to peace.",
            "ar": "اعترفنا بأننا عاجزون عن التحكم في قلقنا وإدماننا—وأن حياتنا أصبحت غير قابلة للإدارة. القلق والإدمان بيرهقوك، مش كده؟ بيغذوا بعض وبيخلوا الحياة تبقى فوضى. لما تعترف إنك مش قادر تتحكم لوحدك، دي أول خطوة للسلام."
          },
          "relevance": {
            "en": "Anxiety and addiction create a cycle of fear and dependency. Admitting powerlessness breaks the denial and opens the door to recovery.",
            "ar": "القلق والإدمان بيعملوا دايرة من الخوف والاعتماد. الاعتراف بالعجز بيكسر الإنكار ويفتح الباب للتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Write down how anxiety and addiction have affected your life and relationships.",
              "Join a support group like Emotions Anonymous to connect with others.",
              "Tell a trusted person about your struggles with worry and addiction."
            ],
            "ar": [
              "اكتب إزاي القلق والإدمان أثروا على حياتك وعلاقاتك.",
              "انضم لمجموعة دعم زي العواطف المجهولين عشان تتواصل مع ناس زيك.",
              "كلم حد تثق فيه عن معاناتك مع القلق والإدمان."
            ]
          }
        },
        {
          "id": "anxiety_addiction_step_2",
          "step_number": 2,
          "description": {
            "en": "Came to believe that faith in Allah could restore us to sanity. You’ve tried to calm your anxiety or stop the addiction, but it’s hard, right? This step is about trusting Allah to guide you to a calmer, healthier life.",
            "ar": "آمنا بأن الإيمان بالله يمكنه أن يعيدنا إلى التعقل. حاولت تهدي قلقك أو تبطل الإدمان، بس صعب، مش كده؟ الخطوة دي عن إنك تثق إن الله يقدر يهديك لحياة أهدى وأصح."
          },
          "relevance": {
            "en": "Anxiety and addiction feed your fears and chaos. Believing in Allah’s guidance offers hope for calm and recovery.",
            "ar": "القلق والإدمان بيغذوا مخاوفك والفوضى. الإيمان بهداية الله بيديك أمل للهدوء والتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily to Allah for strength to manage anxiety and addiction.",
              "Read the Quran to find verses that soothe your worries.",
              "Reflect on moments when faith brought you peace."
            ],
            "ar": [
              "صلي كل يوم لله عشان يديك القوة تتحكم في قلقك وإدمانك.",
              "اقرأ القرآن عشان تلاقي آيات تهدي قلقك.",
              "فكر في لحظات الإيمان جابت لك فيها السلام."
            ]
          }
        },
        {
          "id": "anxiety_addiction_step_3",
          "step_number": 3,
          "description": {
            "en": "Made a decision to turn our will and our lives over to the care of Allah. This isn’t about giving up—it’s about trusting Allah’s plan to guide you through the storm of anxiety and addiction to a place of calm.",
            "ar": "اتخذنا قرارًا بأن نسلم إرادتنا وحياتنا لرعاية الله. مش معناها إنك بتستسلم—دي عن إنك تثق في خطة الله إنه يهديك من عاصفة القلق والإدمان لمكان هادي."
          },
          "relevance": {
            "en": "Anxiety and addiction thrive on fear and control. Surrendering to Allah’s will helps you find peace and healthier ways to cope.",
            "ar": "القلق والإدمان بيعيشوا على الخوف والتحكم. لما تسلم نفسك لمشيئة الله، ده بيساعدك تلاقي السلام وطرق أصح تتعامل بيها."
          },
          "practical_suggestions": {
            "en": [
              "Pray each morning to Allah to guide you through your fears.",
              "Write a commitment to follow Allah’s guidance in your recovery.",
              "Find a quiet space to reflect on submitting to Allah’s will."
            ],
            "ar": [
              "صلي كل صبح لله عشان يهديك من مخاوفك.",
              "اكتب التزام إنك هتمشي ورا هداية الله في تعافيك.",
              "دور على مكان هادي تفكر فيه عن تسليم نفسك لمشيئة الله."
            ]
          }
        },
        {
          "id": "anxiety_addiction_step_4",
          "step_number": 4,
          "description": {
            "en": "Made a searching and fearless moral inventory of ourselves. Be honest. Write down how your anxiety and addiction have hurt you and others—your relationships, your work, your peace of mind. It’s tough, but it shows you what needs healing.",
            "ar": "عملنا جردًا أخلاقيًا دقيقًا وشجاعًا لأنفسنا. كن صادق. اكتب إزاي قلقك وإدمانك ضرك وضر الناس—علاقاتك، شغلك، راحتك النفسية. صعب، بس بيوريك إيه لازم يتشافى."
          },
          "relevance": {
            "en": "This step helps you face the damage caused by anxiety and addiction, motivating you to seek calm and change.",
            "ar": "الخطوة دي بتساعدك تواجه الأذى اللي سببه القلق والإدمان، وبتحفزك تدور على الهدوء والتغيير."
          },
          "practical_suggestions": {
            "en": [
              "Journal about specific ways anxiety and addiction have impacted your life.",
              "Ask a trusted friend to help you reflect on your actions without judgment.",
              "Organize your inventory by areas: relationships, work, mental health."
            ],
            "ar": [
              "اكتب في دفتر عن الطرق المحددة اللي القلق والإدمان أثروا بيها على حياتك.",
              "اطلب من صاحب تثق فيه يساعدك تفكر في تصرفاتك من غير حكم.",
              "نظم الجرد بتاعك حسب المجالات: العلاقات، الشغل، الصحة النفسية."
            ]
          }
        },
        {
          "id": "anxiety_addiction_step_5",
          "step_number": 5,
          "description": {
            "en": "Admitted to Allah, to ourselves, and to another human being the exact nature of our wrongs. Open up to someone you trust. Share the mistakes you wrote down about your anxiety and addiction. Telling Allah and another person lifts the guilt and helps you heal.",
            "ar": "اعترفنا لله، ولأنفسنا، ولشخص آخر بالطبيعة الدقيقة لأخطائنا. افتح قلبك لواحد تثق فيه. شارك الأخطاء اللي كتبتها عن قلقك وإدمانك. لما تحكي لله ولواحد تاني، ده بيخفف الذنب ويساعدك تشفى."
          },
          "relevance": {
            "en": "Anxiety and addiction often involve shame and isolation. Sharing your wrongs with Allah and someone else builds honesty and connection.",
            "ar": "القلق والإدمان غالبًا بيجوا مع العار والعزلة. لما تشارك أخطاءك مع الله ومع حد تاني، ده بيبني الصدق والتواصل."
          },
          "practical_suggestions": {
            "en": [
              "Choose a sponsor or trusted friend to share your inventory with.",
              "Pray to Allah for courage before opening up.",
              "Practice what you’ll say to keep it honest and clear."
            ],
            "ar": [
              "اختار مرشد أو صاحب تثق فيه عشان تشارك معاه الجرد بتاعك.",
              "صلي لله عشان يديك الشجاعة قبل ما تتكلم.",
              "تدرب على اللي هتقوله عشان يكون صادق وواضح."
            ]
          }
        },
        {
          "id": "anxiety_addiction_step_6",
          "step_number": 6,
          "description": {
            "en": "Were entirely ready to have Allah remove all these defects of character. Your anxiety and addiction might come from flaws like fearfulness or avoidance. This step is about being ready to let Allah take those away so you can find peace.",
            "ar": "كنا مستعدين تمامًا لأن يزيل الله كل عيوب شخصيتنا. قلقك وإدمانك ممكن يكونوا جايين من عيوب زي الخوف أو الهروب. الخطوة دي عن إنك تكون مستعد تخلي الله يزيل العيوب دي عشان تلاقي السلام."
          },
          "relevance": {
            "en": "Anxiety and addiction amplify negative traits. Being ready to let Allah remove them is key to emotional and spiritual healing.",
            "ar": "القلق والإدمان بيزودوا الصفات السلبية. لما تكون مستعد تخلي الله يزيلها، ده مفتاح للشفاء العاطفي والروحي."
          },
          "practical_suggestions": {
            "en": [
              "Reflect on triggers like fear that fuel your anxiety and pray for their removal.",
              "Write how your life would improve without these flaws.",
              "Talk to a religious mentor about how faith can help you change."
            ],
            "ar": [
              "فكر في المحفزات زي الخوف اللي بتغذي قلقك وصلي عشان تتخلص منها.",
              "اكتب إزاي حياتك هتتحسن من غير العيوب دي.",
              "كلم مرشد ديني عن إزاي الإيمان يقدر يساعدك تتغير."
            ]
          }
        },
        {
          "id": "anxiety_addiction_step_7",
          "step_number": 7,
          "description": {
            "en": "Humbly asked Allah to remove our shortcomings. Now, pray with sincerity. Ask Allah to take away the flaws that drive your anxiety and addiction. Trust that He can help you find calm.",
            "ar": "طلبنا من الله بتواضع أن يزيل عيوبنا. دلوقتي، صلي بصدق. اطلب من الله يزيل العيوب اللي بتدفعك لقلقك وإدمانك. ثق إنه قادر يساعدك تلاقي الهدوء."
          },
          "relevance": {
            "en": "This step deepens your reliance on Allah to transform the behaviors that fuel anxiety and addiction, supporting your recovery.",
            "ar": "الخطوة دي بتعمق اعتمادك على الله عشان يغير السلوكيات اللي بتغذي القلق والإدمان، وبتدعم تعافيك."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily for Allah to remove your flaws and guide your emotional healing.",
              "Keep a gratitude journal to focus on Allah’s blessings.",
              "Attend a mosque to feel connected to your faith community."
            ],
            "ar": [
              "صلي كل يوم عشان الله يزيل عيوبك ويهدي شفاءك العاطفي.",
              "احتفظ بدفتر شكر تركز فيه على نعم الله.",
              "روح المسجد عشان تحس بقربك من مجتمع الإيمان."
            ]
          }
        },
        {
          "id": "anxiety_addiction_step_8",
          "step_number": 8,
          "description": {
            "en": "Made a list of all persons we had harmed, and became willing to make amends to them all. Think about everyone you’ve hurt because of your anxiety and addiction—maybe family you’ve snapped at or responsibilities you’ve neglected. Write their names and get ready to fix things.",
            "ar": "عملنا قائمة بكل الأشخاص اللي أذيناهم، وأصبحنا مستعدين لتعويضهم جميعًا. فكر في كل الناس اللي ضريتهم بسبب قلقك وإدمانك—يمكن عيلتك اللي اتعصبت عليها أو مسؤولياتك اللي أهملتها. اكتب أساميهم واستعد تصلح الأمور."
          },
          "relevance": {
            "en": "Anxiety and addiction can strain relationships. This step helps you take responsibility and prepare to rebuild trust.",
            "ar": "القلق والإدمان بيرهقوا العلاقات. الخطوة دي بتساعدك تتحمل المسؤولية وتستعد تبني الثقة من جديد."
          },
          "practical_suggestions": {
            "en": [
              "List specific people you’ve wronged and how your anxiety or addiction affected them.",
              "Reflect on how your actions hurt them to build empathy.",
              "Discuss your list with a sponsor to plan your amends."
            ],
            "ar": [
              "اكتب قايمة بالناس اللي ظلمتهم وإزاي قلقك أو إدمانك أثر عليهم.",
              "فكر إزاي تصرفاتك ضرتهم عشان تبني تعاطف.",
              "ناقش القايمة مع مرشد عشان تخطط لتعويضاتك."
            ]
          }
        },
        {
          "id": "anxiety_addiction_step_9",
          "step_number": 9,
          "description": {
            "en": "Made direct amends to such people wherever possible, except when to do so would injure them or others. Go to those people and apologize sincerely. Fix what you can, like being more patient with family, but don’t cause more harm.",
            "ar": "قدمنا تعويضات مباشرة لهؤلاء الأشخاص حيثما أمكن، إلا إذا كان ذلك سيؤذيهم أو غيرهم. روح للناس دي واعتذر بصدق. صلح اللي تقدر عليه، زي إنك تبقى أكتر صبر مع عيلتك، بس خلي بالك ما تسببش ضرر زيادة."
          },
          "relevance": {
            "en": "Making amends repairs relationships damaged by anxiety and addiction and helps you move forward with a clear conscience.",
            "ar": "الخطوة دي بتصلح العلاقات اللي اتضررت بسبب القلق والإدمان وبتساعدك تكمل وإنت ضميرك مرتاح."
          },
          "practical_suggestions": {
            "en": [
              "Plan your apologies with sincerity and accountability.",
              "Start with small amends, like apologizing to a friend, to build confidence.",
              "Seek guidance from a mentor on sensitive amends."
            ],
            "ar": [
              "خطط لاعتذاراتك وخليك صادق ومسؤول.",
              "ابدأ بتعويضات صغيرة، زي الاعتذار لصاحب، عشان تبني ثقتك.",
              "اطلب نصيحة من مرشد عن التعويضات الحساسة."
            ]
          }
        },
        {
          "id": "anxiety_addiction_step_10",
          "step_number": 10,
          "description": {
            "en": "Continued to take personal inventory and when we were wrong promptly admitted it. Keep checking yourself every day. If you slip back into anxious or addictive behaviors, admit it right away. This keeps you honest and on track.",
            "ar": "واصلنا جرد أنفسنا الشخصي، وعندما كنا مخطئين اعترفنا بذلك فورًا. خليك دايمًا تراجع نفسك كل يوم. لو رجعت لسلوكيات قلقة أو إدمانية، اعترف على طول. ده بيخليك صادق ومستمر على الطريق الصح."
          },
          "relevance": {
            "en": "Anxiety and addiction can resurface if you’re not vigilant. This step ensures you stay aware of your behaviors and correct mistakes quickly.",
            "ar": "القلق والإدمان ممكن يرجعوا لو مش واخد بالك. الخطوة دي بتضمن إنك تفضل واعي بسلوكياتك وتصلح الأخطاء بسرعة."
          },
          "practical_suggestions": {
            "en": [
              "Set a daily reminder to reflect on your emotional and addictive behaviors.",
              "Track triggers that lead to anxiety or addiction in a journal.",
              "Practice quick apologies for small mistakes to build honesty."
            ],
            "ar": [
              "حط تذكير يومي عشان تراجع سلوكياتك العاطفية والإدمانية.",
              "تابع المحفزات اللي بتوديك للقلق أو الإدمان في دفتر.",
              "تدرب على الاعتذار السريع عن الأخطاء الصغيرة عشان تبني الصدق."
            ]
          }
        },
        {
          "id": "anxiety_addiction_step_11",
          "step_number": 11,
          "description": {
            "en": "Sought through prayer and meditation to improve our conscious contact with Allah, praying only for knowledge of His will for us and the power to carry that out. Pray and reflect daily to stay close to Allah. Ask Him to guide you to emotional stability.",
            "ar": "سعينا من خلال الصلاة والتأمل لتحسين اتصالنا الواعي بالله، داعين فقط لمعرفة مشيئته لنا والقوة لتنفيذها. صلي وفكر كل يوم عشان تبقى قريب من الله. اطلب منه يهديك للاستقرار العاطفي."
          },
          "relevance": {
            "en": "This step strengthens your faith in Allah, helping you resist anxious and addictive urges and stay committed to recovery.",
            "ar": "الخطوة دي بتقوي إيمانك بالله، وبتساعدك تقاوم رغبتك في القلق والإدمان وتفضل ملتزم بالتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Pray five times daily to maintain your connection with Allah.",
              "Practice quiet reflection to focus on Allah’s guidance for emotional health.",
              "Join a religious study group to deepen your faith."
            ],
            "ar": [
              "صلي خمس مرات يوميًا عشان تحافظ على اتصالك بالله.",
              "مارس التفكير الهادي عشان تركز على هداية الله لصحتك العاطفية.",
              "انضم لمجموعة دراسة دينية عشان تعمق إيمانك."
            ]
          }
        },
        {
          "id": "anxiety_addiction_step_12",
          "step_number": 12,
          "description": {
            "en": "Having had a spiritual awakening as the result of these steps, we tried to carry this message to others struggling with anxiety and addiction, and to practice these principles in all our affairs. You’ve changed with Allah’s help. Now, share your story and live these principles every day.",
            "ar": "بعد أن اختبرنا صحوة روحية نتيجة هذه الخطوات، حاولنا نقل هذه الرسالة لغيرنا من اللي بيعانوا مع القلق والإدمان، وممارسة هذه المبادئ في كل شؤوننا. إنت اتغيرت بمساعدة الله. دلوقتي، شارك قصتك وعيش المبادئ دي كل يوم."
          },
          "relevance": {
            "en": "This step is about helping others with anxiety and addiction and living a life guided by Allah’s principles to stay emotionally balanced.",
            "ar": "الخطوة دي عن مساعدة الناس اللي عندهم قلق وإدمان وإنك تعيش حياة بتهديها مبادئ الله عشان تبقى متوازن عاطفيًا."
          },
          "practical_suggestions": {
            "en": [
              "Share your recovery story at a support group to inspire others.",
              "Volunteer to support newcomers in recovery programs.",
              "Apply these principles (honesty, humility) in all areas of your life."
            ],
            "ar": [
              "شارك قصة تعافيك في مجموعة دعم عشان تلهم غيرك.",
              "تطوع عشان تساعد الناس الجدد في برامج التعافي.",
              "طبق المبادئ دي (الصدق، التواضع) في كل نواحي حياتك."
            ]
          }
        }
      ]
    },
    {
      "id": "ptsd_addiction",
      "name": {
        "en": "PTSD Related to Addiction",
        "ar": "اضطراب ما بعد الصدمة المرتبط بالإدمان"
      },
      "steps": [
        {
          "id": "ptsd_addiction_step_1",
          "step_number": 1,
          "description": {
            "en": "We admitted we were powerless over our PTSD and addiction—that our lives had become unmanageable. The memories and the addiction are heavy, aren’t they? They keep you stuck, making life feel out of control. Admitting you can’t handle it alone is the first step to healing.",
            "ar": "اعترفنا بأننا عاجزون عن التحكم في اضطراب ما بعد الصدمة وإدماننا—وأن حياتنا أصبحت غير قابلة للإدارة. الذكريات والإدمان تقال، مش كده؟ بيخلوك عالق، وبيخلوا الحياة تبقى خارج السيطرة. لما تعترف إنك مش قادر تتحمل لوحدك، دي أول خطوة للشفاء."
          },
          "relevance": {
            "en": "PTSD and addiction trap you in a cycle of pain and escape. Admitting powerlessness breaks the denial and opens the door to recovery.",
            "ar": "اضطراب ما بعد الصدمة والإدمان بيحاصرك في دايرة من الألم والهروب. الاعتراف بالعجز بيكسر الإنكار ويفتح الباب للتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Write down how PTSD and addiction have affected your life and relationships.",
              "Join a support group like Trauma Recovery Anonymous to connect with others.",
              "Tell a trusted person about your struggles with trauma and addiction."
            ],
            "ar": [
              "اكتب إزاي اضطراب ما بعد الصدمة والإدمان أثروا على حياتك وعلاقاتك.",
              "انضم لمجموعة دعم زي التعافي من الصدمات المجهولين عشان تتواصل مع ناس زيك.",
              "كلم حد تثق فيه عن معاناتك مع الصدمة والإدمان."
            ]
          }
        },
        {
          "id": "ptsd_addiction_step_2",
          "step_number": 2,
          "description": {
            "en": "Came to believe that faith in Allah could restore us to sanity. You’ve tried to escape the flashbacks or addiction, but it’s tough, right? This step is about trusting Allah to guide you to a life where trauma doesn’t control you.",
            "ar": "آمنا بأن الإيمان بالله يمكنه أن يعيدنا إلى التعقل. حاولت تهرب من الذكريات المؤلمة أو الإدمان، بس صعب، مش كده؟ الخطوة دي عن إنك تثق إن الله يقدر يهديك لحياة ما تكونش الصدمة هي اللي بتسيطر عليك."
          },
          "relevance": {
            "en": "PTSD and addiction feed on fear and despair. Believing in Allah’s guidance offers hope for peace and recovery.",
            "ar": "اضطراب ما بعد الصدمة والإدمان بيتغذوا على الخوف واليأس. الإيمان بهداية الله بيديك أمل للسلام والتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily to Allah for strength to face your trauma and addiction.",
              "Read the Quran to find comfort in verses about patience and healing.",
              "Reflect on moments when faith helped you feel safe."
            ],
            "ar": [
              "صلي كل يوم لله عشان يديك القوة تواجه صدمتك وإدمانك.",
              "اقرأ القرآن عشان تلاقي راحة في آيات عن الصبر والشفاء.",
              "فكر في لحظات الإيمان حسستك فيها بالأمان."
            ]
          }
        },
        {
          "id": "ptsd_addiction_step_3",
          "step_number": 3,
          "description": {
            "en": "Made a decision to turn our will and our lives over to the care of Allah. This isn’t about giving up—it’s about trusting Allah’s plan to guide you through the pain of PTSD and addiction to a place of healing.",
            "ar": "اتخذنا قرارًا بأن نسلم إرادتنا وحياتنا لرعاية الله. مش معناها إنك بتستسلم—دي عن إنك تثق في خطة الله إنه يهديك من ألم اضطراب ما بعد الصدمة والإدمان لمكان الشفاء."
          },
          "relevance": {
            "en": "PTSD and addiction thrive on feeling trapped. Surrendering to Allah’s will helps you find hope and healthier ways to cope.",
            "ar": "اضطراب ما بعد الصدمة والإدمان بيعيشوا على إحساس العجز. لما تسلم نفسك لمشيئة الله، ده بيساعدك تلاقي أمل وطرق أصح تتعامل بيها."
          },
          "practical_suggestions": {
            "en": [
              "Pray each morning to Allah to guide you through your pain.",
              "Write a commitment to follow Allah’s guidance in your recovery.",
              "Find a quiet space to reflect on submitting to Allah’s will."
            ],
            "ar": [
              "صلي كل صبح لله عشان يهديك من ألمك.",
              "اكتب التزام إنك هتمشي ورا هداية الله في تعافيك.",
              "دور على مكان هادي تفكر فيه عن تسليم نفسك لمشيئة الله."
            ]
          }
        },
        {
          "id": "ptsd_addiction_step_4",
          "step_number": 4,
          "description": {
            "en": "Made a searching and fearless moral inventory of ourselves. Be honest. Write/review how your PTSD and addiction have hurt you and others—your relationships, your responsibilities, your sense of safety. It’s heavy, but it shows you what needs healing.",
            "ar": "عملنا جردًا أخلاقيًا دقيقًا وشجاعًا لأنفسنا. كن صادق. اكتب/راجع إزاي اضطراب ما بعد الصدمة وإدمانك ضرك وضر الناس—علاقاتك، مسؤولياتك، إحساسك بالأمان. تقيل، بس بيوريك إيه لازم يتشافى."
          },
          "relevance": {
            "en": "This step helps you face the damage caused by PTSD and addiction, motivating you to seek healing and change.",
            "ar": "الخطوة دي بتساعدك تواجه الأذى اللي سببه اضطراب ما بعد الصدمة والإدمان، وبتحفزك تدور على الشفاء والتغيير."
          },
          "practical_suggestions": {
            "en": [
              "Journal about specific ways PTSD and addiction have impacted your life.",
              "Ask a trusted friend to help you reflect on your actions without judgment.",
              "Organize your inventory by areas: relationships, responsibilities, trauma."
            ],
            "ar": [
              "اكتب في دفتر عن الطرق المحددة اللي اضطراب ما بعد الصدمة والإدمان أثروا بيها على حياتك.",
              "اطلب من صاحب تثق فيه يساعدك تفكر في تصرفاتك من غير حكم.",
              "نظم الجرد بتاعك حسب المجالات: العلاقات، المسؤوليات، الصدمة."
            ]
          }
        },
        {
          "id": "ptsd_addiction_step_5",
          "step_number": 5,
          "description": {
            "en": "Admitted to Allah, to ourselves, and to another human being the exact nature of our wrongs. Open up to someone you trust. Share the mistakes you wrote down about your PTSD and addiction. Telling Allah and another person lifts the shame and helps you heal.",
            "ar": "اعترفنا لله، ولأنفسنا، ولشخص آخر بالطبيعة الدقيقة لأخطائنا. افتح قلبك لواحد تثق فيه. شارك الأخطاء اللي كتبتها عن اضطراب ما بعد الصدمة وإدمانك. لما تحكي لله ولواحد تاني، ده بيخفف العار ويساعدك تشفى."
          },
          "relevance": {
            "en": "PTSD and addiction often involve guilt and isolation. Sharing your wrongs with Allah and someone else builds honesty and connection.",
            "ar": "اضطراب ما بعد الصدمة والإدمان غالبًا بيجوا مع الذنب والعزلة. لما تشارك أخطاءك مع الله ومع حد تاني، ده بيبني الصدق والتواصل."
          },
          "practical_suggestions": {
            "en": [
              "Choose a sponsor or trusted friend to share your inventory with.",
              "Pray to Allah for courage before opening up.",
              "Practice what you’ll say to feel safe sharing."
            ],
            "ar": [
              "اختار مرشد أو صاحب تثق فيه عشان تشارك معاه الجرد بتاعك.",
              "صلي لله عشان يديك الشجاعة قبل ما تتكلم.",
              "تدرب على اللي هتقوله عشان تحس بالأمان وإنت بتشارك."
            ]
          }
        },
        {
          "id": "ptsd_addiction_step_6",
          "step_number": 6,
          "description": {
            "en": "Were entirely ready to have Allah remove all these defects of character. Your PTSD and addiction might come from flaws like hypervigilance or avoidance. This step is about being ready to let Allah take those away so you can find peace.",
            "ar": "كنا مستعدين تمامًا لأن يزيل الله كل عيوب شخصيتنا. اضطراب ما بعد الصدمة وإدمانك ممكن يكونوا جايين من عيوب زي اليقظة المفرطة أو الهروب. الخطوة دي عن إنك تكون مستعد تخلي الله يزيل العيوب دي عشان تلاقي السلام."
          },
          "relevance": {
            "en": "PTSD and addiction amplify negative traits. Being ready to let Allah remove them is key to emotional and spiritual healing.",
            "ar": "اضطراب ما بعد الصدمة والإدمان بيزودوا الصفات السلبية. لما تكون مستعد تخلي الله يزيلها، ده مفتاح للشفاء العاطفي والروحي."
          },
          "practical_suggestions": {
            "en": [
              "Reflect on triggers like stress that fuel your PTSD and pray for their removal.",
              "Write how your life would improve without these flaws.",
              "Talk to a religious mentor about how faith can help you heal."
            ],
            "ar": [
              "فكر في المحفزات زي التوتر اللي بتغذي اضطراب ما بعد الصدمة وصلي عشان تتخلص منها.",
              "اكتب إزاي حياتك هتتحسن من غير العيوب دي.",
              "كلم مرشد ديني عن إزاي الإيمان يقدر يساعدك تشفى."
            ]
          }
        },
        {
          "id": "ptsd_addiction_step_7",
          "step_number": 7,
          "description": {
            "en": "Humbly asked Allah to remove our shortcomings. Now, pray with sincerity. Ask Allah to take away the flaws that drive your PTSD and addiction. Trust that He can help you find calm.",
            "ar": "طلبنا من الله بتواضع أن يزيل عيوبنا. دلوقتي، صلي بصدق. اطلب من الله يزيل العيوب اللي بتدفعك لاضطراب ما بعد الصدمة وإدمانك. ثق إنه قادر يساعدك تلاقي الهدوء."
          },
          "relevance": {
            "en": "This step deepens your reliance on Allah to transform the behaviors that fuel PTSD and addiction, supporting your recovery.",
            "ar": "الخطوة دي بتعمق اعتمادك على الله عشان يغير السلوكيات اللي بتغذي اضطراب ما بعد الصدمة والإدمان، وبتدعم تعافيك."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily for Allah to remove your flaws and guide your emotional healing.",
              "Keep a gratitude journal to focus on Allah’s blessings.",
              "Attend a mosque to feel connected to your faith community."
            ],
            "ar": [
              "صلي كل يوم عشان الله يزيل عيوبك ويهدي شفاءك العاطفي.",
              "احتفظ بدفتر شكر تركز فيه على نعم الله.",
              "روح المسجد عشان تحس بقربك من مجتمع الإيمان."
            ]
          }
        },
        {
          "id": "ptsd_addiction_step_8",
          "step_number": 8,
          "description": {
            "en": "Made a list of all persons we had harmed, and became willing to make amends to them all. Think about everyone you’ve hurt because of your PTSD and addiction—maybe family you’ve pushed away or friends you’ve isolated. Write their names and get ready to fix things.",
            "ar": "عملنا قائمة بكل الأشخاص اللي أذيناهم، وأصبحنا مستعدين لتعويضهم جميعًا. فكر في كل الناس اللي ضريتهم بسبب اضطراب ما بعد الصدمة وإدمانك—يمكن عيلتك اللي بعدت عنها أو أصحابك اللي عزلتهم. اكتب أساميهم واستعد تصلح الأمور."
          },
          "relevance": {
            "en": "PTSD and addiction can strain relationships. This step helps you take responsibility and prepare to reconnect with others.",
            "ar": "اضطراب ما بعد الصدمة والإدمان بيرهقوا العلاقات. الخطوة دي بتساعدك تتحمل المسؤولية وتستعد تتواصل مع الناس من جديد."
          },
          "practical_suggestions": {
            "en": [
              "List specific people you’ve wronged and how your PTSD or addiction affected them.",
              "Reflect on how your actions hurt them to build empathy.",
              "Discuss your list with a sponsor to plan your amends."
            ],
            "ar": [
              "اكتب قايمة بالناس اللي ظلمتهم وإزاي اضطراب ما بعد الصدمة أو إدمانك أثر عليهم.",
              "فكر إزاي تصرفاتك ضرتهم عشان تبني تعاطف.",
              "ناقش القايمة مع مرشد عشان تخطط لتعويضاتك."
            ]
          }
        },
        {
          "id": "ptsd_addiction_step_9",
          "step_number": 9,
          "description": {
            "en": "Made direct amends to such people wherever possible, except when to do so would injure them or others. Go to those people and apologize sincerely. Fix what you can, like reconnecting with family, but don’t cause more harm.",
            "ar": "قدمنا تعويضات مباشرة لهؤلاء الأشخاص حيثما أمكن، إلا إذا كان ذلك سيؤذيهم أو غيرهم. روح للناس دي واعتذر بصدق. صلح اللي تقدر عليه، زي إنك ترجع تتواصل مع عيلتك، بس خلي بالك ما تسببش ضرر زيادة."
          },
          "relevance": {
            "en": "Making amends repairs relationships damaged by PTSD and addiction and helps you move forward with a clear conscience.",
            "ar": "الخطوة دي بتصلح العلاقات اللي اتضررت بسبب اضطراب ما بعد الصدمة والإدمان وبتساعدك تكمل وإنت ضميرك مرتاح."
          },
          "practical_suggestions": {
            "en": [
              "Plan your apologies with sincerity and sensitivity to trauma.",
              "Start with small amends, like apologizing to a friend, to build confidence.",
              "Seek guidance from a mentor on sensitive amends."
            ],
            "ar": [
              "خطط لاعتذاراتك وخليك صادق وحساس للصدمة.",
              "ابدأ بتعويضات صغيرة، زي الاعتذار لصاحب، عشان تبني ثقتك.",
              "اطلب نصيحة من مرشد عن التعويضات الحساسة."
            ]
          }
        },
        {
          "id": "ptsd_addiction_step_10",
          "step_number": 10,
          "description": {
            "en": "Continued to take personal inventory and when we were wrong promptly admitted it. Keep checking yourself every day. If you slip back into PTSD symptoms or addictive behaviors, admit it right away. This keeps you honest and on track.",
            "ar": "واصلنا جرد أنفسنا الشخصي، وعندما كنا مخطئين اعترفنا بذلك فورًا. خليك دايمًا تراجع نفسك كل يوم. لو رجعت لأعراض اضطراب ما بعد الصدمة أو سلوكيات إدمانية، اعترف على طول. ده بيخليك صادق ومستمر على الطريق الصح."
          },
          "relevance": {
            "en": "PTSD and addiction can resurface if you’re not vigilant. This step ensures you stay aware of your symptoms and correct mistakes quickly.",
            "ar": "اضطراب ما بعد الصدمة والإدمان ممكن يرجعوا لو مش واخد بالك. الخطوة دي بتضمن إنك تفضل واعي بأعراضك وتصلح الأخطاء بسرعة."
          },
          "practical_suggestions": {
            "en": [
              "Set a daily reminder to reflect on your PTSD symptoms and addiction triggers.",
              "Track triggers like stress or memories in a journal.",
              "Practice quick apologies for small mistakes to build honesty."
            ],
            "ar": [
              "حط تذكير يومي عشان تراجع أعراض اضطراب ما بعد الصدمة ومحفزات الإدمان.",
              "تابع المحفزات زي التوتر أو الذكريات في دفتر.",
              "تدرب على الاعتذار السريع عن الأخطاء الصغيرة عشان تبني الصدق."
            ]
          }
        },
        {
          "id": "ptsd_addiction_step_11",
          "step_number": 11,
          "description": {
            "en": "Sought through prayer and meditation to improve our conscious contact with Allah, praying only for knowledge of His will for us and the power to carry that out. Pray and reflect daily to stay close to Allah. Ask Him to guide you to emotional healing.",
            "ar": "سعينا من خلال الصلاة والتأمل لتحسين اتصالنا الواعي بالله، داعين فقط لمعرفة مشيئته لنا والقوة لتنفيذها. صلي وفكر كل يوم عشان تبقى قريب من الله. اطلب منه يهديك للشفاء العاطفي."
          },
          "relevance": {
            "en": "This step strengthens your faith in Allah, helping you resist PTSD symptoms and addictive urges and stay committed to recovery.",
            "ar": "الخطوة دي بتقوي إيمانك بالله، وبتساعدك تقاوم أعراض اضطراب ما بعد الصدمة ورغبتك في الإدمان وتفضل ملتزم بالتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Pray five times daily to maintain your connection with Allah.",
              "Practice quiet reflection to focus on Allah’s guidance for healing.",
              "Join a religious study group to deepen your faith."
            ],
            "ar": [
              "صلي خمس مرات يوميًا عشان تحافظ على اتصالك بالله.",
              "مارس التفكير الهادي عشان تركز على هداية الله للشفاء.",
              "انضم لمجموعة دراسة دينية عشان تعمق إيمانك."
            ]
          }
        },
        {
          "id": "ptsd_addiction_step_12",
          "step_number": 12,
          "description": {
            "en": "Having had a spiritual awakening as the result of these steps, we tried to carry this message to others struggling with PTSD and addiction, and to practice these principles in all our affairs. You’ve changed with Allah’s help. Now share your story and live these principles every day.",
            "ar": "بعد أن اختبرنا صحوة روحية نتيجة هذه الخطوات، حاولنا نقل هذه الرسالة لغيرنا من اللي بيعانوا مع اضطراب ما بعد الصدمة والإدمان، وممارسة هذه المبادئ في كل شؤوننا. إنت اتغيرت بمساعدة الله. دلوقتي، شارك قصتك وعيش المبادئ دي كل يوم."
          },
          "relevance": {
            "en": "This step is about helping others with PTSD and addiction and living a life guided by Allah’s principles to stay emotionally balanced.",
            "ar": "الخطوة دي عن مساعدة الناس اللي عندهم اضطراب ما بعد الصدمة وإدمان وإنك تعيش حياة بتهديها مبادئ الله عشان تبقى متوازن عاطفيًا."
          },
          "practical_suggestions": {
            "en": [
              "Share your recovery story at a support group to inspire others.",
              "Volunteer to support newcomers in recovery programs.",
              "Apply these principles (honesty, humility, patience) in all areas of your life."
            ],
            "ar": [
              "شارك قصة تعافيك في مجموعة دعم عشان تلهم غيرك.",
              "تطوع عشان تساعد الناس الجديدة في برامج التعافي.",
              "طبق المبادئ دي (الصدق، التواضع، الصبر) في كل نواحي حياتك."
            ]
          }
        }
      ]
    },
    {
      "id": "personality_disorders_addiction",
      "name": {
        "en": "Personality Disorders Related to Addiction",
        "ar": "اضطرابات الشخصية المرتبطة بالإدمان"
      },
      "steps": [
        {
          "id": "personality_disorders_addiction_step_1",
          "step_number": 1,
          "description": {
            "en": "We admitted we were powerless over our personality disorder and addiction—that our lives had become unmanageable. The intense emotions and the addiction are overwhelming, aren’t they? For example, with Borderline Personality Disorder, you might feel like your emotions and relationships are chaotic. Admitting you can’t control it alone is the first step to stability.",
            "ar": "اعترفنا بأننا عاجزون عن التحكم في اضطراب شخصيتنا وإدماننا—وأن حياتنا أصبحت غير قابلة للإدارة. المشاعر القوية والإدمان بيرهقوك، مش كده؟ على سبيل المثال، مع اضطراب الشخصية الحدية، ممكن تحس إن مشاعرك وعلاقاتك فوضوية. لما تعترف إنك مش قادر تتحكم لوحدك، دي أول خطوة للاستقرار."
          },
          "relevance": {
            "en": "Personality disorders like BPD and addiction create a cycle of instability and dependency. Admitting powerlessness breaks the denial and opens the door to recovery.",
            "ar": "اضطرابات الشخصية زي الشخصية الحدية والإدمان بيعملوا دايرة من عدم الاستقرار والاعتماد. الاعتراف بالعجز بيكسر الإنكار ويفتح الباب للتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Write down how your personality disorder and addiction have affected your life and relationships.",
              "Join a support group like Emotions Anonymous or DBT groups to connect with others.",
              "Tell a trusted person about your struggles with emotions and addiction."
            ],
            "ar": [
              "اكتب إزاي اضطراب شخصيتك والإدمان أثروا على حياتك وعلاقاتك.",
              "انضم لمجموعة دعم زي العواطف المجهولين أو مجموعات العلاج السلوكي الجدلي عشان تتواصل مع ناس زيك.",
              "كلم حد تثق فيه عن معاناتك مع المشاعر والإدمان."
            ]
          }
        },
        {
          "id": "personality_disorders_addiction_step_2",
          "step_number": 2,
          "description": {
            "en": "Came to believe that faith in Allah could restore us to sanity. You’ve tried to manage your intense emotions or addiction, but it’s hard, right? This step is about trusting Allah to guide you to a more stable, balanced life.",
            "ar": "آمنا بأن الإيمان بالله يمكنه أن يعيدنا إلى التعقل. حاولت تتحكم في مشاعرك القوية أو إدمانك، بس صعب، مش كده؟ الخطوة دي عن إنك تثق إن الله يقدر يهديك لحياة أكتر استقرار وتوازن."
          },
          "relevance": {
            "en": "Personality disorders and addiction amplify emotional chaos. Believing in Allah’s guidance offers hope for stability and recovery.",
            "ar": "اضطرابات الشخصية والإدمان بيزودوا الفوضى العاطفية. الإيمان بهداية الله بيديك أمل للاستقرار والتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily to Allah for strength to manage your emotions and addiction.",
              "Read the Quran to find verses that calm your emotional intensity.",
              "Reflect on moments when faith helped you feel grounded."
            ],
            "ar": [
              "صلي كل يوم لله عشان يديك القوة تتحكم في مشاعرك وإدمانك.",
              "اقرأ القرآن عشان تلاقي آيات تهدي شدتك العاطفية.",
              "فكر في لحظات الإيمان حسستك فيها بالاستقرار."
            ]
          }
        },
        {
          "id": "personality_disorders_addiction_step_3",
          "step_number": 3,
          "description": {
            "en": "Made a decision to turn our will and our lives over to the care of Allah. This isn’t about giving up—it’s about trusting Allah’s plan to guide you through the emotional chaos of your personality disorder and addiction to a place of peace.",
            "ar": "اتخذنا قرارًا بأن نسلم إرادتنا وحياتنا لرعاية الله. مش معناها إنك بتستسلم—دي عن إنك تثق في خطة الله إنه يهديك من فوضى مشاعر اضطراب شخصيتك وإدمانك لمكان السلام."
          },
          "relevance": {
            "en": "Personality disorders and addiction thrive on emotional extremes. Surrendering to Allah’s will helps you find balance and healthier coping mechanisms.",
            "ar": "اضطرابات الشخصية والإدمان بيعيشوا على التطرف العاطفي. لما تسلم نفسك لمشيئة الله، ده بيساعدك تلاقي توازن وطرق أصح تتعامل بيها."
          },
          "practical_suggestions": {
            "en": [
              "Pray each morning to Allah to guide you through your emotional struggles.",
              "Write a commitment to follow Allah’s guidance in your recovery.",
              "Find a quiet space to reflect on submitting to Allah’s will."
            ],
            "ar": [
              "صلي كل صبح لله عشان يهديك من صعوباتك العاطفية.",
              "اكتب التزام إنك هتمشي ورا هداية الله في تعافيك.",
              "دور على مكان هادي تفكر فيه عن تسليم نفسك لمشيئة الله."
            ]
          }
        },
        {
          "id": "personality_disorders_addiction_step_4",
          "step_number": 4,
          "description": {
            "en": "Made a searching and fearless moral inventory of ourselves. Be honest. Write down how your personality disorder and addiction have hurt you and others—your relationships, your responsibilities, your self-worth. For example, with BPD, you might’ve hurt others with impulsivity or anger. It’s tough, but it shows you what needs healing.",
            "ar": "عملنا جردًا أخلاقيًا دقيقًا وشجاعًا لأنفسنا. كن صادق. اكتب إزاي اضطراب شخصيتك وإدمانك ضرك وضر الناس—علاقاتك، مسؤولياتك، قيمتك بنفسك. على سبيل المثال، مع الشخصية الحدية، ممكن تكون ضريت غيرك بالاندفاعية أو العصبية. صعب، بس بيوريك إيه لازم يتشافى."
          },
          "relevance": {
            "en": "This step helps you face the damage caused by your personality disorder and addiction, motivating you to seek healing and change.",
            "ar": "الخطوة دي بتساعدك تواجه الأذى اللي سببه اضطراب شخصيتك والإدمان، وبتحفزك تدور على الشفاء والتغيير."
          },
          "practical_suggestions": {
            "en": [
              "Journal about specific ways your personality disorder or addiction have impacted your life.",
              "Ask a trusted friend to help you reflect on your actions without judgment.",
              "Organize your inventory by areas: relationships, responsibilities, emotions."
            ],
            "ar": [
              "اكتب في دفتر عن الطرق المحددة اللي اضطراب شخصيتك والإدمان أثروا بيها على حياتك.",
              "اطلب من صاحب تثق فيه يساعدك تفكر في تصرفاتك من غير حكم.",
              "نظم الجرد بتاعك حسب المجالات: العلاقات، المسؤوليات، المشاعر."
            ]
          }
        },
        {
          "id": "personality_disorders_addiction_step_5",
          "step_number": 5,
          "description": {
            "en": "Admitted to Allah, to ourselves, and to another human being the exact nature of our wrongs. Open up to someone you trust. Share the mistakes you wrote down about your personality disorder and addiction. Telling Allah and another person lifts the guilt and helps you heal.",
            "ar": "اعترفنا لله، ولأنفسنا، ولشخص آخر بالطبيعة الدقيقة لأخطائنا. افتح قلبك لواحد تثق فيه. شارك الأخطاء اللي كتبتها عن اضطراب شخصيتك وإدمانك. لما تحكي لله ولواحد تاني، ده بيخفف الذنب ويساعدك تشفى."
          },
          "relevance": {
            "en": "Personality disorders and addiction often involve shame and isolation. Sharing your wrongs with Allah and someone else builds honesty and connection.",
            "ar": "اضطرابات الشخصية والإدمان غالبًا بيجمعوا بين العار والعزلة. لما تشارك أخطاءك مع الله ومع حد تاني، ده بيبني الصدق والتواصل."
          },
          "practical_suggestions": {
            "en": [
              "Choose a sponsor or trusted friend to share your inventory with.",
              "Pray to Allah for courage before opening up.",
              "Practice what you’ll say to keep it honest and clear."
            ],
            "ar": [
              "اختار مرشد أو صاحب تثق فيه عشان تشارك معاه الجرد بتاعك.",
              "صلي لله عشان يديك الشجاعة قبل ما تتكلم.",
              "تدرب على اللي هتقوله عشان يكون صادق وواضح."
            ]
          }
        },
        {
          "id": "personality_disorders_addiction_step_6",
          "step_number": 6,
          "description": {
            "en": "Were entirely ready to have Allah remove all these defects of character. Your personality disorder and addiction might come from flaws like impulsivity or fear of abandonment. This step is about being ready to let Allah take those away so you can find peace.",
            "ar": "كنا مستعدين تمامًا لأن يزيل الله كل عيوب شخصيتنا. اضطراب شخصيتك وإدمانك ممكن يكونوا جايين من عيوب زي الاندفاع أو الخوف من الهجر. الخطوة دي عن إنك تكون مستعد تخلي الله يزيل العيوب دي عشان تلاقي السلام."
          },
          "relevance": {
            "en": "Personality disorders and addiction amplify negative traits. Being ready to let Allah remove them is key to emotional and spiritual healing.",
            "ar": "اضطرابات الشخصية والإدمان بيزودوا الصفات السلبية. لما تكون مستعد تخلي الله يزيلها، ده مفتاح للشفاء العاطفي والروحي."
          },
          "practical_suggestions": {
            "en": [
              "Reflect on triggers like fear of rejection that fuel your symptoms and pray for guidance.",
              "Write how your life would improve without these flaws.",
              "Talk to a religious mentor about how faith can help you change."
            ],
            "ar": [
              "فكر في المحفزات زي الخوف من الرفض اللي بتغذي أعراضك وصلي عشان تتخلص منها.",
              "اكتب إزاي حياتك هتتحسن من غير العيوب دي.",
              "كلم مرشد ديني عن إزاي الإيمان يقدر يساعدك تتغير."
            ]
          }
        },
        {
          "id": "personality_disorders_addiction_step_7",
          "step_number": 7,
          "description": {
            "en": "Humbly asked Allah to remove our shortcomings. Now, pray with sincerity. Ask Allah to take away the flaws that drive your personality disorder and addiction, like impulsivity or fear of abandonment. Trust that He can help you find emotional balance.",
            "ar": "طلبنا من الله بتواضع أن يزيل عيوبنا. دلوقتي، صلي بصدق. اطلب من الله يزيل العيوب اللي بتدفعك لاضطراب شخصيتك وإدمانك، زي الاندفاع أو الخوف من الهجر. ثق إنه قادر يساعدك تلاقي توازن عاطفي."
          },
          "relevance": {
            "en": "This step deepens your reliance on Allah to transform the behaviors that fuel your personality disorder and addiction, supporting your recovery.",
            "ar": "الخطوة دي بتعمق اعتمادك على الله عشان يغير السلوكيات اللي بتغذي اضطراب شخصيتك والإدمان، وبتدعم تعافيك."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily for Allah to remove your flaws and guide your emotional healing.",
              "Keep a gratitude journal to focus on Allah’s blessings, especially on stable moments.",
              "Attend a mosque to feel connected to your faith community."
            ],
            "ar": [
              "صلي كل يوم عشان الله يزيل عيوبك ويهدي شفاءك العاطفي.",
              "احتفظ بدفتر شكر تركز فيه على نعم الله، خصوصًا في لحظات الاستقرار.",
              "روح المسجد عشان تحس بقربك من مجتمع الإيمان."
            ]
          }
        },
        {
          "id": "personality_disorders_addiction_step_8",
          "step_number": 8,
          "description": {
            "en": "Made a list of all persons we had harmed, and became willing to make amends to them all. Think about everyone you’ve hurt because of your personality disorder and addiction—maybe family or friends you’ve pushed away with anger or impulsivity. Write their names and get ready to fix things.",
            "ar": "عملنا قائمة بكل الأشخاص اللي أذيناهم، وأصبحنا مستعدين لتعويضهم جميعًا. فكر في كل الناس اللي ضريتهم بسبب اضطراب شخصيتك وإدمانك—يمكن عيلتك أو أصحابك اللي بعدتهم بالعصبية أو الاندفاعية. اكتب أساميهم واستعد تصلح الأمور."
          },
          "relevance": {
            "en": "Personality disorders like BPD and addiction can strain relationships through emotional outbursts or neglect. This step helps you take responsibility and prepare to rebuild trust.",
            "ar": "اضطرابات الشخصية زي الشخصية الحدية والإدمان بيرهقوا العلاقات بالانفعالات العاطفية أو الإهمال. الخطوة دي بتساعدك تتحمل المسؤولية وتستعد تبني الثقة من جديد."
          },
          "practical_suggestions": {
            "en": [
              "List specific people you’ve wronged and how your BPD symptoms or addiction affected them.",
              "Reflect on how your actions hurt them to build empathy.",
              "Discuss your list with a sponsor to plan your amends."
            ],
            "ar": [
              "اكتب قايمة بالناس اللي ظلمتهم وإزاي أعراض الشخصية الحدية أو إدمانك أثرت عليهم.",
              "فكر إزاي تصرفاتك ضرتهم عشان تبني تعاطف.",
              "ناقش القايمة مع مرشد عشان تخطط لتعويضاتك."
            ]
          }
        },
        {
          "id": "personality_disorders_addiction_step_9",
          "step_number": 9,
          "description": {
            "en": "Made direct amends to such people wherever possible, except when to do so would injure them or others. Go to those people and apologize sincerely. Fix what you can, like being more patient with family, but don’t cause more harm with emotional intensity.",
            "ar": "قدمنا تعويضات مباشرة لهؤلاء الأشخاص حيثما أمكن، إلا إذا كان ذلك سيؤذيهم أو غيرهم. روح للناس دي واعتذر بصدق. صلح اللي تقدر عليه، زي إنك تبقى أكتر صبر مع عيلتك، بس خلي بالك ما تسببش ضرر زيادة بانفعالك العاطفي."
          },
          "relevance": {
            "en": "Making amends repairs relationships damaged by BPD and addiction, helping you move forward with a clear conscience while managing emotional intensity.",
            "ar": "الخطوة دي بتصلح العلاقات اللي اتضررت بسبب الشخصية الحدية والإدمان، وبتساعدك تكمل وإنت ضميرك مرتاح بينما بتتحكم في شدتك العاطفية."
          },
          "practical_suggestions": {
            "en": [
              "Plan your apologies with sincerity, keeping your emotions in check.",
              "Start with small amends, like apologizing to a friend, to build confidence.",
              "Seek guidance from a mentor on sensitive amends to avoid triggering others."
            ],
            "ar": [
              "خطط لاعتذاراتك وخليك صادق وتحكم في مشاعرك.",
              "ابدأ بتعويضات صغيرة، زي الاعتذار لصاحب، عشان تبني ثقتك.",
              "اطلب نصيحة من مرشد عن التعويضات الحساسة عشان ما تسببش محفزات لغيرك."
            ]
          }
        },
        {
          "id": "personality_disorders_addiction_step_10",
          "step_number": 10,
          "description": {
            "en": "Continued to take personal inventory and when we were wrong promptly admitted it. Keep checking yourself every day. If you slip back into BPD symptoms like impulsivity or addictive behaviors, admit it right away. This keeps you honest and on track.",
            "ar": "واصلنا جرد أنفسنا الشخصي، وعندما كنا مخطئين اعترفنا بذلك فورًا. خليك دايمًا تراجع نفسك كل يوم. لو رجعت لأعراض الشخصية الحدية زي الاندفاع أو سلوكيات إدمانية، اعترف على طول. ده بيخليك صادق ومستمر على الطريق الصح."
          },
          "relevance": {
            "en": "BPD and addiction can resurface if you’re not vigilant. This step ensures you stay aware of your emotional triggers and correct mistakes quickly.",
            "ar": "الشخصية الحدية والإدمان ممكن يرجعوا لو مش واخد بالك. الخطوة دي بتضمن إنك تفضل واعي بمحفزاتك العاطفية وتصلح الأخطاء بسرعة."
          },
          "practical_suggestions": {
            "en": [
              "Set a daily reminder to reflect on your emotional and addictive behaviors.",
              "Track triggers like fear of abandonment in a journal.",
              "Practice quick apologies for small mistakes to build honesty."
            ],
            "ar": [
              "حط تذكير يومي عشان تراجع سلوكياتك العاطفية والإدمانية.",
              "تابع المحفزات زي الخوف من الهجر في دفتر.",
              "تدرب على الاعتذار السريع عن الأخطاء الصغيرة عشان تبني الصدق."
            ]
          }
        },
        {
          "id": "personality_disorders_addiction_step_11",
          "step_number": 11,
          "description": {
            "en": "Sought through prayer and meditation to improve our conscious contact with Allah, praying only for knowledge of His will for us and the power to carry that out. Pray and reflect daily to stay close to Allah. Ask Him to guide you to emotional stability.",
            "ar": "سعينا من خلال الصلاة والتأمل لتحسين اتصالنا الواعي بالله، داعين فقط لمعرفة مشيئته لنا والقوة لتنفيذها. صلي وفكر كل يوم عشان تبقى قريب من الله. اطلب منه يهديك للاستقرار العاطفي."
          },
          "relevance": {
            "en": "This step strengthens your faith in Allah, helping you resist BPD symptoms and addictive urges while staying committed to recovery.",
            "ar": "الخطوة دي بتقوي إيمانك بالله، وبتساعدك تقاوم أعراض الشخصية الحدية ورغبتك في الإدمان وتفضل ملتزم بالتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Pray five times daily to maintain your connection with Allah.",
              "Practice quiet reflection to focus on Allah’s guidance for emotional health.",
              "Join a religious study group to deepen your faith."
            ],
            "ar": [
              "صلي خمس مرات يوميًا عشان تحافظ على اتصالك بالله.",
              "مارس التفكير الهادي عشان تركز على هداية الله لصحتك العاطفية.",
              "انضم لمجموعة دراسة دينية عشان تعمق إيمانك."
            ]
          }
        },
        {
          "id": "personality_disorders_addiction_step_12",
          "step_number": 12,
          "description": {
            "en": "Having had a spiritual awakening as the result of these steps, we tried to carry this message to others struggling with BPD and addiction, and to practice these principles in all our affairs. You’ve changed with Allah’s help. Now, share your story and live these principles every day.",
            "ar": "بعد أن اختبرنا صحوة روحية نتيجة هذه الخطوات، حاولنا نقل هذه الرسالة لغيرنا من اللي بيعانوا مع الشخصية الحدية والإدمان، وممارسة هذه المبادئ في كل شؤوننا. إنت اتغيرت بمساعدة الله. دلوقتي، شارك قصتك وعيش المبادئ دي كل يوم."
          },
          "relevance": {
            "en": "This step is about helping others with BPD and addiction and living a life guided by Allah’s principles to stay emotionally balanced.",
            "ar": "الخطوة دي عن مساعدة الناس اللي عندهم شخصية حدية وإدمان وإنك تعيش حياة بتهديها مبادئ الله عشان تبقى متوازن عاطفيًا."
          },
          "practical_suggestions": {
            "en": [
              "Share your recovery story at a support group to inspire others.",
              "Volunteer to support newcomers in recovery programs or DBT groups.",
              "Apply these principles (honesty, humility, emotional regulation) in all areas of your life."
            ],
            "ar": [
              "شارك قصة تعافيك في مجموعة دعم عشان تلهم غيرك.",
              "تطوع عشان تساعد الناس الجدد في برامج التعافي أو مجموعات العلاج السلوكي الجدلي.",
              "طبق المبادئ دي (الصدق، التواضع، تنظيم العواطف) في كل نواحي حياتك."
            ]
          }
        }
      ]
    },
    {
      "id": "suicidal_ideation_addiction_depression",
      "name": {
        "en": "Suicidal Ideation or Behavior Related to Addiction or Depression",
        "ar": "الأفكار أو السلوك الانتحاري المرتبط بالإدمان أو الاكتئاب"
      },
      "steps": [
        {
          "id": "suicidal_ideation_addiction_depression_step_1",
          "step_number": 1,
          "description": {
            "en": "We admitted we were powerless over our suicidal thoughts, addiction, or depression—that our lives had become unmanageable. Those dark thoughts and the pull of addiction or depression feel overwhelming, don’t they? Admitting you can’t face them alone is the first step to finding hope.",
            "ar": "اعترفنا بأننا عاجزون عن التحكم في أفكارنا الانتحارية، إدماننا، أو اكتئابنا—وأن حياتنا أصبحت غير قابلة للإدارة. الأفكار السوداء دي وجاذبية الإدمان أو الاكتئاب بيرهقوك، مش كده؟ لما تعترف إنك مش قادر تواجههم لوحدك، دي أول خطوة عشان تلاقي أمل."
          },
          "relevance": {
            "en": "Suicidal thoughts, addiction, and depression create a cycle of despair and isolation. Admitting powerlessness breaks the denial and opens the door to recovery.",
            "ar": "الأفكار الانتحارية، الإدمان، والاكتئاب بيعملوا دايرة من اليأس والعزلة. الاعتراف بالعجز بيكسر الإنكار ويفتح الباب للتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Write down how suicidal thoughts, addiction, or depression have affected your life.",
              "Reach out to a crisis hotline or support group like Samaritans for immediate help.",
              "Tell a trusted person about your struggles to feel less alone."
            ],
            "ar": [
              "اكتب إزاي الأفكار الانتحارية، الإدمان، أو الاكتئاب أثروا على حياتك.",
              "كلم خط ساخن للأزمات أو انضم لمجموعة دعم زي السامريين عشان تساعدك فورًا.",
              "كلم حد تثق فيه عن معاناتك عشان تحس إنك مش لوحدك."
            ]
          }
        },
        {
          "id": "suicidal_ideation_addiction_depression_step_2",
          "step_number": 2,
          "description": {
            "en": "Came to believe that faith in Allah could restore us to sanity. You’ve tried to fight the darkness or addiction alone, but it’s heavy, right? This step is about trusting Allah to guide you to a life with hope and light.",
            "ar": "آمنا بأن الإيمان بالله يمكنه أن يعيدنا إلى التعقل. حاولت تقاوم الظلام أو الإدمان لوحدك، بس تقيل، مش كده؟ الخطوة دي عن إنك تثق إن الله يقدر يهديك لحياة فيها أمل ونور."
          },
          "relevance": {
            "en": "Suicidal thoughts and addiction feed on hopelessness. Believing in Allah’s guidance offers a path to healing and stability.",
            "ar": "الأفكار الانتحارية والإدمان بيتغذوا على اليأس. الإيمان بهداية الله بيديك طريق للشفاء والاستقرار."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily to Allah for strength to face your thoughts and addiction.",
              "Read the Quran to find verses about hope and patience.",
              "Reflect on moments when faith gave you a sense of purpose."
            ],
            "ar": [
              "صلي كل يوم لله عشان يديك القوة تواجه أفكارك وإدمانك.",
              "اقرأ القرآن عشان تلاقي آيات عن الأمل والصبر.",
              "فكر في لحظات الإيمان إدتك فيها إحساس بالهدف."
            ]
          }
        },
        {
          "id": "suicidal_ideation_addiction_depression_step_3",
          "step_number": 3,
          "description": {
            "en": "Made a decision to turn our will and our lives over to the care of Allah. This isn’t giving up—it’s trusting Allah’s plan to pull you out of the darkness of suicidal thoughts, addiction, or depression into a place of hope.",
            "ar": "اتخذنا قرارًا بأن نسلم إرادتنا وحياتنا لرعاية الله. مش معناها إنك بتستسلم—دي عن إنك تثق في خطة الله إنه يسحبك من ظلام الأفكار الانتحارية، الإدمان، أو الاكتئاب لمكان فيه أمل."
          },
          "relevance": {
            "en": "Suicidal thoughts and addiction thrive on despair. Surrendering to Allah’s will helps you find hope and healthier ways to cope.",
            "ar": "الأفكار الانتحارية والإدمان بيعيشوا على اليأس. لما تسلم نفسك لمشيئة الله، ده بيساعدك تلاقي أمل وطرق أصح تتعامل بيها."
          },
          "practical_suggestions": {
            "en": [
              "Pray each morning to Allah to guide you through your struggles.",
              "Write a commitment to trust Allah’s plan for your recovery.",
              "Find a quiet space to reflect on submitting to Allah’s will."
            ],
            "ar": [
              "صلي كل صبح لله عشان يهديك من معاناتك.",
              "اكتب التزام إنك هتثق في خطة الله لتعافيك.",
              "دور على مكان هادي تفكر فيه عن تسليم نفسك لمشيئة الله."
            ]
          }
        },
        {
          "id": "suicidal_ideation_addiction_depression_step_4",
          "step_number": 4,
          "description": {
            "en": "Made a searching and fearless moral inventory of ourselves. Be honest. Write down how your suicidal thoughts, addiction, or depression have hurt you and others—your relationships, your responsibilities, your sense of self. It’s hard, but it shows what needs healing.",
            "ar": "عملنا جردًا أخلاقيًا دقيقًا وشجاعًا لأنفسنا. كن صادق. اكتب إزاي أفكارك الانتحارية، إدمانك، أو اكتئابك ضرك وضر الناس—علاقاتك، مسؤولياتك، إحساسك بنفسك. صعب، بس بيوريك إيه لازم يتشافى."
          },
          "relevance": {
            "en": "This step helps you face the damage caused by suicidal thoughts and addiction, motivating you to seek healing and change.",
            "ar": "الخطوة دي بتساعدك تواجه الأذى اللي سببه الأفكار الانتحارية والإدمان، وبتحفزك تدور على الشفاء والتغيير."
          },
          "practical_suggestions": {
            "en": [
              "Journal about specific ways your struggles have impacted your life.",
              "Ask a trusted friend to help you reflect without judgment.",
              "Organize your inventory by areas: relationships, work, self-worth."
            ],
            "ar": [
              "اكتب في دفتر عن الطرق المحددة اللي معاناتك أثرت بيها على حياتك.",
              "اطلب من صاحب تثق فيه يساعدك تفكر من غير حكم.",
              "نظم الجرد بتاعك حسب المجالات: العلاقات، الشغل، قيمتك الذاتية."
            ]
          }
        },
        {
          "id": "suicidal_ideation_addiction_depression_step_5",
          "step_number": 5,
          "description": {
            "en": "Admitted to Allah, to ourselves, and to another human being the exact nature of our wrongs. Open up to someone you trust. Share the mistakes you wrote down about your struggles. Telling Allah and another person lifts the guilt and helps you heal.",
            "ar": "اعترفنا لله، ولأنفسنا، ولشخص آخر بالطبيعة الدقيقة لأخطائنا. افتح قلبك لواحد تثق فيه. شارك الأخطاء اللي كتبتها عن معاناتك. لما تحكي لله ولواحد تاني، ده بيخفف الذنب ويساعدك تشفى."
          },
          "relevance": {
            "en": "Suicidal thoughts and addiction often bring shame and isolation. Sharing with Allah and someone else builds honesty and connection.",
            "ar": "الأفكار الانتحارية والإدمان غالبًا بيجيبوا عار وعزلة. لما تشارك مع الله ومع حد تاني، ده بيبني الصدق والتواصل."
          },
          "practical_suggestions": {
            "en": [
              "Choose a trusted friend or counselor to share your inventory with.",
              "Pray to Allah for courage before opening up.",
              "Practice what you’ll say to feel safe sharing."
            ],
            "ar": [
              "اختار صاحب أو مستشار تثق فيه عشان تشارك معاه الجرد بتاعك.",
              "صلي لله عشان يديك الشجاعة قبل ما تتكلم.",
              "تدرب على اللي هتقوله عشان تحس بالأمان وإنت بتشارك."
            ]
          }
        },
        {
          "id": "suicidal_ideation_addiction_depression_step_6",
          "step_number": 6,
          "description": {
            "en": "Were entirely ready to have Allah remove all these defects of character. Your struggles might come from flaws like hopelessness or self-destructiveness. This step is about being ready to let Allah take those away so you can find peace.",
            "ar": "كنا مستعدين تمامًا لأن يزيل الله كل عيوب شخصيتنا. معاناتك ممكن تكون جاية من عيوب زي اليأس أو السلوك المدمر للذات. الخطوة دي عن إنك تكون مستعد تخلي الله يزيل العيوب دي عشان تلاقي السلام."
          },
          "relevance": {
            "en": "Suicidal thoughts and addiction amplify negative traits. Being ready to let Allah remove them is key to emotional and spiritual healing.",
            "ar": "الأفكار الانتحارية والإدمان بيزودوا الصفات السلبية. لما تكون مستعد تخلي الله يزيلها، ده مفتاح للشفاء العاطفي والروحي."
          },
          "practical_suggestions": {
            "en": [
              "Reflect on triggers like loneliness that fuel your thoughts and pray for guidance.",
              "Write how your life would improve without these flaws.",
              "Talk to a religious mentor about how faith can help you heal."
            ],
            "ar": [
              "فكر في المحفزات زي الوحدة اللي بتغذي أفكارك وصلي عشان تتخلص منها.",
              "اكتب إزاي حياتك هتتحسن من غير العيوب دي.",
              "كلم مرشد ديني عن إزاي الإيمان يقدر يساعدك تشفى."
            ]
          }
        },
        {
          "id": "suicidal_ideation_addiction_depression_step_7",
          "step_number": 7,
          "description": {
            "en": "Humbly asked Allah to remove our shortcomings. Now, pray with sincerity. Ask Allah to take away the flaws that drive your suicidal thoughts or addiction. Trust that He can help you find hope.",
            "ar": "طلبنا من الله بتواضع أن يزيل عيوبنا. دلوقتي، صلي بصدق. اطلب من الله يزيل العيوب اللي بتدفعك لأفكارك الانتحارية أو إدمانك. ثق إنه قادر يساعدك تلاقي أمل."
          },
          "relevance": {
            "en": "This step deepens your reliance on Allah to transform the behaviors that fuel your struggles, supporting your recovery.",
            "ar": "الخطوة دي بتعمق اعتمادك على الله عشان يغير السلوكيات اللي بتغذي معاناتك، وبتدعم تعافيك."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily for Allah to remove your flaws and guide your healing.",
              "Keep a gratitude journal to focus on Allah’s blessings.",
              "Attend a mosque to feel connected to your faith community."
            ],
            "ar": [
              "صلي كل يوم عشان الله يزيل عيوبك ويهدي شفاءك.",
              "احتفظ بدفتر شكر تركز فيه على نعم الله.",
              "روح المسجد عشان تحس بقربك من مجتمع الإيمان."
            ]
          }
        },
        {
          "id": "suicidal_ideation_addiction_depression_step_8",
          "step_number": 8,
          "description": {
            "en": "Made a list of all persons we had harmed, and became willing to make amends to them all. Think about everyone you’ve hurt because of your struggles—maybe family you’ve worried or responsibilities you’ve neglected. Write their names and get ready to fix things.",
            "ar": "عملنا قائمة بكل الأشخاص اللي أذيناهم، وأصبحنا مستعدين لتعويضهم جميعًا. فكر في كل الناس اللي ضريتهم بسبب معاناتك—يمكن عيلتك اللي قلقتها أو مسؤولياتك اللي أهملتها. اكتب أساميهم واستعد تصلح الأمور."
          },
          "relevance": {
            "en": "Suicidal thoughts and addiction can strain relationships. This step helps you take responsibility and prepare to rebuild trust.",
            "ar": "الأفكار الانتحارية والإدمان بيرهقوا العلاقات. الخطوة دي بتساعدك تتحمل المسؤولية وتستعد تبني الثقة من جديد."
          },
          "practical_suggestions": {
            "en": [
              "List specific people you’ve wronged and how your struggles affected them.",
              "Reflect on how your actions hurt them to build empathy.",
              "Discuss your list with a counselor to plan your amends."
            ],
            "ar": [
              "اكتب قايمة بالناس اللي ظلمتهم وإزاي معاناتك أثرت عليهم.",
              "فكر إزاي تصرفاتك ضرتهم عشان تبني تعاطف.",
              "ناقش القايمة مع مستشار عشان تخطط لتعويضاتك."
            ]
          }
        },
        {
          "id": "suicidal_ideation_addiction_depression_step_9",
          "step_number": 9,
          "description": {
            "en": "Made direct amends to such people wherever possible, except when to do so would injure them or others. Go to those people and apologize sincerely. Fix what you can, like being more present for family, but don’t cause more harm.",
            "ar": "قدمنا تعويضات مباشرة لهؤلاء الأشخاص حيثما أمكن، إلا إذا كان ذلك سيؤذيهم أو غيرهم. روح للناس دي واعتذر بصدق. صلح اللي تقدر عليه، زي إنك تبقى موجود أكتر مع عيلتك، بس خلي بالك ما تسببش ضرر زيادة."
          },
          "relevance": {
            "en": "Making amends repairs relationships damaged by your struggles and helps you move forward with a clear conscience.",
            "ar": "الخطوة دي بتصلح العلاقات اللي اتضررت بسبب معاناتك وبتساعدك تكمل وإنت ضميرك مرتاح."
          },
          "practical_suggestions": {
            "en": [
              "Plan your apologies with sincerity and sensitivity.",
              "Start with small amends, like apologizing to a friend, to build confidence.",
              "Seek guidance from a mentor on sensitive amends."
            ],
            "ar": [
              "خطط لاعتذاراتك وخليك صادق وحساس.",
              "ابدأ بتعويضات صغيرة، زي الاعتذار لصاحب، عشان تبني ثقتك.",
              "اطلب نصيحة من مرشد عن التعويضات الحساسة."
            ]
          }
        },
        {
          "id": "suicidal_ideation_addiction_depression_step_10",
          "step_number": 10,
          "description": {
            "en": "Continued to take personal inventory and when we were wrong promptly admitted it. Keep checking yourself every day. If you slip back into dark thoughts or addictive behaviors, admit it right away. This keeps you honest and on track.",
            "ar": "واصلنا جرد أنفسنا الشخصي، وعندما كنا مخطئين اعترفنا بذلك فورًا. خليك دايمًا تراجع نفسك كل يوم. لو رجعت لأفكار سوداء أو سلوكيات إدمانية، اعترف على طول. ده بيخليك صادق ومستمر على الطريق الصح."
          },
          "relevance": {
            "en": "Suicidal thoughts and addiction can resurface if you’re not vigilant. This step ensures you stay aware and correct mistakes quickly.",
            "ar": "الأفكار الانتحارية والإدمان ممكن يرجعوا لو مش واخد بالك. الخطوة دي بتضمن إنك تفضل واعي وتصلح الأخطاء بسرعة."
          },
          "practical_suggestions": {
            "en": [
              "Set a daily reminder to reflect on your thoughts and behaviors.",
              "Track triggers like stress in a journal.",
              "Practice quick apologies for small mistakes to build honesty."
            ],
            "ar": [
              "حط تذكير يومي عشان تراجع أفكارك وسلوكياتك.",
              "تابع المحفزات زي التوتر في دفتر.",
              "تدرب على الاعتذار السريع عن الأخطاء الصغيرة عشان تبني الصدق."
            ]
          }
        },
        {
          "id": "suicidal_ideation_addiction_depression_step_11",
          "step_number": 11,
          "description": {
            "en": "Sought through prayer and meditation to improve our conscious contact with Allah, praying only for knowledge of His will for us and the power to carry that out. Pray and reflect daily to stay close to Allah. Ask Him to guide you to hope and stability.",
            "ar": "سعينا من خلال الصلاة والتأمل لتحسين اتصالنا الواعي بالله، داعين فقط لمعرفة مشيئته لنا والقوة لتنفيذها. صلي وفكر كل يوم عشان تبقى قريب من الله. اطلب منه يهديك للأمل والاستقرار."
          },
          "relevance": {
            "en": "This step strengthens your faith in Allah, helping you resist dark thoughts and addictive urges while staying committed to recovery.",
            "ar": "الخطوة دي بتقوي إيمانك بالله، وبتساعدك تقاوم الأفكار السوداء ورغبتك في الإدمان وتفضل ملتزم بالتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Pray five times daily to maintain your connection with Allah.",
              "Practice quiet reflection to focus on Allah’s guidance for healing.",
              "Join a religious study group to deepen your faith."
            ],
            "ar": [
              "صلي خمس مرات يوميًا عشان تحافظ على اتصالك بالله.",
              "مارس التفكير الهادي عشان تركز على هداية الله للشفاء.",
              "انضم لمجموعة دراسة دينية عشان تعمق إيمانك."
            ]
          }
        },
        {
          "id": "suicidal_ideation_addiction_depression_step_12",
          "step_number": 12,
          "description": {
            "en": "Having had a spiritual awakening as the result of these steps, we tried to carry this message to others struggling with suicidal thoughts or addiction, and to practice these principles in all our affairs. You’ve found hope with Allah’s help. Now, share your story and live these principles every day.",
            "ar": "بعد أن اختبرنا صحوة روحية نتيجة هذه الخطوات، حاولنا نقل هذه الرسالة لغيرنا من اللي بيعانوا مع الأفكار الانتحارية أو الإدمان، وممارسة هذه المبادئ في كل شؤوننا. إنت لقيت أمل بمساعدة الله. دلوقتي، شارك قصتك وعيش المبادئ دي كل يوم."
          },
          "relevance": {
            "en": "This step is about helping others with suicidal thoughts or addiction and living a life guided by Allah’s principles to stay hopeful.",
            "ar": "الخطوة دي عن مساعدة الناس اللي عندهم أفكار انتحارية أو إدمان وإنك تعيش حياة بتهديها مبادئ الله عشان تبقى مليان أمل."
          },
          "practical_suggestions": {
            "en": [
              "Share your recovery story at a support group to inspire others.",
              "Volunteer to support newcomers in recovery programs.",
              "Apply these principles (honesty, humility, hope) in all areas of your life."
            ],
            "ar": [
              "شارك قصة تعافيك في مجموعة دعم عشان تلهم غيرك.",
              "تطوع عشان تساعد الناس الجدد في برامج التعافي.",
              "طبق المبادئ دي (الصدق، التواضع، الأمل) في كل نواحي حياتك."
            ]
          }
        }
      ]
    },
    {
      "id": "love_addiction_emotional_dependency",
      "name": {
        "en": "Love Addiction or Excessive Emotional Dependency",
        "ar": "إدمان العلاقات العاطفية أو الاعتماد العاطفي المفرط"
      },
      "steps": [
        {
          "id": "love_addiction_emotional_dependency_step_1",
          "step_number": 1,
          "description": {
            "en": "We admitted we were powerless over our love addiction or emotional dependency—that our lives had become unmanageable. Chasing relationships or needing someone to feel complete is exhausting, isn’t it? Admitting you can’t control it alone is the first step to freedom.",
            "ar": "اعترفنا بأننا عاجزون عن التحكم في إدماننا العاطفي أو اعتمادنا العاطفي المفرط—وأن حياتنا أصبحت غير قابلة للإدارة. مطاردة العلاقات أو إنك تحتاج حد عشان تحس إنك مكتمل بيرهق، مش كده؟ لما تعترف إنك مش قادر تتحكم لوحدك، دي أول خطوة للحرية."
          },
          "relevance": {
            "en": "Love addiction and emotional dependency create a cycle of neediness and pain. Admitting powerlessness breaks the denial and opens the door to recovery.",
            "ar": "إدمان العلاقات العاطفية والاعتماد العاطفي بيعملوا دايرة من الحاجة والألم. الاعتراف بالعجز بيكسر الإنكار ويفتح الباب للتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Write down how your emotional dependency has affected your life and relationships.",
              "Join a support group like Codependents Anonymous to connect with others.",
              "Tell a trusted person about your struggles with needing others."
            ],
            "ar": [
              "اكتب إزاي اعتمادك العاطفي أثر على حياتك وعلاقاتك.",
              "انضم لمجموعة دعم زي المتعافين من الاعتمادية عشان تتواصل مع ناس زيك.",
              "كلم حد تثق فيه عن معاناتك مع إنك محتاج غيرك."
            ]
          }
        },
        {
          "id": "love_addiction_emotional_dependency_step_2",
          "step_number": 2,
          "description": {
            "en": "Came to believe that faith in Allah could restore us to sanity. You’ve tried to find peace in relationships, but it’s fleeting, right? This step is about trusting Allah to guide you to self-worth and balance.",
            "ar": "آمنا بأن الإيمان بالله يمكنه أن يعيدنا إلى التعقل. حاولت تلاقي السلام في العلاقات، بس بيروح بسرعة، مش كده؟ الخطوة دي عن إنك تثق إن الله يقدر يهديك لقيمتك الذاتية والتوازن."
          },
          "relevance": {
            "en": "Love addiction feeds on insecurity. Believing in Allah’s guidance offers hope for independence and emotional health.",
            "ar": "إدمان العلاقات بيتغذى على انعدام الأمان. الإيمان بهداية الله بيديك أمل للاستقلالية والصحة العاطفية."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily to Allah for strength to find peace within yourself.",
              "Read the Quran to find verses about self-worth and trust in Allah.",
              "Reflect on moments when faith made you feel whole."
            ],
            "ar": [
              "صلي كل يوم لله عشان يديك القوة تلاقي السلام جواك.",
              "اقرأ القرآن عشان تلاقي آيات عن قيمتك الذاتية والثقة بالله.",
              "فكر في لحظات الإيمان حسستك فيها إنك مكتمل."
            ]
          }
        },
        {
          "id": "love_addiction_emotional_dependency_step_3",
          "step_number": 3,
          "description": {
            "en": "Made a decision to turn our will and our lives over to the care of Allah. This isn’t about giving up—it’s about trusting Allah’s plan to guide you away from unhealthy dependencies to a place of inner strength.",
            "ar": "اتخذنا قرارًا بأن نسلم إرادتنا وحياتنا لرعاية الله. مش معناها إنك بتستسلم—دي عن إنك تثق في خطة الله إنه يهديك بعيد عن الاعتماديات الغير صحية لمكان فيه قوة داخلية."
          },
          "relevance": {
            "en": "Emotional dependency thrives on fear of being alone. Surrendering to Allah’s will helps you find strength and healthier connections.",
            "ar": "الاعتماد العاطفي بيعيش على الخوف من إنك تبقى لوحدك. لما تسلم نفسك لمشيئة الله، ده بيساعدك تلاقي قوة وعلاقات أصح."
          },
          "practical_suggestions": {
            "en": [
              "Pray each morning to Allah to guide you toward self-reliance.",
              "Write a commitment to follow Allah’s guidance in your recovery.",
              "Find a quiet space to reflect on trusting Allah’s plan."
            ],
            "ar": [
              "صلي كل صبح لله عشان يهديك للاعتماد على نفسك.",
              "اكتب التزام إنك هتمشي ورا هداية الله في تعافيك.",
              "دور على مكان هادي تفكر فيه عن الثقة في خطة الله."
            ]
          }
        },
        {
          "id": "love_addiction_emotional_dependency_step_4",
          "step_number": 4,
          "description": {
            "en": "Made a searching and fearless moral inventory of ourselves. Be honest. Write down how your love addiction has hurt you and others—your relationships you’ve clung to, responsibilities you’ve neglected, your sense of self. It’s tough, but it shows what needs healing.",
            "ar": "عملنا جردًا أخلاقيًا دقيقًا وشجاعًا لأنفسنا. كن صادق. اكتب إزاي إدمانك العاطفي ضرك وضر الناس—علاقاتك اللي تمسكت بيها، مسؤولياتك اللي أهملتها، إحساسك بنفسك. صعب، بس بيوريك إيه لازم يتشافى."
          },
          "relevance": {
            "en": "This step helps you face the damage caused by emotional dependency, motivating you to seek healthier relationships.",
            "ar": "الخطوة دي بتساعدك تواجه الأذى اللي سببه الاعتماد العاطفي، وبتحفزك تدور على علاقات أصح."
          },
          "practical_suggestions": {
            "en": [
              "Journal about specific ways your dependency has impacted your life.",
              "Ask a trusted friend to help you reflect without judgment.",
              "Organize your inventory by areas: relationships, self-esteem, responsibilities."
            ],
            "ar": [
              "اكتب في دفتر عن الطرق المحددة اللي اعتمادك العاطفي أثر بيها على حياتك.",
              "اطلب من صاحب تثق فيه يساعدك تفكر من غير حكم.",
              "نظم الجرد بتاعك حسب المجالات: العلاقات، احترام الذات، المسؤوليات."
            ]
          }
        },
        {
          "id": "love_addiction_emotional_dependency_step_5",
          "step_number": 5,
          "description": {
            "en": "Admitted to Allah, to ourselves, and to another human being the exact nature of our wrongs. Open up to someone you trust. Share the mistakes you’ve made in relationships due to dependency. Telling Allah and another person lifts the shame.",
            "ar": "اعترفنا لله، ولأنفسنا، ولشخص آخر بالطبيعة الدقيقة لأخطائنا. افتح قلبك لواحد تثق فيه. شارك الأخطاء اللي عملتها في العلاقات بسبب اعتمادك. لما تحكي لله ولواحد تاني، ده بيخفف العار."
          },
          "relevance": {
            "en": "Love addiction often involves shame and fear. Sharing with Allah and someone else builds honesty and self-acceptance.",
            "ar": "إدمان العلاقات غالبًا بيجي مع العار والخوف. لما تشارك مع الله ومع حد تاني، ده بيبني الصدق وقبول الذات."
          },
          "practical_suggestions": {
            "en": [
              "Choose a sponsor or friend to share your inventory with.",
              "Pray to Allah for courage before opening up.",
              "Practice what you’ll say to keep it clear and honest."
            ],
            "ar": [
              "اختار مرشد أو صاحب تثق فيه عشان تشارك معاه الجرد بتاعك.",
              "صلي لله عشان يديك الشجاعة قبل ما تتكلم.",
              "تدرب على اللي هتقوله عشان يكون واضح وصادق."
            ]
          }
        },
        {
          "id": "love_addiction_emotional_dependency_step_6",
          "step_number": 6,
          "description": {
            "en": "Were entirely ready to have Allah remove all these defects of character. Your dependency might come from flaws like fear of loneliness or low self-worth. This step is about being ready to let Allah guide you to independence.",
            "ar": "كنا مستعدين تمامًا لأن يزيل الله كل عيوب شخصيتنا. اعتمادك ممكن يكون جاي من عيوب زي الخوف من الوحدة أو قيمة ذاتية ضعيفة. الخطوة دي عن إنك تكون مستعد تخلي الله يهديك للاستقلالية."
          },
          "relevance": {
            "en": "Love addiction amplifies insecurities. Being ready to let Allah remove them is key to emotional and spiritual healing.",
            "ar": "إدمان العلاقات بيزود انعدام الأمان. لما تكون مستعد تخلي الله يزيلها، ده مفتاح للشفاء العاطفي والروحي."
          },
          "practical_suggestions": {
            "en": [
              "Reflect on triggers like fear of rejection and pray for guidance.",
              "Write how your life would improve with self-worth.",
              "Talk to a religious mentor about building self-esteem through faith."
            ],
            "ar": [
              "فكر في المحفزات زي الخوف من الرفض وصلي عشان تتخلص منها.",
              "اكتب إزاي حياتك هتتحسن لو عندك قيمة ذاتية أعلى.",
              "كلم مرشد ديني عن إزاي تبني احترام الذات بالإيمان."
            ]
          }
        },
        {
          "id": "love_addiction_emotional_dependency_step_7",
          "step_number": 7,
          "description": {
            "en": "Humbly asked Allah to remove our shortcomings. Now, pray with sincerity. Ask Allah to take away the flaws that drive your dependency, like fear of being alone. Trust that He’ll guide you to strength.",
            "ar": "طلبنا من الله بتواضع أن يزيل عيوبنا. دلوقتي، صلي بصدق. اطلب من الله يزيل العيوب اللي بتدفعك لاعتمادك، زي الخوف من إنك تبقى لوحدك. ثق إنه هيديك القوة."
          },
          "relevance": {
            "en": "This step deepens your reliance on Allah to transform your neediness, supporting your recovery.",
            "ar": "الخطوة دي بتعمق اعتمادك على الله عشان يغير احتياجك المفرط، وبتدعم تعافيك."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily for Allah to guide you to self-worth and independence.",
              "Keep a gratitude journal to focus on Allah’s blessings.",
              "Attend a mosque to feel connected to your faith community."
            ],
            "ar": [
              "صلي كل يوم عشان الله يهديك لقيمة ذاتية واستقلالية.",
              "احتفظ بدفتر شكر تركز فيه على نعم الله.",
              "روح المسجد عشان تحس بقربك من مجتمع الإيمان."
            ]
          }
        },
        {
          "id": "love_addiction_emotional_dependency_step_8",
          "step_number": 8,
          "description": {
            "en": "Made a list of all persons we had harmed, and became willing to make amends to them all. Think about everyone you’ve hurt because of your dependency—maybe friends you’ve neglected or partners you’ve clung to. Write their names and get ready to fix things.",
            "ar": "عملنا قائمة بكل الأشخاص اللي أذيناهم، وأصبحنا مستعدين لتعويضهم جميعًا. فكر في كل الناس اللي ضريتهم بسبب اعتمادك—يمكن أصحابك اللي أهملتهم أو شركاء تمسكت بيهم زيادة. اكتب أساميهم واستعد تصلح الأمور."
          },
          "relevance": {
            "en": "Emotional dependency can strain relationships through clinginess or neglect. This step helps you take responsibility and prepare to reconnect.",
            "ar": "الاعتماد العاطفي بيرهق العلاقات بالتعلق الزايد أو الإهمال. الخطوة دي بتساعدك تتحمل المسؤولية وتستعد تتواصل من جديد."
          },
          "practical_suggestions": {
            "en": [
              "List specific people you’ve wronged and how your dependency affected them.",
              "Reflect on how your actions hurt them to build empathy.",
              "Discuss your list with a sponsor to plan your amends."
            ],
            "ar": [
              "اكتب قايمة بالناس اللي ظلمتهم وإزاي اعتمادك أثر عليهم.",
              "فكر إزاي تصرفاتك ضرتهم عشان تبني تعاطف.",
              "ناقش القايمة مع مرشد عشان تخطط لتعويضاتك."
            ]
          }
        },
        {
          "id": "love_addiction_emotional_dependency_step_9",
          "step_number": 9,
          "description": {
            "en": "Made direct amends to such people wherever possible, except when to do so would injure them or others. Go to those people and apologize sincerely. Fix what you can, like giving space to friends, while avoiding clinginess.",
            "ar": "قدمنا تعويضات مباشرة لهؤلاء الأشخاص حيثما أمكن، إلا إذا كان ذلك سيؤذيهم أو غيرهم. روح للناس دي واعتذر بصدق. صلح اللي تقدر عليه، زي إنك تدي مساحة لأصحابك، واتجنب التعلق الزايد."
          },
          "relevance": {
            "en": "Making amends repairs relationships damaged by dependency and helps you move forward with healthier boundaries.",
            "ar": "الخطوة دي بتصلح العلاقات اللي اتضررت بسبب الاعتماد وبتساعدك تكمل بحدود أصح."
          },
          "practical_suggestions": {
            "en": [
              "Plan your apologies with sincerity and respect for boundaries.",
              "Start with small amends, like apologizing to a friend, to build confidence.",
              "Seek guidance from a mentor on sensitive amends."
            ],
            "ar": [
              "خطط لاعتذاراتك وخليك صادق واحترم الحدود.",
              "ابدأ بتعويضات صغيرة، زي الاعتذار لصاحب، عشان تبني ثقتك.",
              "اطلب نصيحة من مرشد عن التعويضات الحساسة."
            ]
          }
        },
        {
          "id": "love_addiction_emotional_dependency_step_10",
          "step_number": 10,
          "description": {
            "en": "Continued to take personal inventory and when we were wrong promptly admitted it. Keep checking yourself every day. If you slip back into clingy behaviors, admit it right away. This keeps you honest and on track.",
            "ar": "واصلنا جرد أنفسنا الشخصي، وعندما كنا مخطئين اعترفنا بذلك فورًا. خليك دايمًا تراجع نفسك كل يوم. لو رجعت لسلوك التعلق، اعترف على طول. ده بيخليك صادق ومستمر على الطريق."
          },
          "relevance": {
            "en": "Love addiction can resurface if you’re not vigilant. This step ensures you stay aware of triggers and correct mistakes quickly.",
            "ar": "إدمان العلاقات ممكن يرجع لو مش واخد بالك. الخطوة دي بتضمن إنك تفضل واعي بالمحفزات وتصلح الأخطاء بسرعة."
          },
          "practical_suggestions": {
            "en": [
              "Set a daily reminder to reflect on your emotional behaviors.",
              "Track triggers like needing validation in a journal.",
              "Practice quick apologies for small mistakes to build honesty."
            ],
            "ar": [
              "حط تذكير يومي عشان تراجع سلوكياتك العاطفية.",
              "تابع المحفزات زي احتياجك للتأكيد في دفتر.",
              "تدرب على الاعتذار السريع عن الأخطاء الصغيرة عشان تبني الصدق."
            ]
          }
        },
        {
          "id": "love_addiction_emotional_dependency_step_11",
          "step_number": 11,
          "description": {
            "en": "Sought through prayer and meditation to improve our conscious contact with Allah, praying only for knowledge of His will for us and the power to carry that out. Pray and reflect daily to stay close to Allah. Ask Him to guide you to healthy relationships.",
            "ar": "سعينا من خلال الصلاة والتأمل لتحسين اتصالنا الواعي بالله، داعين فقط لمعرفة مشيئته لنا والقوة لتنفيذها. صلي وفكر كل يوم عشان تبقى قريب من الله. اطلب منه يهديك لعلاقات صحية."
          },
          "relevance": {
            "en": "This step strengthens your faith in Allah, helping you resist dependency and build balanced connections.",
            "ar": "الخطوة دي بتقوي إيمانك بالله، وبتساعدك تقاوم الاعتمادية وتبني علاقات متوازنة."
          },
          "practical_suggestions": {
            "en": [
              "Pray five times daily to maintain your connection with Allah.",
              "Practice quiet reflection to focus on Allah’s guidance for healthy boundaries.",
              "Join a religious study group to deepen your faith."
            ],
            "ar": [
              "صلي خمس مرات يوميًا عشان تحافظ على اتصالك بالله.",
              "مارس التفكير الهادي عشان تركز على هداية الله للحدود الصحية.",
              "انضم لمجموعة دراسة دينية عشان تعمق إيمانك."
            ]
          }
        },
        {
          "id": "love_addiction_emotional_dependency_step_12",
          "step_number": 12,
          "description": {
            "en": "Having had a spiritual awakening as the result of these steps, we tried to carry this message to others struggling with love addiction, and to practice these principles in all our affairs. You’ve found balance with Allah’s help. Now, share your story and live these principles every day.",
            "ar": "بعد أن اختبرنا صحوة روحية نتيجة هذه الخطوات، حاولنا نقل هذه الرسالة لغيرنا من اللي بيعانوا مع إدمان العلاقات، وممارسة هذه المبادئ في كل شؤوننا. إنت لقيت توازن بمساعدة الله. دلوقتي، شارك قصتك وعيش المبادئ دي كل يوم."
          },
          "relevance": {
            "en": "This step is about helping others with love addiction and living a life guided by Allah’s principles to stay balanced.",
            "ar": "الخطوة دي عن مساعدة الناس اللي عندهم إدمان علاقات وإنك تعيش حياة بتهديها مبادئ الله عشان تبقى متوازن."
          },
          "practical_suggestions": {
            "en": [
              "Share your recovery story at a support group to inspire others.",
              "Volunteer to support newcomers in recovery programs.",
              "Apply these principles (balance, self-worth, humility) in all areas of your life."
            ],
            "ar": [
              "شارك قصة تعافيك في مجموعة دعم عشان تلهم غيرك.",
              "تطوع عشان تساعد الناس الجدد في برامج التعافي.",
              "طبق المبادئ دي (التوازن، قيمة الذات، التواضع) في كل نواحي حياتك."
            ]
          }
        }
      ]
    },
    {
      "id": "chronic_anger_aggressive_behavior",
      "name": {
        "en": "Chronic Anger Control Issues or Uncontrollable Aggressive Behavior",
        "ar": "مشاكل السيطرة على الغضب المزمن أو السلوك العدواني التي يصعب التحكم فيها"
      },
      "steps": [
        {
          "id": "chronic_anger_aggressive_behavior_step_1",
          "step_number": 1,
          "description": {
            "en": "We admitted we were powerless over our anger or aggressive behavior—that our lives had become unmanageable. The rage that flares up and hurts your relationships or yourself is heavy, isn’t it? Admitting you can’t control it alone is the first step to calm.",
            "ar": "اعترفنا بأننا عاجزون عن التحكم في غضبنا أو سلوكنا العدواني—وأن حياتنا أصبحت غير قابلة للإدارة. الغضب اللي بيشتعل ويضر علاقاتك أو نفسك تقيل، مش كده؟ لما تعترف إنك مش قادر تتحكم لوحدك، دي أول خطوة للهدوء."
          },
          "relevance": {
            "en": "Chronic anger and aggression create a cycle of conflict and regret. Admitting powerlessness breaks the denial and opens the door to recovery.",
            "ar": "الغضب المزمن والعدوانية بيعملوا دايرة من الصراع والندم. الاعتراف بالعجز بيكسر الإنكار ويفتح الباب للتعافي."
          },
          "practical_suggestions": {
            "en": [
              "Write down how your anger or aggression has affected your life, relationships, or health.",
              "Join a support group like Anger Management Anonymous to connect with others.",
              "Tell a trusted person about your struggles with anger to feel supported."
            ],
            "ar": [
              "اكتب إزاي غضبك أو عدوانيتك أثروا على حياتك، علاقاتك، أو صحتك.",
              "انضم لمجموعة دعم زي المتعافين من الغضب المجهولين عشان تتواصل مع ناس زيك.",
              "كلم حد تثق فيه عن معاناتك مع الغضب عشان تحس بالدعم."
            ]
          }
        },
        {
          "id": "chronic_anger_aggressive_behavior_step_2",
          "step_number": 2,
          "description": {
            "en": "Came to believe that faith in Allah could restore us to sanity. You’ve tried to control your anger, but it keeps exploding, right? This step is about trusting Allah to guide you to a calmer, more peaceful life.",
            "ar": "آمنا بأن الإيمان بالله يمكنه أن يعيدنا إلى التعقل. حاولت تتحكم في غضبك، بس بينفجر برضو، مش كده؟ الخطوة دي عن إنك تثق إن الله يقدر يهديك لحياة أهدى وأكتر سلام."
          },
          "relevance": {
            "en": "Chronic anger feeds on chaos and impulsivity. Believing in Allah’s guidance offers hope for calm and self-control.",
            "ar": "الغضب المزمن بيتغذى على الفوضى والاندفاع. الإيمان بهداية الله بيديك أمل للهدوء والتحكم بالنفس."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily to Allah for patience and strength to manage your anger.",
              "Read the Quran to find verses about controlling anger and seeking peace.",
              "Reflect on moments when faith helped you stay calm."
            ],
            "ar": [
              "صلي كل يوم لله عشان يديك الصبر والقوة تتحكم في غضبك.",
              "اقرأ القرآن عشان تلاقي آيات عن ضبط الغضب وطلب السلام.",
              "فكر في لحظات الإيمان ساعدتك فيها تبقى هادي."
            ]
          }
        },
        {
          "id": "chronic_anger_aggressive_behavior_step_3",
          "step_number": 3,
          "description": {
            "en": "Made a decision to turn our will and our lives over to the care of Allah. This isn’t about giving up—it’s about trusting Allah’s plan to guide you away from anger and aggression to a place of patience and peace.",
            "ar": "اتخذنا قرارًا بأن نسلم إرادتنا وحياتنا لرعاية الله. مش معناها إنك بتستسلم—دي عن إنك تثق في خطة الله إنه يهديك بعيد عن الغضب والعدوانية لمكان فيه صبر وسلام."
          },
          "relevance": {
            "en": "Anger and aggression thrive on impulsivity. Surrendering to Allah’s will helps you find patience and healthier ways to cope.",
            "ar": "الغضب والعدوانية بيعيشوا على الاندفاع. لما تسلم نفسك لمشيئة الله، ده بيساعدك تلاقي صبر وطرق أصح تتعامل بيها."
          },
          "practical_suggestions": {
            "en": [
              "Pray each morning to Allah to guide you toward patience.",
              "Write a commitment to follow Allah’s guidance in managing anger.",
              "Find a quiet space to reflect on submitting to Allah’s will."
            ],
            "ar": [
              "صلي كل صبح لله عشان يهديك للصبر.",
              "اكتب التزام إنك هتمشي ورا هداية الله في التحكم بالغضب.",
              "دور على مكان هادي تفكر فيه عن تسليم نفسك لمشيئة الله."
            ]
          }
        },
        {
          "id": "chronic_anger_aggressive_behavior_step_4",
          "step_number": 4,
          "description": {
            "en": "Made a searching and fearless moral inventory of ourselves. Be honest. Write down how your anger or aggression has hurt you and others—relationships you’ve damaged, opportunities you’ve lost, or guilt you carry. It’s tough, but it shows what needs healing.",
            "ar": "عملنا جردًا أخلاقيًا دقيقًا وشجاعًا لأنفسنا. كن صادق. اكتب إزاي غضبك أو عدوانيتك ضرك وضر الناس—علاقاتك اللي اتأذت، فرص ضيعتها، أو الذنب اللي شايله. صعب، بس بيوريك إيه لازم يتشافى."
          },
          "relevance": {
            "en": "This step helps you face the damage caused by anger and aggression, motivating you to seek healing and change.",
            "ar": "الخطوة دي بتساعدك تواجه الأذى اللي سببه الغضب والعدوانية، وبتحفزك تدور على الشفاء والتغيير."
          },
          "practical_suggestions": {
            "en": [
              "Journal about specific incidents where anger hurt you or others.",
              "Ask a trusted friend to help you reflect without judgment.",
              "Organize your inventory by areas: relationships, work, self-respect."
            ],
            "ar": [
              "اكتب في دفتر عن مواقف معينة الغضب ضرك أو ضر غيرك فيها.",
              "اطلب من صاحب تثق فيه يساعدك تفكر من غير حكم.",
              "نظم الجرد بتاعك حسب المجالات: العلاقات، الشغل، احترام الذات."
            ]
          }
        },
        {
          "id": "chronic_anger_aggressive_behavior_step_5",
          "step_number": 5,
          "description": {
            "en": "Admitted to Allah, to ourselves, and to another human being the exact nature of our wrongs. Open up to someone you trust. Share the mistakes you’ve made because of your anger, like fights or hurtful words. Telling Allah and another person lifts the guilt.",
            "ar": "اعترفنا لله، ولأنفسنا، ولشخص آخر بالطبيعة الدقيقة لأخطائنا. افتح قلبك لواحد تثق فيه. شارك الأخطاء اللي عملتها بسبب غضبك، زي المشاجرات أو الكلام الجارح. لما تحكي لله ولواحد تاني، ده بيخفف الذنب."
          },
          "relevance": {
            "en": "Anger and aggression often bring shame and isolation. Sharing with Allah and someone else builds honesty and connection.",
            "ar": "الغضب والعدوانية غالبًا بيجيبوا عار وعزلة. لما تشارك مع الله ومع حد تاني، ده بيبني الصدق والتواصل."
          },
          "practical_suggestions": {
            "en": [
              "Choose a trusted friend or counselor to share your inventory with.",
              "Pray to Allah for courage before opening up.",
              "Practice what you’ll say to keep it honest and clear."
            ],
            "ar": [
              "اختار صاحب أو مستشار تثق فيه عشان تشارك معاه الجرد بتاعك.",
              "صلي لله عشان يديك الشجاعة قبل ما تتكلم.",
              "تدرب على اللي هتقوله عشان يكون صادق وواضح."
            ]
          }
        },
        {
          "id": "chronic_anger_aggressive_behavior_step_6",
          "step_number": 6,
          "description": {
            "en": "Were entirely ready to have Allah remove all these defects of character. Your anger might come from flaws like impatience or resentment. This step is about being ready to let Allah take those away so you can find peace.",
            "ar": "كنا مستعدين تمامًا لأن يزيل الله كل عيوب شخصيتنا. غضبك ممكن يكون جاي من عيوب زي عدم الصبر أو الحقد. الخطوة دي عن إنك تكون مستعد تخلي الله يزيل العيوب دي عشان تلاقي السلام."
          },
          "relevance": {
            "en": "Anger and aggression amplify negative traits. Being ready to let Allah remove them is key to emotional and spiritual healing.",
            "ar": "الغضب والعدوانية بيزودوا الصفات السلبية. لما تكون مستعد تخلي الله يزيلها، ده مفتاح للشفاء العاطفي والروحي."
          },
          "practical_suggestions": {
            "en": [
              "Reflect on triggers like feeling disrespected and pray for guidance.",
              "Write how your life would improve without these flaws.",
              "Talk to a religious mentor about managing anger through faith."
            ],
            "ar": [
              "فكر في المحفزات زي إحساسك بالإهانة وصلي عشان تتخلص منها.",
              "اكتب إزاي حياتك هتتحسن من غير العيوب دي.",
              "كلم مرشد ديني عن إزاي تتحكم في الغضب بالإيمان."
            ]
          }
        },
        {
          "id": "chronic_anger_aggressive_behavior_step_7",
          "step_number": 7,
          "description": {
            "en": "Humbly asked Allah to remove our shortcomings. Now, pray with sincerity. Ask Allah to take away the flaws that drive your anger, like impatience or resentment. Trust that He can help you find calm.",
            "ar": "طلبنا من الله بتواضع أن يزيل عيوبنا. دلوقتي، صلي بصدق. اطلب من الله يزيل العيوب اللي بتدفعك لغضبك، زي عدم الصبر أو الحقد. ثق إنه قادر يساعدك تلاقي هدوء."
          },
          "relevance": {
            "en": "This step deepens your reliance on Allah to transform the behaviors that fuel your anger, supporting your recovery.",
            "ar": "الخطوة دي بتعمق اعتمادك على الله عشان يغير السلوكيات اللي بتغذي غضبك، وبتدعم تعافيك."
          },
          "practical_suggestions": {
            "en": [
              "Pray daily for Allah to remove your flaws and guide your calm.",
              "Keep a gratitude journal to focus on Allah’s blessings, especially peaceful moments.",
              "Attend a mosque to feel connected to your faith community."
            ],
            "ar": [
              "صلي كل يوم عشان الله يزيل عيوبك ويهديك للهدوء.",
              "احتفظ بدفتر شكر تركز فيه على نعم الله، خصوصًا في لحظات السلام.",
              "روح المسجد عشان تحس بقربك من مجتمع الإيمان."
            ]
          }
        },
        {
          "id": "chronic_anger_aggressive_behavior_step_8",
          "step_number": 8,
          "description": {
            "en": "Made a list of all persons we had harmed, and became willing to make amends to them all. Think about everyone you’ve hurt because of your anger—maybe family you’ve yelled at or friends you’ve pushed away. Write their names and get ready to fix things.",
            "ar": "عملنا قائمة بكل الأشخاص اللي أذيناهم، وأصبحنا مستعدين لتعويضهم جميعًا. فكر في كل الناس اللي ضريتهم بسبب غضبك—يمكن عيلتك اللي زعقت عليها أو أصحابك اللي بعدتهم. اكتب أساميهم واستعد تصلح الأمور."
          },
          "relevance": {
            "en": "Anger and aggression strain relationships through outbursts or hostility. This step helps you take responsibility and prepare to rebuild trust.",
            "ar": "الغضب والعدوانية بيرهقوا العلاقات بالانفجارات أو العدائية. الخطوة دي بتساعدك تتحمل المسؤولية وتستعد تبني الثقة من جديد."
          },
          "practical_suggestions": {
            "en": [
              "List specific people you’ve wronged and how your anger affected them.",
              "Reflect on how your actions hurt them to build empathy.",
              "Discuss your list with a counselor to plan your amends."
            ],
            "ar": [
              "اكتب قايمة بالناس اللي ظلمتهم وإزاي غضبك أثر عليهم.",
              "فكر إزاي تصرفاتك ضرتهم عشان تبني تعاطف.",
              "ناقش القايمة مع مستشار عشان تخطط لتعويضاتك."
            ]
          }
        },
        {
          "id": "chronic_anger_aggressive_behavior_step_9",
          "step_number": 9,
          "description": {
            "en": "Made direct amends to such people wherever possible, except when to do so would injure them or others. Go to those people and apologize sincerely. Fix what you can, like being kinder to family, but don’t cause more harm with anger.",
            "ar": "قدمنا تعويضات مباشرة لهؤلاء الأشخاص حيثما أمكن، إلا إذا كان ذلك سيؤذيهم أو غيرهم. روح للناس دي واعتذر بصدق. صلح اللي تقدر عليه، زي إنك تبقى ألطف مع عيلتك، بس خلي بالك ما تسببش ضرر زيادة بغضبك."
          },
          "relevance": {
            "en": "Making amends repairs relationships damaged by anger and helps you move forward with a clear conscience while managing outbursts.",
            "ar": "الخطوة دي بتصلح العلاقات اللي اتضررت بسبب الغضب وبتساعدك تكمل وإنت ضميرك مرتاح بينما بتتحكم في انفجاراتك."
          },
          "practical_suggestions": {
            "en": [
              "Plan your apologies with sincerity, keeping your tone calm.",
              "Start with small amends, like apologizing to a friend, to build confidence.",
              "Seek guidance from a mentor on sensitive amends to avoid anger triggers."
            ],
            "ar": [
              "خطط لاعتذاراتك وخليك صادق ونبرتك هادية.",
              "ابدأ بتعويضات صغيرة، زي الاعتذار لصاحب، عشان تبني ثقتك.",
              "اطلب نصيحة من مرشد عن التعويضات الحساسة عشان تتجنب محفزات الغضب."
            ]
          }
        },
        {
          "id": "chronic_anger_aggressive_behavior_step_10",
          "step_number": 10,
          "description": {
            "en": "Continued to take personal inventory and when we were wrong promptly admitted it. Keep checking yourself every day. If you slip back into angry outbursts, admit it right away. This keeps you honest and on track.",
            "ar": "واصلنا جرد أنفسنا الشخصي، وعندما كنا مخطئين اعترفنا بذلك فورًا. خليك دايمًا تراجع نفسك كل يوم. لو رجعت لانفجارات غضب، اعترف على طول. ده بيخليك صادق ومستمر على الطريق الصح."
          },
          "relevance": {
            "en": "Anger and aggression can resurface if you’re not vigilant. This step ensures you stay aware of triggers and correct mistakes quickly.",
            "ar": "الغضب والعدوانية ممكن يرجعوا لو مش واخد بالك. الخطوة دي بتضمن إنك تفضل واعي بالمحفزات وتصلح الأخطاء بسرعة."
          },
          "practical_suggestions": {
            "en": [
              "Set a daily reminder to reflect on your anger triggers and behaviors.",
              "Track triggers like stress or disrespect in a journal.",
              "Practice quick apologies for small mistakes to build honesty."
            ],
            "ar": [
              "حط تذكير يومي عشان تراجع محفزات غضبك وسلوكياتك.",
              "تابع المحفزات زي التوتر أو الإحساس بالإهانة في دفتر.",
              "تدرب على الاعتذار السريع عن الأخطاء الصغيرة عشان تبني الصدق."
            ]
          }
        },
        {
          "id": "chronic_anger_aggressive_behavior_step_11",
          "step_number": 11,
          "description": {
            "en": "Sought through prayer and meditation to improve our conscious contact with Allah, praying only for knowledge of His will for us and the power to carry that out. Pray and reflect daily to stay close to Allah. Ask Him to guide you to patience and calm.",
            "ar": "سعينا من خلال الصلاة والتأمل لتحسين اتصالنا الواعي بالله، داعين فقط لمعرفة مشيئته لنا والقوة لتنفيذها. صلي وفكر كل يوم عشان تبقى قريب من الله. اطلب منه يهديك للصبر والهدوء."
          },
          "relevance": {
            "en": "This step strengthens your faith in Allah, helping you resist anger and build self-control.",
            "ar": "الخطوة دي بتقوي إيمانك بالله، وبتساعدك تقاوم الغضب وتبني التحكم بالنفس."
          },
          "practical_suggestions": {
            "en": [
              "Pray five times daily to maintain your connection with Allah.",
              "Practice quiet reflection to focus on Allah’s guidance for patience.",
              "Join a religious study group to deepen your faith."
            ],
            "ar": [
              "صلي خمس مرات يوميًا عشان تحافظ على اتصالك بالله.",
              "مارس التفكير الهادي عشان تركز على هداية الله للصبر.",
              "انضم لمجموعة دراسة دينية عشان تعمق إيمانك."
            ]
          }
        },
        {
          "id": "chronic_anger_aggressive_behavior_step_12",
          "step_number": 12,
          "description": {
            "en": "Having had a spiritual awakening as the result of these steps, we tried to carry this message to others struggling with anger or aggression, and to practice these principles in all our affairs. You’ve found calm with Allah’s help. Now, share your story and live these principles every day.",
            "ar": "بعد أن اختبرنا صحوة روحية نتيجة هذه الخطوات، حاولنا نقل هذه الرسالة لغيرنا من اللي بيعانوا مع الغضب أو العدوانية، وممارسة هذه المبادئ في كل شؤوننا. إنت لقيت هدوء بمساعدة الله. دلوقتي، شارك قصتك وعيش المبادئ دي كل يوم."
          },
          "relevance": {
            "en": "This step is about helping others with anger issues and living a life guided by Allah’s principles to stay calm and peaceful.",
            "ar": "الخطوة دي عن مساعدة الناس اللي عندهم مشاكل غضب وإنك تعيش حياة بتهديها مبادئ الله عشان تبقى هادي وسلام."
          },
          "practical_suggestions": {
            "en": [
              "Share your recovery story at a support group to inspire others.",
              "Volunteer to support newcomers in anger management programs.",
              "Apply these principles (patience, humility, self-control) in all areas of your life."
            ],
            "ar": [
              "شارك قصة تعافيك في مجموعة دعم عشان تلهم غيرك.",
              "تطوع عشان تساعد الناس الجدد في برامج إدارة الغضب.",
              "طبق المبادئ دي (الصبر، التواضع، التحكم بالنفس) في كل نواحي حياتك."
            ]
          }
        }
      ]
    }
  ]
}